-------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/cherylz/Desktop/ECO339/339THA/339log.log
  log type:  text
 opened on:  14 Dec 2023, 16:13:42

. * Load data
. use "lfs0119rr.dta", clear
(Labour force survey, January-December 1997, rebased to 2006 census population)

. 
end of do-file

. egen medianwage = median(hrlyearn), by(prov survmnth survyear)

. gen lowage_threshold = 2/3 * medianwage

. 
. gen lowage_worker = hrlyearn < lowage_threshold

. 
. gen employed = inlist(lfsstat, 1, 2)

. 
. gen MW_it = minwage / avwage1559

. 
. egen employed_rate = mean(employed), by(prov survyear age_12)

. 
. foreach p in 10 11 12 13 24 35 46 47 48 59 {
  2.     gen prov_`p' = (prov == `p')
  3. }

. forvalues y = 2001/2019 {
  2.     gen year_`y' = (survyear == `y')
  3. }

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen working_age = (age_12 >= 1 & age_12 <= 9) 

. egen total_agegrp = total(agegrp)
agegrp not found
r(111);

end of do-file

r(111);

. egen total_working_age = total(working_age)

. 
. gen agegrp = (age_12 == 1)

. 
. egen total_agegrp = total(agegrp)

. 
. gen share_agegrp = total_agegrp / total_working_age

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Set directory 
. cd "/Users/cherylz/Desktop/ECO339/339THA"
/Users/cherylz/Desktop/ECO339/339THA

. * Open a log, save as .txt
. log using "339log" , text replace
log file already open
r(604);

end of do-file

r(604);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Set directory 
. cd "/Users/cherylz/Desktop/ECO339/339THA"
/Users/cherylz/Desktop/ECO339/339THA

. * Open a log, save as .txt
. log using "339log" , text replace
log file already open
r(604);

end of do-file

r(604);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. drop share_agegrp

. 
end of do-file

. generate str var57 = "s" in 1
(17,375,850 missing values generated)

. replace var57 = "" in 1
(1 real change made)

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. drop var57

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. forvalues i = 1/9 {
  2.     gen agegrp_`i' = (age_12 == `i')
  3.     egen total_agegrp_`i' = total(agegrp_`i')
  4.     gen share_agegrp_`i' = total_agegrp_`i' / total_working_age if working_age
  5. }

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. global control share_agegrp* "year_2000 year_2001 year_2002 year_2003 year_2004 year_2005 year_
> 2006 year_2007 year_2008 year_2009 prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov
> _47 prov_48 prov_59"

. 
end of do-file

. * Create Lagged Minimum Wage Variable

. sort MW_it survyear

. gen MW_it-_1 = L.MW_it
variable MW_it already defined
r(110);

. restore
nothing to restore
r(622);

. gen april_minwage = minwage if survmnth == 4
(15,925,966 missing values generated)

. 
. by prov survyear: carryforward april_minwage, generate(april_minwage_year)
not sorted
r(5);

. 
. sort prov survyear

. 
. by prov survyear: carryforward april_minwage, generate(april_minwage_year)
command carryforward is unrecognized
r(199);

. 
. by prov survyear: egen april_minwage_filled = max(april_minwage)

. 
. replace minwage = april_minwage_filled
(4,423,697 real changes made)

. 
. drop MW_it

. gen april_avwage = avwage1559 if survmnth == 4
(15,925,966 missing values generated)

. by prov survyear: egen april_avwage_filled = max(april_avwage)

. replace avwage1559 = april_avwage_filled
(15,925,966 real changes made)

. gen MW_it = minwage / avwage1559

. 
. by prov: gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. by prov (survyear): gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. xtset prov survyear
repeated time values within panel
r(451);

. by prov (survyear): gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. gen yrmth = ym(survyear, survmnth)

. xtset prov yrmth
repeated time values within panel
r(451);

. by prov (yrmth): gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. preserve

. 
. collapse (first) MW_it, by(survyear prov)

. 
. by prov (survyear): gen MW_it_1 = L.MW_it
not sorted
r(5);

. 
. sort prov survyear

. 
. by prov (survyear): gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. by prov: gen MW_it_1 = L.MW_it
time variable not set
r(111);

. 
. xtset prov survyear

Panel variable: prov (strongly balanced)
 Time variable: survyear, 2001 to 2019
         Delta: 1 unit

. 
. by prov (survyear): gen MW_it_1 = L.MW_it
(10 missing values generated)

. 
. tempfile collapsed_data

. 
. save `collapsed_data'
file /var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//S_83271.000002 saved as .dta format

. 
. restore

. 
. merge m:1 survyear prov using `collapsed_data'
(label prov already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        17,375,851  (_merge==3)
    -----------------------------------------

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate MW_it MW_it_1 provur $controls

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(3, 16402518)  >  99999.00
       Model |  13430.6966         3  4476.89887   Prob > F        =    0.0000
    Residual |  241956.909  16402518  .014751205   R-squared       =    0.0526
-------------+----------------------------------   Adj R-squared   =    0.0526
       Total |  255387.606  16402521  .015570022   Root MSE        =    .12145

------------------------------------------------------------------------------
employed_r~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       MW_it |   .0173592   .0017582     9.87   0.000     .0139132    .0208053
     MW_it_1 |  -.0348143   .0018464   -18.85   0.000    -.0384332   -.0311954
      provur |  -.0131886   .0000141  -934.37   0.000    -.0132163   -.0131609
       _cons |   .8290899   .0003218  2576.27   0.000     .8284592    .8297207
------------------------------------------------------------------------------

. 
end of do-file

. reg employed_rate MW_it MW_it_1 provur $controls [aweight = weight]
weight not found
r(111);

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 4,542,787,268)

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(3, 16402518)  >  99999.00
       Model |  7622.41632         3  2540.80544   Prob > F        =    0.0000
    Residual |  232799.856  16402518  .014192934   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0317
       Total |  240422.272  16402521  .014657641   Root MSE        =    .11913

------------------------------------------------------------------------------
employed_r~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       MW_it |  -.0082614   .0016053    -5.15   0.000    -.0114077    -.005115
     MW_it_1 |  -.0458608   .0017281   -26.54   0.000    -.0492479   -.0424738
      provur |  -.0125756   .0000178  -707.66   0.000    -.0126104   -.0125408
       _cons |   .8420446   .0003297  2553.63   0.000     .8413983    .8426909
------------------------------------------------------------------------------

. 
. global controls i.share_agegrp_* i.year_* "prov_10 prov_11 prov_12 prov_13 prov_24 pro
> v_35 prov_46 prov_47 prov_48 prov_59"

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
"prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59 invalid
>  name
r(198);

. 
. foreach p in 10 11 12 13 24 35 46 47 48 59 {
  2. 
. foreach p in 10 11 12 13 24 35 46 47 48 59 {
  3.     gen prov_`p' = (prov == `p')
  4. }
  5. forvalues y = 2001/2019 {
  6.     gen year_`y' = (survyear == `y')
  7. }
  8. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
  9. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"
 10. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
 11. 
. }
variable prov_10 already defined
r(110);

. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
"prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59 invalid
>  name
r(198);

. 
. global controls i.share_agegrp_* i.year_* prov_10 prov_11 prov_12 prov_13 prov_24 prov
> _35 prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
share_agegrp_1:  factor variables may not contain noninteger values
r(452);

. 
. global controls share_agegrp_* year_* prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 
> prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 4,542,787,268)
note: share_agegrp_1 omitted because of collinearity.
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: share_agegrp_6 omitted because of collinearity.
note: share_agegrp_7 omitted because of collinearity.
note: share_agegrp_8 omitted because of collinearity.
note: share_agegrp_9 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2002 omitted because of collinearity.
note: prov_11 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(29, 16402492) =  25433.67
       Model |  10345.9227        29  356.755956   Prob > F        =    0.0000
    Residual |   230076.35  16402492  .014026914   R-squared       =    0.0430
-------------+----------------------------------   Adj R-squared   =    0.0430
       Total |  240422.272  16402521  .014657641   Root MSE        =    .11844

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.1599764   .0019924   -80.29   0.000    -.1638814   -.1560713
       MW_it_1 |  -.0455781   .0020756   -21.96   0.000    -.0496462     -.04151
        provur |  -.0078263     .00003  -261.23   0.000     -.007885   -.0077676
share_agegrp_1 |          0  (omitted)
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
share_agegrp_6 |          0  (omitted)
share_agegrp_7 |          0  (omitted)
share_agegrp_8 |          0  (omitted)
share_agegrp_9 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |          0  (omitted)
     year_2003 |   .0049814   .0001813    27.47   0.000      .004626    .0053368
     year_2004 |   .0017722   .0001811     9.79   0.000     .0014174    .0021271
     year_2005 |   .0023146   .0001817    12.74   0.000     .0019585    .0026707
     year_2006 |   .0067297   .0001841    36.55   0.000     .0063688    .0070906
     year_2007 |   .0139958   .0001836    76.23   0.000      .013636    .0143557
     year_2008 |    .015216   .0001866    81.55   0.000     .0148503    .0155817
     year_2009 |    .009615   .0001817    52.93   0.000     .0092589    .0099711
     year_2010 |    .010049    .000183    54.93   0.000     .0096904    .0104076
     year_2011 |   .0119011   .0001841    64.63   0.000     .0115401     .012262
     year_2012 |   .0146656   .0001862    78.78   0.000     .0143007    .0150304
     year_2013 |   .0135739   .0001871    72.55   0.000     .0132072    .0139406
     year_2014 |   .0136815   .0001863    73.44   0.000     .0133164    .0140467
     year_2015 |   .0176032   .0001879    93.71   0.000      .017235    .0179714
     year_2016 |   .0188788   .0001877   100.56   0.000     .0185109    .0192468
     year_2017 |   .0257944   .0001935   133.28   0.000     .0254151    .0261737
     year_2018 |   .0319637   .0002262   141.29   0.000     .0315203    .0324071
     year_2019 |   .0380843   .0002343   162.57   0.000     .0376252    .0385435
       prov_10 |  -.0933275   .0005324  -175.31   0.000    -.0943709   -.0922841
       prov_11 |          0  (omitted)
       prov_12 |  -.0465694   .0004955   -93.99   0.000    -.0475406   -.0455983
       prov_13 |  -.0407853   .0005018   -81.28   0.000    -.0417688   -.0398019
       prov_24 |  -.0209754   .0004718   -44.46   0.000    -.0219001   -.0200507
       prov_35 |  -.0366139   .0004768   -76.79   0.000    -.0375484   -.0356793
       prov_46 |  -.0144932   .0005084   -28.51   0.000    -.0154896   -.0134968
       prov_47 |  -.0102297   .0005164   -19.81   0.000    -.0112419   -.0092175
       prov_48 |  -.0198798   .0005079   -39.14   0.000    -.0208752   -.0188843
       prov_59 |  -.0397482   .0004852   -81.93   0.000    -.0406991   -.0387973
         _cons |   .8931131   .0008536  1046.25   0.000     .8914401    .8947862
--------------------------------------------------------------------------------

. 
. global controls share_agegrp_2-share_agegrp_9 year_2002-year_2019 prov_10 prov_11 prov
> _12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 4,542,787,268)
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: total_agegrp_4 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: total_agegrp_5 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: total_agegrp_6 omitted because of collinearity.
note: share_agegrp_6 omitted because of collinearity.
note: total_agegrp_7 omitted because of collinearity.
note: share_agegrp_7 omitted because of collinearity.
note: total_agegrp_8 omitted because of collinearity.
note: share_agegrp_8 omitted because of collinearity.
note: total_agegrp_9 omitted because of collinearity.
note: share_agegrp_9 omitted because of collinearity.
note: year_2002 omitted because of collinearity.
note: prov_11 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(37, 16402484) >  99999.00
       Model |  177718.326        37  4803.19799   Prob > F        =    0.0000
    Residual |  62703.9467  16402484  .003822832   R-squared       =    0.7392
-------------+----------------------------------   Adj R-squared   =    0.7392
       Total |  240422.272  16402521  .014657641   Root MSE        =    .06183

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.1528645   .0010401  -146.96   0.000    -.1549032   -.1508259
       MW_it_1 |  -.0328419   .0010836   -30.31   0.000    -.0349657   -.0307181
        provur |  -.0083191   .0000156  -531.89   0.000    -.0083497   -.0082884
share_agegrp_2 |          0  (omitted)
      agegrp_3 |   .2187338   .0000571  3829.15   0.000     .2186218    .2188457
total_agegrp_3 |  -.0000731   65568.79    -0.00   1.000    -128512.5    128512.5
share_agegrp_3 |          0  (omitted)
      agegrp_4 |   .2420632   .0000571  4241.48   0.000     .2419513    .2421751
total_agegrp_4 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
      agegrp_5 |   .2529905   .0000569  4447.37   0.000      .252879    .2531019
total_agegrp_5 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
      agegrp_6 |   .2592424   .0000557  4654.54   0.000     .2591332    .2593516
total_agegrp_6 |          0  (omitted)
share_agegrp_6 |          0  (omitted)
      agegrp_7 |   .2523009   .0000555  4544.32   0.000     .2521921    .2524097
total_agegrp_7 |          0  (omitted)
share_agegrp_7 |          0  (omitted)
      agegrp_8 |   .2191064   .0000555  3949.21   0.000     .2189976    .2192151
total_agegrp_8 |          0  (omitted)
share_agegrp_8 |          0  (omitted)
      agegrp_9 |   .0953131   .0000573  1663.98   0.000     .0952009    .0954254
total_agegrp_9 |          0  (omitted)
share_agegrp_9 |          0  (omitted)
     year_2002 |          0  (omitted)
     year_2003 |   .0056366   .0000947    59.55   0.000     .0054511    .0058221
     year_2004 |   .0028503   .0000945    30.15   0.000      .002665    .0030355
     year_2005 |   .0040574   .0000949    42.77   0.000     .0038715    .0042433
     year_2006 |   .0089739   .0000961    93.35   0.000     .0087855    .0091623
     year_2007 |   .0164436   .0000959   171.55   0.000     .0162558    .0166315
     year_2008 |   .0179433   .0000974   184.19   0.000     .0177523    .0181342
     year_2009 |   .0134361   .0000949   141.65   0.000     .0132502     .013622
     year_2010 |   .0138382   .0000955   144.86   0.000     .0136509    .0140254
     year_2011 |   .0157054   .0000962   163.34   0.000     .0155169    .0158938
     year_2012 |   .0187861   .0000972   193.26   0.000     .0185955    .0189766
     year_2013 |   .0178221   .0000977   182.43   0.000     .0176306    .0180136
     year_2014 |    .017845   .0000973   183.44   0.000     .0176544    .0180357
     year_2015 |   .0215032   .0000981   219.20   0.000      .021311    .0216955
     year_2016 |    .022424    .000098   228.73   0.000     .0222318    .0226161
     year_2017 |   .0287107   .0001011   284.09   0.000     .0285126    .0289088
     year_2018 |   .0340235   .0001181   288.02   0.000      .033792    .0342551
     year_2019 |   .0393278   .0001223   321.52   0.000     .0390881    .0395676
       prov_10 |  -.0962406   .0002779  -346.29   0.000    -.0967853   -.0956958
       prov_11 |          0  (omitted)
       prov_12 |  -.0496243   .0002587  -191.85   0.000    -.0501313   -.0491173
       prov_13 |  -.0451675   .0002619  -172.43   0.000    -.0456809   -.0446541
       prov_24 |   -.027454   .0002463  -111.46   0.000    -.0279367   -.0269712
       prov_35 |  -.0412013   .0002489  -165.52   0.000    -.0416892   -.0407135
       prov_46 |  -.0175245   .0002654   -66.03   0.000    -.0180446   -.0170043
       prov_47 |  -.0116052   .0002696   -43.04   0.000    -.0121336   -.0110768
       prov_48 |  -.0264097   .0002651   -99.60   0.000    -.0269293     -.02589
       prov_59 |  -.0446157   .0002533  -176.15   0.000    -.0451122   -.0441193
         _cons |   123.6992   1.10e+11     0.00   1.000    -2.16e+11    2.16e+11
--------------------------------------------------------------------------------

. 
. global controls share_agegrp_2 share_agegrp_3 share_agegrp_4 share_agegrp_5 share_ageg
> rp_6 share_agegrp_7 share_agegrp_8 share_agegrp_9 year_2002 year_2003 year_2004 year_2
> 005 year_2006 year_2007 year_2008 year_2009 year_2010 year_2011 year_2012 year_2013 ye
> ar_2014 year_2015 year_2016 year_2017 year_2018 year_2019 prov_10 prov_11 prov_12 prov
> _13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 4,542,787,268)
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: share_agegrp_6 omitted because of collinearity.
note: share_agegrp_7 omitted because of collinearity.
note: share_agegrp_8 omitted because of collinearity.
note: share_agegrp_9 omitted because of collinearity.
note: year_2002 omitted because of collinearity.
note: prov_11 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(29, 16402492) =  25433.67
       Model |  10345.9227        29  356.755956   Prob > F        =    0.0000
    Residual |   230076.35  16402492  .014026914   R-squared       =    0.0430
-------------+----------------------------------   Adj R-squared   =    0.0430
       Total |  240422.272  16402521  .014657641   Root MSE        =    .11844

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.1599764   .0019924   -80.29   0.000    -.1638814   -.1560713
       MW_it_1 |  -.0455781   .0020756   -21.96   0.000    -.0496462     -.04151
        provur |  -.0078263     .00003  -261.23   0.000     -.007885   -.0077676
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
share_agegrp_6 |          0  (omitted)
share_agegrp_7 |          0  (omitted)
share_agegrp_8 |          0  (omitted)
share_agegrp_9 |          0  (omitted)
     year_2002 |          0  (omitted)
     year_2003 |   .0049814   .0001813    27.47   0.000      .004626    .0053368
     year_2004 |   .0017722   .0001811     9.79   0.000     .0014174    .0021271
     year_2005 |   .0023146   .0001817    12.74   0.000     .0019585    .0026707
     year_2006 |   .0067297   .0001841    36.55   0.000     .0063688    .0070906
     year_2007 |   .0139958   .0001836    76.23   0.000      .013636    .0143557
     year_2008 |    .015216   .0001866    81.55   0.000     .0148503    .0155817
     year_2009 |    .009615   .0001817    52.93   0.000     .0092589    .0099711
     year_2010 |    .010049    .000183    54.93   0.000     .0096904    .0104076
     year_2011 |   .0119011   .0001841    64.63   0.000     .0115401     .012262
     year_2012 |   .0146656   .0001862    78.78   0.000     .0143007    .0150304
     year_2013 |   .0135739   .0001871    72.55   0.000     .0132072    .0139406
     year_2014 |   .0136815   .0001863    73.44   0.000     .0133164    .0140467
     year_2015 |   .0176032   .0001879    93.71   0.000      .017235    .0179714
     year_2016 |   .0188788   .0001877   100.56   0.000     .0185109    .0192468
     year_2017 |   .0257944   .0001935   133.28   0.000     .0254151    .0261737
     year_2018 |   .0319637   .0002262   141.29   0.000     .0315203    .0324071
     year_2019 |   .0380843   .0002343   162.57   0.000     .0376252    .0385435
       prov_10 |  -.0933275   .0005324  -175.31   0.000    -.0943709   -.0922841
       prov_11 |          0  (omitted)
       prov_12 |  -.0465694   .0004955   -93.99   0.000    -.0475406   -.0455983
       prov_13 |  -.0407853   .0005018   -81.28   0.000    -.0417688   -.0398019
       prov_24 |  -.0209754   .0004718   -44.46   0.000    -.0219001   -.0200507
       prov_35 |  -.0366139   .0004768   -76.79   0.000    -.0375484   -.0356793
       prov_46 |  -.0144932   .0005084   -28.51   0.000    -.0154896   -.0134968
       prov_47 |  -.0102297   .0005164   -19.81   0.000    -.0112419   -.0092175
       prov_48 |  -.0198798   .0005079   -39.14   0.000    -.0208752   -.0188843
       prov_59 |  -.0397482   .0004852   -81.93   0.000    -.0406991   -.0387973
         _cons |   .8931131   .0008536  1046.25   0.000     .8914401    .8947862
--------------------------------------------------------------------------------

. 
. global controls share_agegrp_1 share_agegrp_2 share_agegrp_3 share_agegrp_4 share_ageg
> rp_5 year_2001 year_2002 year_2003 year_2004 year_2005 year_2006 year_2007 year_2008 y
> ear_2009 year_2010 year_2011 year_2012 year_2013 year_2014 year_2015 year_2016 year_20
> 17 year_2018 year_2019 prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47
>  prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 4,542,787,268)
note: share_agegrp_1 omitted because of collinearity.
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2002 omitted because of collinearity.
note: prov_11 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(29, 16402492) =  25433.67
       Model |  10345.9227        29  356.755956   Prob > F        =    0.0000
    Residual |   230076.35  16402492  .014026914   R-squared       =    0.0430
-------------+----------------------------------   Adj R-squared   =    0.0430
       Total |  240422.272  16402521  .014657641   Root MSE        =    .11844

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.1599764   .0019924   -80.29   0.000    -.1638814   -.1560713
       MW_it_1 |  -.0455781   .0020756   -21.96   0.000    -.0496462     -.04151
        provur |  -.0078263     .00003  -261.23   0.000     -.007885   -.0077676
share_agegrp_1 |          0  (omitted)
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |          0  (omitted)
     year_2003 |   .0049814   .0001813    27.47   0.000      .004626    .0053368
     year_2004 |   .0017722   .0001811     9.79   0.000     .0014174    .0021271
     year_2005 |   .0023146   .0001817    12.74   0.000     .0019585    .0026707
     year_2006 |   .0067297   .0001841    36.55   0.000     .0063688    .0070906
     year_2007 |   .0139958   .0001836    76.23   0.000      .013636    .0143557
     year_2008 |    .015216   .0001866    81.55   0.000     .0148503    .0155817
     year_2009 |    .009615   .0001817    52.93   0.000     .0092589    .0099711
     year_2010 |    .010049    .000183    54.93   0.000     .0096904    .0104076
     year_2011 |   .0119011   .0001841    64.63   0.000     .0115401     .012262
     year_2012 |   .0146656   .0001862    78.78   0.000     .0143007    .0150304
     year_2013 |   .0135739   .0001871    72.55   0.000     .0132072    .0139406
     year_2014 |   .0136815   .0001863    73.44   0.000     .0133164    .0140467
     year_2015 |   .0176032   .0001879    93.71   0.000      .017235    .0179714
     year_2016 |   .0188788   .0001877   100.56   0.000     .0185109    .0192468
     year_2017 |   .0257944   .0001935   133.28   0.000     .0254151    .0261737
     year_2018 |   .0319637   .0002262   141.29   0.000     .0315203    .0324071
     year_2019 |   .0380843   .0002343   162.57   0.000     .0376252    .0385435
       prov_10 |  -.0933275   .0005324  -175.31   0.000    -.0943709   -.0922841
       prov_11 |          0  (omitted)
       prov_12 |  -.0465694   .0004955   -93.99   0.000    -.0475406   -.0455983
       prov_13 |  -.0407853   .0005018   -81.28   0.000    -.0417688   -.0398019
       prov_24 |  -.0209754   .0004718   -44.46   0.000    -.0219001   -.0200507
       prov_35 |  -.0366139   .0004768   -76.79   0.000    -.0375484   -.0356793
       prov_46 |  -.0144932   .0005084   -28.51   0.000    -.0154896   -.0134968
       prov_47 |  -.0102297   .0005164   -19.81   0.000    -.0112419   -.0092175
       prov_48 |  -.0198798   .0005079   -39.14   0.000    -.0208752   -.0188843
       prov_59 |  -.0397482   .0004852   -81.93   0.000    -.0406991   -.0387973
         _cons |   .8931131   .0008536  1046.25   0.000     .8914401    .8947862
--------------------------------------------------------------------------------

. 
. egen employed_rate1519 = mean(employed) if age_12 == 1, by(prov survyear)
(15,517,897 missing values generated)

. 
. egen employed_rate2024 = mean(employed) if age_12 == 2, by(prov survyear)
(15,657,813 missing values generated)

. 
. 
. egen employed_rate2529 = mean(employed) if age_12 == 3, by(prov survyear)
(15,692,353 missing values generated)

. 
. global controls share_agegrp_1 share_agegrp_2 share_agegrp_3 year_2001 year_2002 year_
> 2003 year_2004 year_2005 year_2006 year_2007 year_2008 year_2009 year_2010 year_2011 y
> ear_2012 year_2013 year_2014 year_2015 year_2016 year_2017 year_2018 year_2019 prov_10
>  prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate MW_it MW_it_1 provur $controls [aweight = fweight]
--Break--
r(1);

. 
. reg employed_rate1519 MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 453,777,829)
note: share_agegrp_1 omitted because of collinearity.
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2009 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
       MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
        provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
share_agegrp_1 |          0  (omitted)
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |    -.00404   .0000964   -41.90   0.000     -.004229    -.003851
     year_2003 |  -.0044453   .0000962   -46.22   0.000    -.0046337   -.0042568
     year_2004 |  -.0149696   .0000974  -153.64   0.000    -.0151606   -.0147786
     year_2005 |  -.0166852   .0000982  -169.98   0.000    -.0168776   -.0164928
     year_2006 |   -.014492   .0000985  -147.07   0.000    -.0146852   -.0142989
     year_2007 |   .0021307   .0000993    21.45   0.000      .001936    .0023254
     year_2008 |   .0092226   .0000988    93.34   0.000     .0090289    .0094162
     year_2009 |          0  (omitted)
     year_2010 |  -.0169364   .0000935  -181.14   0.000    -.0171196   -.0167531
     year_2011 |  -.0198116   .0000955  -207.50   0.000    -.0199987   -.0196244
     year_2012 |  -.0298702   .0000971  -307.75   0.000    -.0300604   -.0296799
     year_2013 |  -.0370649   .0000987  -375.67   0.000    -.0372583   -.0368715
     year_2014 |   -.028306   .0000995  -284.50   0.000     -.028501    -.028111
     year_2015 |  -.0263997   .0000998  -264.58   0.000    -.0265952   -.0262041
     year_2016 |  -.0266514   .0001004  -265.42   0.000    -.0268482   -.0264546
     year_2017 |  -.0227829   .0001034  -220.24   0.000    -.0229856   -.0225802
     year_2018 |  -.0115601   .0001181   -97.89   0.000    -.0117915   -.0113286
     year_2019 |  -.0049491   .0001244   -39.79   0.000    -.0051929   -.0047053
       prov_10 |          0  (omitted)
       prov_11 |    .125625   .0002794   449.60   0.000     .1250773    .1261726
       prov_12 |   .0181978   .0001883    96.66   0.000     .0178288    .0185668
       prov_13 |   .0493801   .0001906   259.06   0.000     .0490065    .0497536
       prov_24 |   .0489797    .000168   291.59   0.000     .0486504    .0493089
       prov_35 |   .0022106    .000174    12.71   0.000     .0018697    .0025516
       prov_46 |   .0324578   .0002121   153.04   0.000     .0320421    .0328735
       prov_47 |   .0305711   .0002074   147.42   0.000     .0301647    .0309776
       prov_48 |   .0079751   .0001918    41.58   0.000     .0075992     .008351
       prov_59 |  -.0014751   .0001811    -8.14   0.000      -.00183   -.0011201
         _cons |   .7108057   .0004049  1755.38   0.000     .7100121    .7115994
--------------------------------------------------------------------------------

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. global controls year_2001 year_2002 year_2003 year_2004 year_2005 year_2006 year_2007 
> year_2008 year_2009 year_2010 year_2011 year_2012 year_2013 year_2014 year_2015 year_2
> 016 year_2017 year_2018 year_2019 prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov
> _46 prov_47 prov_48 prov_59

. 
. * Emperical Framework
. reg employed_rate1519 MW_it MW_it_1 provur $controls [aweight = fweight]
(sum of wgt is 453,777,829)
note: year_2001 omitted because of collinearity.
note: year_2009 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

------------------------------------------------------------------------------
employe~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
     MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
      provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
   year_2001 |          0  (omitted)
   year_2002 |    -.00404   .0000964   -41.90   0.000     -.004229    -.003851
   year_2003 |  -.0044453   .0000962   -46.22   0.000    -.0046337   -.0042568
   year_2004 |  -.0149696   .0000974  -153.64   0.000    -.0151606   -.0147786
   year_2005 |  -.0166852   .0000982  -169.98   0.000    -.0168776   -.0164928
   year_2006 |   -.014492   .0000985  -147.07   0.000    -.0146852   -.0142989
   year_2007 |   .0021307   .0000993    21.45   0.000      .001936    .0023254
   year_2008 |   .0092226   .0000988    93.34   0.000     .0090289    .0094162
   year_2009 |          0  (omitted)
   year_2010 |  -.0169364   .0000935  -181.14   0.000    -.0171196   -.0167531
   year_2011 |  -.0198116   .0000955  -207.50   0.000    -.0199987   -.0196244
   year_2012 |  -.0298702   .0000971  -307.75   0.000    -.0300604   -.0296799
   year_2013 |  -.0370649   .0000987  -375.67   0.000    -.0372583   -.0368715
   year_2014 |   -.028306   .0000995  -284.50   0.000     -.028501    -.028111
   year_2015 |  -.0263997   .0000998  -264.58   0.000    -.0265952   -.0262041
   year_2016 |  -.0266514   .0001004  -265.42   0.000    -.0268482   -.0264546
   year_2017 |  -.0227829   .0001034  -220.24   0.000    -.0229856   -.0225802
   year_2018 |  -.0115601   .0001181   -97.89   0.000    -.0117915   -.0113286
   year_2019 |  -.0049491   .0001244   -39.79   0.000    -.0051929   -.0047053
     prov_10 |          0  (omitted)
     prov_11 |    .125625   .0002794   449.60   0.000     .1250773    .1261726
     prov_12 |   .0181978   .0001883    96.66   0.000     .0178288    .0185668
     prov_13 |   .0493801   .0001906   259.06   0.000     .0490065    .0497536
     prov_24 |   .0489797    .000168   291.59   0.000     .0486504    .0493089
     prov_35 |   .0022106    .000174    12.71   0.000     .0018697    .0025516
     prov_46 |   .0324578   .0002121   153.04   0.000     .0320421    .0328735
     prov_47 |   .0305711   .0002074   147.42   0.000     .0301647    .0309776
     prov_48 |   .0079751   .0001918    41.58   0.000     .0075992     .008351
     prov_59 |  -.0014751   .0001811    -8.14   0.000      -.00183   -.0011201
       _cons |   .7108057   .0004049  1755.38   0.000     .7100121    .7115994
------------------------------------------------------------------------------

. 
end of do-file

. reg employed_rate1519 MW_it MW_it_1 provur share_agegrp_1 $controls [aweight = fweight
> ]
(sum of wgt is 453,777,829)
note: share_agegrp_1 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2009 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
       MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
        provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
share_agegrp_1 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |    -.00404   .0000964   -41.90   0.000     -.004229    -.003851
     year_2003 |  -.0044453   .0000962   -46.22   0.000    -.0046337   -.0042568
     year_2004 |  -.0149696   .0000974  -153.64   0.000    -.0151606   -.0147786
     year_2005 |  -.0166852   .0000982  -169.98   0.000    -.0168776   -.0164928
     year_2006 |   -.014492   .0000985  -147.07   0.000    -.0146852   -.0142989
     year_2007 |   .0021307   .0000993    21.45   0.000      .001936    .0023254
     year_2008 |   .0092226   .0000988    93.34   0.000     .0090289    .0094162
     year_2009 |          0  (omitted)
     year_2010 |  -.0169364   .0000935  -181.14   0.000    -.0171196   -.0167531
     year_2011 |  -.0198116   .0000955  -207.50   0.000    -.0199987   -.0196244
     year_2012 |  -.0298702   .0000971  -307.75   0.000    -.0300604   -.0296799
     year_2013 |  -.0370649   .0000987  -375.67   0.000    -.0372583   -.0368715
     year_2014 |   -.028306   .0000995  -284.50   0.000     -.028501    -.028111
     year_2015 |  -.0263997   .0000998  -264.58   0.000    -.0265952   -.0262041
     year_2016 |  -.0266514   .0001004  -265.42   0.000    -.0268482   -.0264546
     year_2017 |  -.0227829   .0001034  -220.24   0.000    -.0229856   -.0225802
     year_2018 |  -.0115601   .0001181   -97.89   0.000    -.0117915   -.0113286
     year_2019 |  -.0049491   .0001244   -39.79   0.000    -.0051929   -.0047053
       prov_10 |          0  (omitted)
       prov_11 |    .125625   .0002794   449.60   0.000     .1250773    .1261726
       prov_12 |   .0181978   .0001883    96.66   0.000     .0178288    .0185668
       prov_13 |   .0493801   .0001906   259.06   0.000     .0490065    .0497536
       prov_24 |   .0489797    .000168   291.59   0.000     .0486504    .0493089
       prov_35 |   .0022106    .000174    12.71   0.000     .0018697    .0025516
       prov_46 |   .0324578   .0002121   153.04   0.000     .0320421    .0328735
       prov_47 |   .0305711   .0002074   147.42   0.000     .0301647    .0309776
       prov_48 |   .0079751   .0001918    41.58   0.000     .0075992     .008351
       prov_59 |  -.0014751   .0001811    -8.14   0.000      -.00183   -.0011201
         _cons |   .7108057   .0004049  1755.38   0.000     .7100121    .7115994
--------------------------------------------------------------------------------

. 
. reg employed_rate2024 MW_it MW_it_1 provur share_agegrp_2 $controls [aweight = fweight
> ]
(sum of wgt is 492,109,357)
note: share_agegrp_2 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2007 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,625,161
-------------+----------------------------------   F(29, 1625131)  >  99999.00
       Model |  1975.86294        29  68.1332047   Prob > F        =    0.0000
    Residual |  308.458204 1,625,131  .000189805   R-squared       =    0.8650
-------------+----------------------------------   Adj R-squared   =    0.8650
       Total |  2284.32114 1,625,160  .001405598   Root MSE        =    .01378

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2191733   .0007335  -298.81   0.000    -.2206109   -.2177357
       MW_it_1 |  -.0212506   .0007634   -27.84   0.000    -.0227468   -.0197543
        provur |  -.0090107   .0000112  -806.52   0.000    -.0090326   -.0089888
share_agegrp_2 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |  -.0126019   .0000685  -184.02   0.000    -.0127361   -.0124676
     year_2003 |  -.0081114   .0000679  -119.49   0.000    -.0082444   -.0079783
     year_2004 |  -.0141988   .0000669  -212.38   0.000    -.0143298   -.0140678
     year_2005 |  -.0152327   .0000664  -229.55   0.000    -.0153628   -.0151026
     year_2006 |  -.0059694   .0000662   -90.16   0.000    -.0060992   -.0058397
     year_2007 |          0  (omitted)
     year_2008 |  -.0042555   .0000663   -64.15   0.000    -.0043855   -.0041255
     year_2009 |  -.0181211   .0000696  -260.50   0.000    -.0182574   -.0179847
     year_2010 |  -.0195323   .0000694  -281.34   0.000    -.0196684   -.0193962
     year_2011 |  -.0197423   .0000682  -289.39   0.000     -.019876   -.0196086
     year_2012 |  -.0215217   .0000681  -316.21   0.000    -.0216551   -.0213883
     year_2013 |  -.0197023   .0000679  -290.19   0.000    -.0198354   -.0195692
     year_2014 |  -.0158655   .0000675  -235.08   0.000    -.0159978   -.0157333
     year_2015 |  -.0203031   .0000677  -300.01   0.000    -.0204358   -.0201705
     year_2016 |  -.0150513   .0000683  -220.51   0.000    -.0151851   -.0149175
     year_2017 |   -.009658    .000069  -140.02   0.000    -.0097932   -.0095228
     year_2018 |  -.0098243   .0000792  -124.09   0.000    -.0099795   -.0096691
     year_2019 |   .0004204   .0000829     5.07   0.000      .000258    .0005828
       prov_10 |          0  (omitted)
       prov_11 |    .100297   .0001986   505.11   0.000     .0999078    .1006862
       prov_12 |    .052303   .0001307   400.27   0.000     .0520469    .0525591
       prov_13 |   .0485916   .0001332   364.82   0.000     .0483305    .0488527
       prov_24 |   .0954796   .0001165   819.75   0.000     .0952514    .0957079
       prov_35 |   .0455517   .0001205   378.06   0.000     .0453155    .0457878
       prov_46 |    .099213   .0001463   678.21   0.000     .0989263    .0994997
       prov_47 |   .0831385   .0001432   580.74   0.000     .0828579    .0834191
       prov_48 |   .0928141    .000132   703.10   0.000     .0925554    .0930728
       prov_59 |   .0646166   .0001252   516.02   0.000     .0643712     .064862
         _cons |   .7890152   .0002632  2998.34   0.000     .7884994     .789531
--------------------------------------------------------------------------------

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate2529 MW_it MW_it_1 provur share_agegrp_2 $controls [aweight = fweight
> ]
(sum of wgt is 494,263,115)
note: share_agegrp_2 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2002 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,593,716
-------------+----------------------------------   F(29, 1593686)  >  99999.00
       Model |  717.301172        29  24.7345232   Prob > F        =    0.0000
    Residual |  207.965852 1,593,686  .000130494   R-squared       =    0.7752
-------------+----------------------------------   Adj R-squared   =    0.7752
       Total |  925.267024 1,593,715  .000580572   Root MSE        =    .01142

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.1467773   .0006097  -240.72   0.000    -.1479723   -.1455822
       MW_it_1 |  -.0537317   .0006369   -84.36   0.000    -.0549801   -.0524834
        provur |  -.0070969   9.27e-06  -765.96   0.000     -.007115   -.0070787
share_agegrp_2 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |          0  (omitted)
     year_2003 |    .006399   .0000577   110.91   0.000     .0062859    .0065121
     year_2004 |   -.001451   .0000576   -25.21   0.000    -.0015638   -.0013382
     year_2005 |   .0074379   .0000577   128.86   0.000     .0073247     .007551
     year_2006 |   .0129218   .0000584   221.31   0.000     .0128074    .0130362
     year_2007 |   .0123509    .000058   212.88   0.000     .0122371    .0124646
     year_2008 |   .0132798   .0000588   225.95   0.000     .0131646     .013395
     year_2009 |   .0040398    .000057    70.83   0.000      .003928    .0041516
     year_2010 |   .0103397   .0000574   180.26   0.000     .0102272    .0104521
     year_2011 |   .0054949   .0000577    95.28   0.000     .0053818    .0056079
     year_2012 |   .0140983   .0000583   241.73   0.000      .013984    .0142126
     year_2013 |   .0054439   .0000586    92.90   0.000      .005329    .0055587
     year_2014 |   .0038132   .0000583    65.45   0.000      .003699    .0039274
     year_2015 |   .0051997   .0000585    88.83   0.000      .005085    .0053144
     year_2016 |   .0105325   .0000583   180.53   0.000     .0104181    .0106468
     year_2017 |   .0171456     .00006   285.99   0.000     .0170281    .0172631
     year_2018 |   .0322032     .00007   459.85   0.000     .0320659    .0323404
     year_2019 |   .0331199   .0000725   456.95   0.000     .0329779     .033262
       prov_10 |          0  (omitted)
       prov_11 |   .0873485   .0001763   495.51   0.000      .087003     .087694
       prov_12 |   .0500913   .0001115   449.06   0.000     .0498727      .05031
       prov_13 |    .056772   .0001136   499.76   0.000     .0565494    .0569947
       prov_24 |   .0775302   .0000985   786.79   0.000      .077337    .0777233
       prov_35 |   .0567847   .0001018   557.74   0.000     .0565851    .0569842
       prov_46 |   .0610401   .0001232   495.56   0.000     .0607987    .0612816
       prov_47 |   .0640157     .00012   533.63   0.000     .0637805    .0642508
       prov_48 |   .0596484   .0001102   541.07   0.000     .0594323    .0598644
       prov_59 |   .0492822   .0001056   466.70   0.000     .0490752    .0494891
         _cons |    .842801   .0002243  3757.61   0.000     .8423614    .8432406
--------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. global region_dummies "prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47
>  prov_48 prov_59"

. global year_dummies "year_2001 year_2002 year_2003 year_2004 year_2005 year_2006 year_
> 2007 year_2008 year_2009 year_2010 year_2011 year_2012 year_2013 year_2014 year_2015 y
> ear_2016 year_2017 year_2018 year_2019"

. 
end of do-file

. reg employed_rate1519 MW_it MW_it_1 provur share_agegrp_1 $region_dummies $year_dummie
> s [aweight = fweight]
(sum of wgt is 453,777,829)
note: share_agegrp_1 omitted because of collinearity.
note: prov_10 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2009 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
       MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
        provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
share_agegrp_1 |          0  (omitted)
       prov_10 |          0  (omitted)
       prov_11 |    .125625   .0002794   449.60   0.000     .1250773    .1261726
       prov_12 |   .0181978   .0001883    96.66   0.000     .0178288    .0185668
       prov_13 |   .0493801   .0001906   259.06   0.000     .0490065    .0497536
       prov_24 |   .0489797    .000168   291.59   0.000     .0486504    .0493089
       prov_35 |   .0022106    .000174    12.71   0.000     .0018697    .0025516
       prov_46 |   .0324578   .0002121   153.04   0.000     .0320421    .0328735
       prov_47 |   .0305711   .0002074   147.42   0.000     .0301647    .0309776
       prov_48 |   .0079751   .0001918    41.58   0.000     .0075992     .008351
       prov_59 |  -.0014751   .0001811    -8.14   0.000      -.00183   -.0011201
     year_2001 |          0  (omitted)
     year_2002 |    -.00404   .0000964   -41.90   0.000     -.004229    -.003851
     year_2003 |  -.0044453   .0000962   -46.22   0.000    -.0046337   -.0042568
     year_2004 |  -.0149696   .0000974  -153.64   0.000    -.0151606   -.0147786
     year_2005 |  -.0166852   .0000982  -169.98   0.000    -.0168776   -.0164928
     year_2006 |   -.014492   .0000985  -147.07   0.000    -.0146852   -.0142989
     year_2007 |   .0021307   .0000993    21.45   0.000      .001936    .0023254
     year_2008 |   .0092226   .0000988    93.34   0.000     .0090289    .0094162
     year_2009 |          0  (omitted)
     year_2010 |  -.0169364   .0000935  -181.14   0.000    -.0171196   -.0167531
     year_2011 |  -.0198116   .0000955  -207.50   0.000    -.0199987   -.0196244
     year_2012 |  -.0298702   .0000971  -307.75   0.000    -.0300604   -.0296799
     year_2013 |  -.0370649   .0000987  -375.67   0.000    -.0372583   -.0368715
     year_2014 |   -.028306   .0000995  -284.50   0.000     -.028501    -.028111
     year_2015 |  -.0263997   .0000998  -264.58   0.000    -.0265952   -.0262041
     year_2016 |  -.0266514   .0001004  -265.42   0.000    -.0268482   -.0264546
     year_2017 |  -.0227829   .0001034  -220.24   0.000    -.0229856   -.0225802
     year_2018 |  -.0115601   .0001181   -97.89   0.000    -.0117915   -.0113286
     year_2019 |  -.0049491   .0001244   -39.79   0.000    -.0051929   -.0047053
         _cons |   .7108057   .0004049  1755.38   0.000     .7100121    .7115994
--------------------------------------------------------------------------------

. 
. global fixed_effects i.year_* "prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46
>  prov_47 prov_48 prov_59"

. 
. global controls provur share_agegrp_*

. 
. reg employed_rate1519 MW_it MW_it_1 provur share_agegrp_1 $controls $fixed_effects [aw
> eight = fweight]
"prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 prov_59 invalid
>  name
r(198);

. 
. global fixed_effects i.year_* i.prov_10 i.prov_11 i.prov_12 i.prov_13 i.prov_24 i.prov
> _35 i.prov_46 i.prov_47 i.prov_48 i.prov_59

. 
. reg employed_rate1519 MW_it MW_it_1 provur share_agegrp_1 $controls $fixed_effects [aw
> eight = fweight]
(sum of wgt is 453,777,829)
note: share_agegrp_1 omitted because of collinearity.
note: provur omitted because of collinearity.
note: share_agegrp_1 omitted because of collinearity.
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: share_agegrp_6 omitted because of collinearity.
note: share_agegrp_7 omitted because of collinearity.
note: share_agegrp_8 omitted because of collinearity.
note: share_agegrp_9 omitted because of collinearity.
note: 0.year_2001 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
       MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
        provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
share_agegrp_1 |          0  (omitted)
        provur |          0  (omitted)
share_agegrp_1 |          0  (omitted)
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
share_agegrp_6 |          0  (omitted)
share_agegrp_7 |          0  (omitted)
share_agegrp_8 |          0  (omitted)
share_agegrp_9 |          0  (omitted)
   0.year_2001 |          0  (omitted)
   1.year_2002 |   .0009092    .000128     7.11   0.000     .0006584      .00116
   1.year_2003 |   .0005039   .0001281     3.93   0.000     .0002527     .000755
   1.year_2004 |  -.0100205   .0001267   -79.08   0.000    -.0102688   -.0097721
   1.year_2005 |  -.0117361   .0001266   -92.72   0.000    -.0119842    -.011488
   1.year_2006 |  -.0095429   .0001239   -77.04   0.000    -.0097857   -.0093001
   1.year_2007 |   .0070799   .0001216    58.21   0.000     .0068415    .0073182
   1.year_2008 |   .0141717   .0001192   118.85   0.000      .013938    .0144054
   1.year_2009 |   .0049491   .0001244    39.79   0.000     .0047053    .0051929
   1.year_2010 |  -.0119872   .0001191  -100.68   0.000    -.0122206   -.0117539
   1.year_2011 |  -.0148624   .0001127  -131.83   0.000    -.0150834   -.0146414
   1.year_2012 |   -.024921   .0001103  -226.01   0.000    -.0251371   -.0247049
   1.year_2013 |  -.0321157   .0001091  -294.28   0.000    -.0323296   -.0319018
   1.year_2014 |  -.0233568   .0001101  -212.17   0.000    -.0235726   -.0231411
   1.year_2015 |  -.0214505   .0001096  -195.79   0.000    -.0216653   -.0212358
   1.year_2016 |  -.0217022   .0001095  -198.12   0.000    -.0219169   -.0214875
   1.year_2017 |  -.0178338   .0001066  -167.33   0.000    -.0180426   -.0176249
   1.year_2018 |  -.0066109   .0001048   -63.09   0.000    -.0068163   -.0064055
   1.year_2019 |          0  (omitted)
     1.prov_10 |   .0014751   .0001811     8.14   0.000     .0011201      .00183
     1.prov_11 |   .1271001   .0002518   504.83   0.000     .1266066    .1275935
     1.prov_12 |   .0196728   .0001136   173.18   0.000     .0194502    .0198955
     1.prov_13 |   .0508551   .0001269   400.62   0.000     .0506063    .0511039
     1.prov_24 |   .0504547   .0000602   837.73   0.000     .0503367    .0505728
     1.prov_35 |   .0036857   .0000512    71.92   0.000     .0035853    .0037862
     1.prov_46 |   .0339328   .0001017   333.56   0.000     .0337335    .0341322
     1.prov_47 |   .0320462   .0001004   319.26   0.000     .0318495    .0322429
     1.prov_48 |   .0094501   .0000777   121.60   0.000     .0092978    .0096025
     1.prov_59 |          0  (omitted)
         _cons |   .7043815   .0004038  1744.29   0.000       .70359     .705173
--------------------------------------------------------------------------------

. 
. global controls provur share_agegrp_*

. 
. global control share_agegrp* "year_2000 year_2001 year_2002 year_2003 year_2004 year_2
> 005 year_2006 year_2007 year_2008 year_2009 prov_10 prov_11 prov_12 prov_13 prov_24 pr
> ov_35 prov_46 prov_47 prov_48 prov_59"

. 
. 
. reg employed_rate1519 MW_it MW_it_1 provur $control [aweight = fweight]
"year_2000 year_2001 year_2002 year_2003 year_2004 year_2005 year_2006 year_2007 year_20
> 08 year_2009 prov_10 prov_11 prov_12 prov_13 prov_24 prov_35 prov_46 prov_47 prov_48 p
> rov_59 not allowed
r(101);

. 
. global control share_agegrp* year_2000 year_2001 year_2002 year_2003 year_2004 year_20
> 05 year_2006 year_2007 year_2008 year_2009 prov_10 prov_11 prov_12 prov_13 prov_24 pro
> v_35 prov_46 prov_47 prov_48 prov_59

. 
. reg employed_rate1519 MW_it MW_it_1 provur share_agegrp_1 $control [aweight = fweight]
variable year_2000 not found
r(111);

. 
. 
. global control share_agegrp* year_2001 year_2002 year_2003 year_2004 year_2005 year_20
> 06 year_2007 year_2008 year_2009 year_2010 year_2011 year_2012 year_2013 year_2014 yea
> r_2015 year_2016 year_2017 year_2018 year_2019 prov_10 prov_11 prov_12 prov_13 prov_24
>  prov_35 prov_46 prov_47 prov_48 prov_59

. 
. 
. reg employed_rate2024 MW_it MW_it_1 provur controls [aweight = fweight]
variable controls not found
r(111);

. 
. reg employed_rate2024 MW_it MW_it_1 provur $control [aweight = fweight]
(sum of wgt is 492,109,357)
note: share_agegrp_1 omitted because of collinearity.
note: share_agegrp_2 omitted because of collinearity.
note: share_agegrp_3 omitted because of collinearity.
note: share_agegrp_4 omitted because of collinearity.
note: share_agegrp_5 omitted because of collinearity.
note: share_agegrp_6 omitted because of collinearity.
note: share_agegrp_7 omitted because of collinearity.
note: share_agegrp_8 omitted because of collinearity.
note: share_agegrp_9 omitted because of collinearity.
note: year_2001 omitted because of collinearity.
note: year_2007 omitted because of collinearity.
note: prov_10 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,625,161
-------------+----------------------------------   F(29, 1625131)  >  99999.00
       Model |  1975.86294        29  68.1332047   Prob > F        =    0.0000
    Residual |  308.458204 1,625,131  .000189805   R-squared       =    0.8650
-------------+----------------------------------   Adj R-squared   =    0.8650
       Total |  2284.32114 1,625,160  .001405598   Root MSE        =    .01378

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |  -.2191733   .0007335  -298.81   0.000    -.2206109   -.2177357
       MW_it_1 |  -.0212506   .0007634   -27.84   0.000    -.0227468   -.0197543
        provur |  -.0090107   .0000112  -806.52   0.000    -.0090326   -.0089888
share_agegrp_1 |          0  (omitted)
share_agegrp_2 |          0  (omitted)
share_agegrp_3 |          0  (omitted)
share_agegrp_4 |          0  (omitted)
share_agegrp_5 |          0  (omitted)
share_agegrp_6 |          0  (omitted)
share_agegrp_7 |          0  (omitted)
share_agegrp_8 |          0  (omitted)
share_agegrp_9 |          0  (omitted)
     year_2001 |          0  (omitted)
     year_2002 |  -.0126019   .0000685  -184.02   0.000    -.0127361   -.0124676
     year_2003 |  -.0081114   .0000679  -119.49   0.000    -.0082444   -.0079783
     year_2004 |  -.0141988   .0000669  -212.38   0.000    -.0143298   -.0140678
     year_2005 |  -.0152327   .0000664  -229.55   0.000    -.0153628   -.0151026
     year_2006 |  -.0059694   .0000662   -90.16   0.000    -.0060992   -.0058397
     year_2007 |          0  (omitted)
     year_2008 |  -.0042555   .0000663   -64.15   0.000    -.0043855   -.0041255
     year_2009 |  -.0181211   .0000696  -260.50   0.000    -.0182574   -.0179847
     year_2010 |  -.0195323   .0000694  -281.34   0.000    -.0196684   -.0193962
     year_2011 |  -.0197423   .0000682  -289.39   0.000     -.019876   -.0196086
     year_2012 |  -.0215217   .0000681  -316.21   0.000    -.0216551   -.0213883
     year_2013 |  -.0197023   .0000679  -290.19   0.000    -.0198354   -.0195692
     year_2014 |  -.0158655   .0000675  -235.08   0.000    -.0159978   -.0157333
     year_2015 |  -.0203031   .0000677  -300.01   0.000    -.0204358   -.0201705
     year_2016 |  -.0150513   .0000683  -220.51   0.000    -.0151851   -.0149175
     year_2017 |   -.009658    .000069  -140.02   0.000    -.0097932   -.0095228
     year_2018 |  -.0098243   .0000792  -124.09   0.000    -.0099795   -.0096691
     year_2019 |   .0004204   .0000829     5.07   0.000      .000258    .0005828
       prov_10 |          0  (omitted)
       prov_11 |    .100297   .0001986   505.11   0.000     .0999078    .1006862
       prov_12 |    .052303   .0001307   400.27   0.000     .0520469    .0525591
       prov_13 |   .0485916   .0001332   364.82   0.000     .0483305    .0488527
       prov_24 |   .0954796   .0001165   819.75   0.000     .0952514    .0957079
       prov_35 |   .0455517   .0001205   378.06   0.000     .0453155    .0457878
       prov_46 |    .099213   .0001463   678.21   0.000     .0989263    .0994997
       prov_47 |   .0831385   .0001432   580.74   0.000     .0828579    .0834191
       prov_48 |   .0928141    .000132   703.10   0.000     .0925554    .0930728
       prov_59 |   .0646166   .0001252   516.02   0.000     .0643712     .064862
         _cons |   .7890152   .0002632  2998.34   0.000     .7884994     .789531
--------------------------------------------------------------------------------

. 
. global controls provur share_agegrp_*

. global fixed_effects i.year_* i.prov_10 i.prov_11 i.prov_12 i.prov_13 i.prov_24 i.prov
> _35 i.prov_46 i.prov_47 i.prov_48 i.prov_59

. 
. reg employed_rate1519 MW_it MW_it_1 provur $fixed_effects [aweight = fweight]
(sum of wgt is 453,777,829)
note: 0.year_2001 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,746,786
-------------+----------------------------------   F(29, 1746756)  >  99999.00
       Model |  2374.51177        29  81.8797162   Prob > F        =    0.0000
    Residual |  766.056496 1,746,756   .00043856   R-squared       =    0.7561
-------------+----------------------------------   Adj R-squared   =    0.7561
       Total |  3140.56827 1,746,785  .001797913   Root MSE        =    .02094

------------------------------------------------------------------------------
employe~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       MW_it |  -.2169072   .0010871  -199.52   0.000     -.219038   -.2147765
     MW_it_1 |  -.2366639   .0011301  -209.42   0.000    -.2388789    -.234449
      provur |  -.0148424   .0000164  -907.04   0.000    -.0148745   -.0148104
 0.year_2001 |          0  (omitted)
 1.year_2002 |   .0009092    .000128     7.11   0.000     .0006584      .00116
 1.year_2003 |   .0005039   .0001281     3.93   0.000     .0002527     .000755
 1.year_2004 |  -.0100205   .0001267   -79.08   0.000    -.0102688   -.0097721
 1.year_2005 |  -.0117361   .0001266   -92.72   0.000    -.0119842    -.011488
 1.year_2006 |  -.0095429   .0001239   -77.04   0.000    -.0097857   -.0093001
 1.year_2007 |   .0070799   .0001216    58.21   0.000     .0068415    .0073182
 1.year_2008 |   .0141717   .0001192   118.85   0.000      .013938    .0144054
 1.year_2009 |   .0049491   .0001244    39.79   0.000     .0047053    .0051929
 1.year_2010 |  -.0119872   .0001191  -100.68   0.000    -.0122206   -.0117539
 1.year_2011 |  -.0148624   .0001127  -131.83   0.000    -.0150834   -.0146414
 1.year_2012 |   -.024921   .0001103  -226.01   0.000    -.0251371   -.0247049
 1.year_2013 |  -.0321157   .0001091  -294.28   0.000    -.0323296   -.0319018
 1.year_2014 |  -.0233568   .0001101  -212.17   0.000    -.0235726   -.0231411
 1.year_2015 |  -.0214505   .0001096  -195.79   0.000    -.0216653   -.0212358
 1.year_2016 |  -.0217022   .0001095  -198.12   0.000    -.0219169   -.0214875
 1.year_2017 |  -.0178338   .0001066  -167.33   0.000    -.0180426   -.0176249
 1.year_2018 |  -.0066109   .0001048   -63.09   0.000    -.0068163   -.0064055
 1.year_2019 |          0  (omitted)
   1.prov_10 |   .0014751   .0001811     8.14   0.000     .0011201      .00183
   1.prov_11 |   .1271001   .0002518   504.83   0.000     .1266066    .1275935
   1.prov_12 |   .0196728   .0001136   173.18   0.000     .0194502    .0198955
   1.prov_13 |   .0508551   .0001269   400.62   0.000     .0506063    .0511039
   1.prov_24 |   .0504547   .0000602   837.73   0.000     .0503367    .0505728
   1.prov_35 |   .0036857   .0000512    71.92   0.000     .0035853    .0037862
   1.prov_46 |   .0339328   .0001017   333.56   0.000     .0337335    .0341322
   1.prov_47 |   .0320462   .0001004   319.26   0.000     .0318495    .0322429
   1.prov_48 |   .0094501   .0000777   121.60   0.000     .0092978    .0096025
   1.prov_59 |          0  (omitted)
       _cons |   .7043815   .0004038  1744.29   0.000       .70359     .705173
------------------------------------------------------------------------------

. 
. reg employed_rate MW_it MW_it_1 i.prov_* i.year_* treated10_2011 [aweight=fweight]
variable treated10_2011 not found
r(111);

. gen treated10_2011 = (prov == 10) * (survyear >= 2011)

. 
. reg employed_rate MW_it MW_it_1 i.prov_* i.year_* treated10_2011 [aweight=fweight]
(sum of wgt is 4,542,787,268)
note: 1.prov_59 omitted because of collinearity.
note: 0.year_2001 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  16402522
-------------+----------------------------------   F(29, 16402492) =  23442.14
       Model |  9568.04726        29  329.932664   Prob > F        =    0.0000
    Residual |  230854.225  16402492  .014074339   R-squared       =    0.0398
-------------+----------------------------------   Adj R-squared   =    0.0398
       Total |  240422.272  16402521  .014657641   Root MSE        =    .11864

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
         MW_it |   -.231652   .0019724  -117.45   0.000    -.2355178   -.2277862
       MW_it_1 |  -.0527743   .0020821   -25.35   0.000    -.0568552   -.0486934
     1.prov_10 |  -.1350794    .000342  -395.00   0.000    -.1357497   -.1344092
     1.prov_11 |   .0120645   .0004745    25.43   0.000     .0111345    .0129945
     1.prov_12 |  -.0191421   .0002055   -93.16   0.000    -.0195448   -.0187394
     1.prov_13 |  -.0180536   .0002251   -80.19   0.000    -.0184949   -.0176124
     1.prov_24 |   .0103966    .000105    99.02   0.000     .0101908    .0106023
     1.prov_35 |   .0006191   .0000944     6.56   0.000      .000434    .0008041
     1.prov_46 |   .0374022   .0001885   198.40   0.000     .0370327    .0377717
     1.prov_47 |   .0370889   .0001904   194.77   0.000     .0367157    .0374621
     1.prov_48 |   .0218766   .0001414   154.70   0.000     .0215994    .0221538
     1.prov_59 |          0  (omitted)
   0.year_2001 |          0  (omitted)
   1.year_2002 |  -.0580568   .0002203  -263.54   0.000    -.0584886    -.057625
   1.year_2003 |  -.0521206   .0002218  -234.94   0.000    -.0525554   -.0516858
   1.year_2004 |  -.0521999   .0002226  -234.51   0.000    -.0526362   -.0517636
   1.year_2005 |  -.0497365   .0002245  -221.52   0.000    -.0501766   -.0492964
   1.year_2006 |  -.0428197    .000222  -192.86   0.000    -.0432549   -.0423846
   1.year_2007 |  -.0337207   .0002195  -153.66   0.000    -.0341508   -.0332905
   1.year_2008 |  -.0321895   .0002152  -149.56   0.000    -.0326113   -.0317677
   1.year_2009 |  -.0530306   .0002061  -257.28   0.000    -.0534346   -.0526266
   1.year_2010 |  -.0501505   .0001998  -251.04   0.000     -.050542   -.0497589
   1.year_2011 |  -.0438724   .0001943  -225.77   0.000    -.0442533   -.0434916
   1.year_2012 |  -.0388414   .0001912  -203.10   0.000    -.0392163   -.0384666
   1.year_2013 |  -.0384167   .0001898  -202.36   0.000    -.0387888   -.0380446
   1.year_2014 |  -.0378628   .0001911  -198.08   0.000    -.0382374   -.0374882
   1.year_2015 |  -.0334914     .00019  -176.27   0.000    -.0338638    -.033119
   1.year_2016 |  -.0331965   .0001882  -176.39   0.000    -.0335654   -.0328277
   1.year_2017 |  -.0219116   .0001859  -117.88   0.000     -.022276   -.0215473
   1.year_2018 |  -.0084619   .0001853   -45.68   0.000     -.008825   -.0080988
   1.year_2019 |          0  (omitted)
treated10_2011 |   .0541771   .0004799   112.88   0.000     .0532364    .0551177
         _cons |   .8946672   .0007412  1207.10   0.000     .8932145    .8961199
--------------------------------------------------------------------------------

. preserve

. collapse (mean) employed, by(prov survyear age_12)

. 
. predict employed, xb
variable employed already defined
r(110);

. 
. predict adjusted_means, xb
variable MW_it not found
variable MW_it_1 not found
variable treated10_2011 not found
variable MW_it not found
r(111);

. 
. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) ///
/ / / is not a twoway plot type
r(198);

.        (line adjusted_means survyear if prov == 35&age_12 == 1, lc(red)) ///
( is not a valid command name
r(199);

.        (line adjusted_means survyear if prov == 48&age_12 == 1, lc(green)) ///
( is not a valid command name
r(199);

.        (line adjusted_means survyear if prov == 59&age_12 == 1, lc(orange)), ///
( is not a valid command name
r(199);

.        legend(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Co
> lumbia")) ///
command legend is unrecognized
r(199);

.        title("DiD Plot for Selected Provinces 2001-2019") ///
command title is unrecognized
r(199);

.        xtitle("Year") ///
command xtitle is unrecognized
r(199);

.        ytitle("Adjusted Employment-Population Ratio") ///
command ytitle is unrecognized
r(199);

.        xlabel(2001(1)2019) ///
command xlabel is unrecognized
r(199);

.        ylabel(, grid)
command ylabel is unrecognized
r(199);

. collapse (mean) employed, by(prov survyear age_12)

. twoway (scatter employed survyear if prov == 10&age_12 == 1, lc(blue)) (scatter adjust
> ed_means survyear if prov == 35&age_12 == 1, lc(red)) (scatter adjusted_means survyear
>  if prov == 48&age_12 == 1, lc(green)) (scatter adjusted_means survyear if prov == 59&
> age_12 == 1, lc(orange)),legend(label(1 "New") label(2 "Ontario") label(3 "Alberta") l
> abel(4 "British Columbia")) title("DiD Plot for Selected Provinces 2001-2019") xtitle(
> "Year") ytitle("Adjusted Employment-Population Ratio") xlabel(2001(1)2019) ylabel(, gr
> id)
variable adjusted_means not found
r(111);

. collapse (mean) employed, by(prov survyear age_12)

. twoway (scatter employed survyear if prov == 10&age_12 == 1, lc(blue)) (scatter employ
> ed survyear if prov == 35&age_12 == 1, lc(red)) (scatter employed survyear if prov == 
> 48&age_12 == 1, lc(green)) (scatter employed survyear if prov == 59&age_12 == 1, lc(or
> ange)),legend(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Co
> lumbia")) title("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Ad
> justed Employment-Population Ratio") xlabel(2001(1)2019) ylabel(, grid)

. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia")) ti
> tle("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Emplo
> yment-Population Ratio") xlabel(2001(1)2019) ylabel(, grid)

. graph use "/Users/cherylz/Downloads/graphM2.gph"

. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia")) ti
> tle("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Emplo
> yment-Population Ratio") xlabel(2001(1)2019) ylabel(, grid) xsc(outergap(*20))

. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia")) ti
> tle("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Emplo
> yment-Population Ratio") xlabel(2007(1)2017) ylabel(, grid) 

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. keep if survyear >=2007 & survyear <= 2017
(720 observations deleted)

. 
end of do-file

. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia")) ti
> tle("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Emplo
> yment-Population Ratio") xlabel(2007(1)2017) ylabel(, grid) 

. twoway (line employed survyear if prov == 10, lc(blue)) (line employed survyear if pro
> v == 35, lc(red)) (line employed survyear if prov == 48, lc(green)) (line employed sur
> vyear if prov == 59, lc(orange)),legend(label(1 "New") label(2 "Ontario") label(3 "Alb
> erta") label(4 "British Columbia")) title("DiD Plot for Selected Provinces 2001-2019")
>  xtitle("Year") ytitle("Adjusted Employment-Population Ratio") xlabel(2007(1)2017) yla
> bel(, grid) 

. twoway (line employed survyear if prov == 10&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "New") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia")) ti
> tle("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Emplo
> yment-Population Ratio") xlabel(2007(1)2017) ylabel(, grid) 

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treated24_2011 = (prov == 24) * (survyear >= 2011)

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Em
> ployment-Population Ratio") xlabel(2007(1)2017) ylabel(, grid) 

. 
end of do-file

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces 2001-2019") xtitle("Year") ytitle("Adjusted Em
> ployment-Population Ratio") xlabel(2007(1)2017) ylabel(, grid) 

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces 2007-2017") xtitle("Year") ytitle("Employment-
> Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) 

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) 

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) 

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 25-29") xlabel(2007(1)2017) ylabel(, grid) 

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid), n
> ame(g1)
name(g1) is not a twoway plot type
r(198);

end of do-file

r(198);

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) by
> (age_12)

. 
. keep if age_12 >= 1 & age_12 <= 3
(660 observations deleted)

. 
. twoway (line employed survyear if prov == 24, lc(blue)) (line employed survyear if pro
> v == 35, lc(red)) (line employed survyear if prov == 48, lc(green)) (line employed sur
> vyear if prov == 59, lc(orange)),legend(label(1 "Quebec") label(2 "Ontario") label(3 "
> Alberta") label(4 "British Columbia")) title("DiD Plot for Selected Provinces in Canad
> a 2007-2017") xtitle("Year") ytitle("Employment-Population Ratio for age group 15-19")
>  xlabel(2007(1)2017) ylabel(, grid) by(age_12)

. 
. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) na
> me(g1) 

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 20-24") xlabel(2007(1)2017) ylabel(, grid) na
> me(g2)

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 25-29") xlabel(2007(1)2017) ylabel(, grid) na
> me(g3)

. 
end of do-file

. graph combine g1 g2 g3

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017",size(small)) xtitle("Year
> ") ytitle("Employment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabe
> l(, grid,size(small)) name(g1) 
graph g1 already exists
r(110);

. 
. drop g1
variable g1 not found
r(111);

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017",size(small)) xtitle("Year
> ") ytitle("Employment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabe
> l(, grid,size(small)) name(g) 
invalid 'size' 
r(198);

. 
. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017"), xtitle("Year") ytitle("
> Employment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid,si
> ze(small)) name(g) 
) required
r(100);

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017"), xtitle("Year") ytitle("
> Employment-Population Ratio for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) n
> ame(g1) 
) required
r(100);

end of do-file

r(100);

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 20-24") xlabel(2007(1)2017) ylabel(, grid,siz
> e(small)) name(g2)
graph g2 already exists
r(110);

. 
. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mployment-Population Ratio for age group 20-24") xlabel(2007(1)2017) ylabel(, grid,siz
> e(small)) name(g)
invalid 'size' 
r(198);

. 
. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  title("DiD Plot for Selected Provinces in Canada 2007-2017") xtitle("Year") ytitle("E
> mpl/Pop for age group 15-19") xlabel(2007(1)2017) ylabel(, grid) name(g)

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 15-19") xlabel(2007(1)2017) ylabel(, gr
> id) name(gr1)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 20-24") xlabel(2007(1)2017) ylabel(, gr
> id) name(gr2)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 25-29") xlabel(2007(1)2017) ylabel(, gr
> id) name(gr3)

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. graph combine gr1 gr2 gr3

. 
end of do-file

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 15-19") xlabel(, labsize(small)) ylabel
> (, grid)

. 
. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 15-19") xlabel(1 2 3 4, valuelabel) yla
> bel(, grid)

. 
. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, val
> uelabel) ylabel(, grid)

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, val
> uelabel) ylabel(, grid) name(ga1)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, val
> uelabel) ylabel(, grid) name(ga2)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xtitle("Year") ytitle("Empl/Pop for age group 25-29") xlabel(2009 2012 2011 2015, val
> uelabel) ylabel(, grid) name(ga3)

. 
. graph combine ga1 ga2 ga3

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(off) xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(gf1)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(gf2)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(off) xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(gf3)

. 
. graph combine gf1 gf2 gf3

. 
end of do-file

. net install grc1leg,from( http://www.stata.com/users/vwiggins/)
checking grc1leg consistency and verifying not already installed...
installing into /Users/cherylz/Library/Application Support/Stata/ado/plus/...
installation complete.

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(gra1)

. 
end of do-file

. grc1leg gra1 gf2 gf3, legendfrom(gra1)

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(g2, replace)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(off) xlabel(2009 2012 2011 2015, valuelabel) ylabel(, grid) name(g3, replace)

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) position(4)

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4)

. 
end of do-file

. grc1leg gra1 gf2 gf3, row(2) legendfrom(gra1) ring(0) position(4)

. 
. grc1leg gra1 gf2 gf3, row(2) legendfrom(gra1) ring(0) position(4)

. gr_edit legend.xoffset = 35

. gr_edit legend.yoffset = 35

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4)

. gr_edit legend.xoffset = 10

. gr_edit legend.yoffset = 10

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4)

. gr_edit legend.xoffset = 5

. gr_edit legend.yoffset = 10

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Set directory 
. cd "/Users/cherylz/Desktop/ECO339/339THA"
/Users/cherylz/Desktop/ECO339/339THA

. * Open a log, save as .txt
. log using "339log" , text replace
log file already open
r(604);

end of do-file

r(604);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4)

. gr_edit legend.xoffset = -15

. gr_edit legend.yoffset = 15

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4) title("DiD Plot for Selecte
> d Provinces in Canada 2007-2017")

. gr_edit legend.xoffset = -15

. gr_edit legend.yoffset = 15

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, valuelabel) ylabel
> (, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g2, replace)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 25-29") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g3, replace)

. * Install package grc1leg to create combined graphs with one shared legend 
. * net install grc1leg,from( http://www.stata.com/users/vwiggins/)
. grc1leg gra1 gf2 gf3, legendfrom(gra1) ring(0) position(4) title("DiD Plot for Selecte
> d Provinces in Canada 2007-2017")

. gr_edit legend.xoffset = -15

. gr_edit legend.yoffset = 15

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, valuelabel) ylabel
> (, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g2, replace)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 25-29") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g3, replace)

. * Install package grc1leg to create combined graphs with one shared legend 
. * net install grc1leg,from( http://www.stata.com/users/vwiggins/)
. grc1leg g1 gf2 gf3, legendfrom(gra1) ring(0) position(4) title("DiD Plot for Selected 
> Provinces in Canada 2007-2017")
 not found in graph name list
r(198);

end of do-file

r(198);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, valuelabel) ylabel
> (, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g2, replace)

. twoway (line employed survyear if prov == 24&age_12 == 3, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 3, lc(red)) (line employed survyear if prov == 48&age_12
>  == 3, lc(green)) (line employed survyear if prov == 59&age_12 == 3, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 25-29") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g3, replace)

. * Install package grc1leg to create combined graphs with one shared legend 
. * net install grc1leg,from( http://www.stata.com/users/vwiggins/)
. grc1leg g1 g2 g3, legendfrom(g1) ring(0) position(4) title("DiD Plot for Selected Prov
> inces in Canada 2007-2017")

. gr_edit legend.xoffset = -15

. gr_edit legend.yoffset = 15

. 
end of do-file

. graph export "/Users/cherylz/Desktop/ECO339/339THA/DID Plots.pdf", as(pdf) name("Graph
> ")
file /Users/cherylz/Desktop/ECO339/339THA/DID Plots.pdf saved as PDF format

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate  treated10_2011 i.prov_* i.year_* treated10_2011 [aweight=fweight]
fweight not found
r(111);

end of do-file

r(111);

. preserve
already preserved
r(621);

. restore

. reg employed_rate  treated10_2011 i.prov_* i.year_* treated10_2011 [aweight=fweight]
(sum of wgt is 4,777,232,545)
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.
note: treated10_2011 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =  17375851
-------------+----------------------------------   F(28, 17375822) =  25614.95
       Model |  10158.7563        28  362.812725   Prob > F        =    0.0000
    Residual |  246112.934  17375822  .014164103   R-squared       =    0.0396
-------------+----------------------------------   Adj R-squared   =    0.0396
       Total |   256271.69  17375850  .014748728   Root MSE        =    .11901

--------------------------------------------------------------------------------
 employed_rate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
treated10_2011 |   .0610396   .0004662   130.92   0.000     .0601258    .0619534
     1.prov_10 |  -.1413197   .0003234  -436.97   0.000    -.1419535   -.1406858
     1.prov_11 |  -.0050101   .0004528   -11.06   0.000    -.0058976   -.0041225
     1.prov_12 |   -.031179   .0001909  -163.37   0.000     -.031553   -.0308049
     1.prov_13 |  -.0304707   .0002101  -145.05   0.000    -.0308825    -.030059
     1.prov_24 |    .004258   .0000987    43.12   0.000     .0040645    .0044516
     1.prov_35 |  -.0000303   .0000912    -0.33   0.740     -.000209    .0001485
     1.prov_46 |    .028088   .0001737   161.71   0.000     .0277476    .0284285
     1.prov_47 |    .038665   .0001854   208.60   0.000     .0383017    .0390283
     1.prov_48 |    .036803   .0001156   318.49   0.000     .0365765    .0370295
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0375116   .0001774  -211.45   0.000    -.0378593   -.0371639
   1.year_2002 |  -.0328772   .0001769  -185.90   0.000    -.0332238   -.0325305
   1.year_2003 |  -.0269109   .0001764  -152.53   0.000    -.0272567   -.0265651
   1.year_2004 |  -.0263101    .000176  -149.50   0.000    -.0266551   -.0259652
   1.year_2005 |  -.0232713   .0001755  -132.58   0.000    -.0236153   -.0229273
   1.year_2006 |  -.0177651   .0001751  -101.46   0.000    -.0181083    -.017422
   1.year_2007 |  -.0085898   .0001747   -49.16   0.000    -.0089323   -.0082473
   1.year_2008 |  -.0096774   .0001744   -55.50   0.000    -.0100192   -.0093357
   1.year_2009 |  -.0327984    .000174  -188.52   0.000    -.0331394   -.0324574
   1.year_2010 |  -.0323024   .0001738  -185.81   0.000    -.0326431   -.0319616
   1.year_2011 |  -.0276221   .0001735  -159.22   0.000    -.0279621    -.027282
   1.year_2012 |  -.0237266   .0001732  -136.99   0.000    -.0240661   -.0233872
   1.year_2013 |   -.023556    .000173  -136.19   0.000     -.023895    -.023217
   1.year_2014 |  -.0222026   .0001728  -128.48   0.000    -.0225413   -.0218639
   1.year_2015 |  -.0189023   .0001727  -109.42   0.000    -.0192409   -.0185637
   1.year_2016 |   -.018978   .0001727  -109.91   0.000    -.0193164   -.0186396
   1.year_2017 |   -.009345   .0001726   -54.14   0.000    -.0096833   -.0090067
   1.year_2018 |   -.004804   .0001724   -27.87   0.000    -.0051419   -.0044662
   1.year_2019 |          0  (omitted)
treated10_2011 |          0  (omitted)
         _cons |   .7609187   .0001423  5349.04   0.000     .7606399    .7611975
--------------------------------------------------------------------------------

. 
. gen treat if prov == 24 & prov == 35 & prov == 48 & prov == 59
=exp required
r(100);

. 
. gen treat = (prov == 24 | prov == 35 | prov == 48 | prov == 59)

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen post2011 = (survyear >= 2011)

. gen post2009 = (survyear >= 2009)

. gen post2016 = (survyear >= 2016)

. gen post2012 = (survyear >= 2012)

. 
end of do-file

. gen treated24_2011 = treat * post2011

. gen treated35_2009 = treat * post2011

. gen treated48_2015 = treat * post2011

. gen treated59_2012 = treat * post2011

. reg employed_rate1519 treated24_2011 i.prov_* i.year_* [aweight=fweight]
(sum of wgt is 478,553,506)
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
treated24_2011 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1063234   .0001946  -546.33   0.000    -.1067048   -.1059419
     1.prov_11 |   .0470805   .0003317   141.92   0.000     .0464303    .0477307
     1.prov_12 |  -.0195439   .0001546  -126.45   0.000    -.0198468   -.0192409
     1.prov_13 |   .0023459    .000169    13.88   0.000     .0020147    .0026772
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   .0467708     .00014   334.16   0.000     .0464965    .0470452
     1.prov_47 |   .0577439   .0001464   394.48   0.000      .057457    .0580308
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0173415   .0001737    99.86   0.000     .0170011    .0176818
   1.year_2002 |   .0294809   .0001736   169.82   0.000     .0291407    .0298212
   1.year_2003 |   .0323285   .0001736   186.21   0.000     .0319882    .0326687
   1.year_2004 |   .0284576   .0001735   164.03   0.000     .0281176    .0287977
   1.year_2005 |    .031901   .0001732   184.19   0.000     .0315616    .0322405
   1.year_2006 |   .0368286   .0001729   213.00   0.000     .0364897    .0371675
   1.year_2007 |   .0555723   .0001727   321.81   0.000     .0552338    .0559108
   1.year_2008 |   .0595259   .0001726   344.98   0.000     .0591877    .0598641
   1.year_2009 |   .0159856   .0001727    92.59   0.000     .0156472     .016324
   1.year_2010 |  -.0014201   .0001728    -8.22   0.000    -.0017587   -.0010815
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .4106599   .0001618  2538.68   0.000     .4103429     .410977
--------------------------------------------------------------------------------

. 
. replace treat = 0 if treat == .
(0 real changes made)

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate1519 treated35_2009 i.prov_* i.year_* [aweight=fweight]
(sum of wgt is 478,553,506)
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
treated35_2009 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1063234   .0001946  -546.33   0.000    -.1067048   -.1059419
     1.prov_11 |   .0470805   .0003317   141.92   0.000     .0464303    .0477307
     1.prov_12 |  -.0195439   .0001546  -126.45   0.000    -.0198468   -.0192409
     1.prov_13 |   .0023459    .000169    13.88   0.000     .0020147    .0026772
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   .0467708     .00014   334.16   0.000     .0464965    .0470452
     1.prov_47 |   .0577439   .0001464   394.48   0.000      .057457    .0580308
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0173415   .0001737    99.86   0.000     .0170011    .0176818
   1.year_2002 |   .0294809   .0001736   169.82   0.000     .0291407    .0298212
   1.year_2003 |   .0323285   .0001736   186.21   0.000     .0319882    .0326687
   1.year_2004 |   .0284576   .0001735   164.03   0.000     .0281176    .0287977
   1.year_2005 |    .031901   .0001732   184.19   0.000     .0315616    .0322405
   1.year_2006 |   .0368286   .0001729   213.00   0.000     .0364897    .0371675
   1.year_2007 |   .0555723   .0001727   321.81   0.000     .0552338    .0559108
   1.year_2008 |   .0595259   .0001726   344.98   0.000     .0591877    .0598641
   1.year_2009 |   .0159856   .0001727    92.59   0.000     .0156472     .016324
   1.year_2010 |  -.0014201   .0001728    -8.22   0.000    -.0017587   -.0010815
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .4106599   .0001618  2538.68   0.000     .4103429     .410977
--------------------------------------------------------------------------------

. reg employed_rate1519 treated48_2015 i.prov_* i.year_* [aweight=fweight]
(sum of wgt is 478,553,506)
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
treated48_2015 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1063234   .0001946  -546.33   0.000    -.1067048   -.1059419
     1.prov_11 |   .0470805   .0003317   141.92   0.000     .0464303    .0477307
     1.prov_12 |  -.0195439   .0001546  -126.45   0.000    -.0198468   -.0192409
     1.prov_13 |   .0023459    .000169    13.88   0.000     .0020147    .0026772
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   .0467708     .00014   334.16   0.000     .0464965    .0470452
     1.prov_47 |   .0577439   .0001464   394.48   0.000      .057457    .0580308
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0173415   .0001737    99.86   0.000     .0170011    .0176818
   1.year_2002 |   .0294809   .0001736   169.82   0.000     .0291407    .0298212
   1.year_2003 |   .0323285   .0001736   186.21   0.000     .0319882    .0326687
   1.year_2004 |   .0284576   .0001735   164.03   0.000     .0281176    .0287977
   1.year_2005 |    .031901   .0001732   184.19   0.000     .0315616    .0322405
   1.year_2006 |   .0368286   .0001729   213.00   0.000     .0364897    .0371675
   1.year_2007 |   .0555723   .0001727   321.81   0.000     .0552338    .0559108
   1.year_2008 |   .0595259   .0001726   344.98   0.000     .0591877    .0598641
   1.year_2009 |   .0159856   .0001727    92.59   0.000     .0156472     .016324
   1.year_2010 |  -.0014201   .0001728    -8.22   0.000    -.0017587   -.0010815
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .4106599   .0001618  2538.68   0.000     .4103429     .410977
--------------------------------------------------------------------------------

. reg employed_rate1519 treated59_2012 i.prov_* i.year_* [aweight=fweight]
(sum of wgt is 478,553,506)
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
treated59_2012 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1063234   .0001946  -546.33   0.000    -.1067048   -.1059419
     1.prov_11 |   .0470805   .0003317   141.92   0.000     .0464303    .0477307
     1.prov_12 |  -.0195439   .0001546  -126.45   0.000    -.0198468   -.0192409
     1.prov_13 |   .0023459    .000169    13.88   0.000     .0020147    .0026772
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   .0467708     .00014   334.16   0.000     .0464965    .0470452
     1.prov_47 |   .0577439   .0001464   394.48   0.000      .057457    .0580308
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0173415   .0001737    99.86   0.000     .0170011    .0176818
   1.year_2002 |   .0294809   .0001736   169.82   0.000     .0291407    .0298212
   1.year_2003 |   .0323285   .0001736   186.21   0.000     .0319882    .0326687
   1.year_2004 |   .0284576   .0001735   164.03   0.000     .0281176    .0287977
   1.year_2005 |    .031901   .0001732   184.19   0.000     .0315616    .0322405
   1.year_2006 |   .0368286   .0001729   213.00   0.000     .0364897    .0371675
   1.year_2007 |   .0555723   .0001727   321.81   0.000     .0552338    .0559108
   1.year_2008 |   .0595259   .0001726   344.98   0.000     .0591877    .0598641
   1.year_2009 |   .0159856   .0001727    92.59   0.000     .0156472     .016324
   1.year_2010 |  -.0014201   .0001728    -8.22   0.000    -.0017587   -.0010815
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .4106599   .0001618  2538.68   0.000     .4103429     .410977
--------------------------------------------------------------------------------

. 
end of do-file

. reg employed_rate1519 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0014201   .0001728     8.22   0.000     .0010815    .0017587
         treat |  -.0577439   .0001464  -394.48   0.000    -.0580308    -.057457
treated24_2011 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1640672   .0002144  -765.36   0.000    -.1644874   -.1636471
     1.prov_11 |  -.0106634   .0003432   -31.07   0.000     -.011336   -.0099907
     1.prov_12 |  -.0772877   .0001782  -433.75   0.000     -.077637   -.0769385
     1.prov_13 |  -.0553979   .0001908  -290.33   0.000    -.0557719    -.055024
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   -.010973   .0001642   -66.81   0.000    -.0112949   -.0106511
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0187615   .0001326   141.51   0.000     .0185017    .0190214
   1.year_2002 |    .030901   .0001324   233.36   0.000     .0306415    .0311605
   1.year_2003 |   .0337485   .0001323   255.01   0.000     .0334891    .0340079
   1.year_2004 |   .0298777   .0001321   226.17   0.000     .0296188    .0301366
   1.year_2005 |   .0333211   .0001316   253.15   0.000     .0330631    .0335791
   1.year_2006 |   .0382486   .0001311   291.69   0.000     .0379916    .0385056
   1.year_2007 |   .0569924   .0001308   435.88   0.000     .0567361    .0572486
   1.year_2008 |   .0609459   .0001305   467.04   0.000     .0606902    .0612017
   1.year_2009 |   .0174057   .0001306   133.30   0.000     .0171497    .0176616
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .4669837   .0001584  2947.91   0.000     .4666732    .4672942
--------------------------------------------------------------------------------

. reg employed_rate2024 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |  1868.41785        28  66.7292088   Prob > F        =    0.0000
    Residual |  557.892893 1,718,009  .000324732   R-squared       =    0.7701
-------------+----------------------------------   Adj R-squared   =    0.7701
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01802

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0260287     .00011   236.60   0.000     .0258131    .0262443
         treat |  -.0296393   .0000957  -309.80   0.000    -.0298268   -.0294517
treated24_2011 |  -.0003471   .0000816    -4.25   0.000     -.000507   -.0001871
     1.prov_10 |  -.1623606   .0001404 -1156.58   0.000    -.1626357   -.1620855
     1.prov_11 |  -.0439087    .000228  -192.58   0.000    -.0443556   -.0434618
     1.prov_12 |   -.068385   .0001151  -593.97   0.000    -.0686106   -.0681593
     1.prov_13 |  -.0777224   .0001247  -623.45   0.000    -.0779668   -.0774781
     1.prov_24 |   .0158428   .0000478   331.12   0.000      .015749    .0159365
     1.prov_35 |  -.0224216   .0000438  -512.07   0.000    -.0225075   -.0223358
     1.prov_46 |   .0085719    .000107    80.14   0.000     .0083622    .0087815
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0491358   .0000552   890.13   0.000     .0490276     .049244
     1.prov_59 |          0  (omitted)
   1.year_2001 |    .013629    .000087   156.64   0.000     .0134585    .0137996
   1.year_2002 |   .0186276   .0000867   214.89   0.000     .0184577    .0187975
   1.year_2003 |   .0239363   .0000863   277.23   0.000     .0237671    .0241055
   1.year_2004 |   .0224448    .000086   260.97   0.000     .0222762    .0226133
   1.year_2005 |   .0244163   .0000857   284.80   0.000     .0242483    .0245844
   1.year_2006 |   .0347007   .0000855   405.70   0.000      .034533    .0348683
   1.year_2007 |   .0431018   .0000853   505.02   0.000     .0429345     .043269
   1.year_2008 |   .0356433   .0000852   418.44   0.000     .0354763    .0358102
   1.year_2009 |   .0014896   .0000849    17.54   0.000     .0013231     .001656
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0213115   .0000836  -254.97   0.000    -.0214753   -.0211476
   1.year_2012 |  -.0217993   .0000831  -262.27   0.000    -.0219622   -.0216364
   1.year_2013 |  -.0184455   .0000827  -222.92   0.000    -.0186076   -.0182833
   1.year_2014 |  -.0130524   .0000826  -158.07   0.000    -.0132143   -.0128906
   1.year_2015 |  -.0184701   .0000826  -223.67   0.000    -.0186319   -.0183082
   1.year_2016 |  -.0145078   .0000827  -175.47   0.000    -.0146698   -.0143457
   1.year_2017 |  -.0061821   .0000828   -74.66   0.000    -.0063444   -.0060198
   1.year_2018 |  -.0096255   .0000828  -116.22   0.000    -.0097878   -.0094632
   1.year_2019 |          0  (omitted)
         _cons |   .7052323   .0001036  6806.12   0.000     .7050292    .7054354
--------------------------------------------------------------------------------

. reg employed_rate2529 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  =  97599.46
       Model |   627.81352        28  22.4219114   Prob > F        =    0.0000
    Residual |  386.750018 1,683,469  .000229734   R-squared       =    0.6188
-------------+----------------------------------   Adj R-squared   =    0.6188
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01516

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |    .025032   .0000932   268.55   0.000     .0248493    .0252147
         treat |  -.0238447   .0000833  -286.30   0.000    -.0240079   -.0236814
treated24_2011 |   .0013552   .0000706    19.19   0.000     .0012168    .0014936
     1.prov_10 |  -.1264895   .0001216 -1039.96   0.000    -.1267278   -.1262511
     1.prov_11 |  -.0269937   .0002067  -130.62   0.000    -.0273988   -.0265887
     1.prov_12 |  -.0431895   .0001001  -431.37   0.000    -.0433857   -.0429933
     1.prov_13 |  -.0421147   .0001079  -390.41   0.000    -.0423261   -.0419032
     1.prov_24 |    .015844   .0000408   388.49   0.000     .0157641    .0159239
     1.prov_35 |   .0052597   .0000376   139.87   0.000      .005186    .0053334
     1.prov_46 |  -.0099351   .0000917  -108.30   0.000    -.0101149   -.0097553
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0258715   .0000461   561.13   0.000     .0257811    .0259618
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0030738   .0000741    41.51   0.000     .0029287     .003219
   1.year_2002 |  -.0014491   .0000739   -19.60   0.000     -.001594   -.0013042
   1.year_2003 |   .0058895   .0000738    79.78   0.000     .0057448    .0060342
   1.year_2004 |   .0014395   .0000736    19.56   0.000     .0012952    .0015837
   1.year_2005 |   .0126387   .0000734   172.24   0.000     .0124949    .0127825
   1.year_2006 |   .0190915   .0000731   261.27   0.000     .0189483    .0192347
   1.year_2007 |   .0202312   .0000727   278.34   0.000     .0200887    .0203736
   1.year_2008 |   .0190435   .0000722   263.67   0.000     .0189019    .0191851
   1.year_2009 |  -.0063175   .0000718   -88.03   0.000    -.0064581   -.0061768
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0276081   .0000694  -397.59   0.000    -.0277441    -.027472
   1.year_2012 |  -.0180133   .0000693  -260.00   0.000    -.0181491   -.0178775
   1.year_2013 |   -.025603   .0000692  -370.13   0.000    -.0257386   -.0254674
   1.year_2014 |   -.026113    .000069  -378.53   0.000    -.0262482   -.0259778
   1.year_2015 |  -.0255128   .0000687  -371.10   0.000    -.0256475    -.025378
   1.year_2016 |  -.0217378   .0000684  -317.60   0.000    -.0218719   -.0216036
   1.year_2017 |  -.0126807   .0000681  -186.18   0.000    -.0128141   -.0125472
   1.year_2018 |   .0007468   .0000677    11.04   0.000     .0006142    .0008794
   1.year_2019 |          0  (omitted)
         _cons |   .7974711   .0000894  8917.11   0.000     .7972958    .7976464
--------------------------------------------------------------------------------

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate1519 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0595259   .0001726  -344.98   0.000    -.0598641   -.0591877
         treat |  -.0577439   .0001464  -394.48   0.000    -.0580308    -.057457
treated35_2009 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
     1.prov_10 |  -.1640672   .0002144  -765.36   0.000    -.1644874   -.1636471
     1.prov_11 |  -.0106634   .0003432   -31.07   0.000     -.011336   -.0099907
     1.prov_12 |  -.0772877   .0001782  -433.75   0.000     -.077637   -.0769385
     1.prov_13 |  -.0553979   .0001908  -290.33   0.000    -.0557719    -.055024
     1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
     1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
     1.prov_46 |   -.010973   .0001642   -66.81   0.000    -.0112949   -.0106511
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0421844   .0001325  -318.39   0.000    -.0424441   -.0419247
   1.year_2002 |  -.0300449   .0001323  -227.05   0.000    -.0303043   -.0297856
   1.year_2003 |  -.0271974   .0001323  -205.65   0.000    -.0274566   -.0269382
   1.year_2004 |  -.0310682    .000132  -235.34   0.000     -.031327   -.0308095
   1.year_2005 |  -.0276248   .0001315  -210.01   0.000    -.0278826    -.027367
   1.year_2006 |  -.0226973    .000131  -173.21   0.000    -.0229541   -.0224405
   1.year_2007 |  -.0039536   .0001307   -30.26   0.000    -.0042097   -.0036975
   1.year_2008 |          0  (omitted)
   1.year_2009 |   .0159856   .0001727    92.59   0.000     .0156472     .016324
   1.year_2010 |  -.0014201   .0001728    -8.22   0.000    -.0017587   -.0010815
   1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
   1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
   1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
   1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
   1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
   1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
   1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
   1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
   1.year_2019 |          0  (omitted)
         _cons |   .5279296   .0001582  3336.50   0.000     .5276195    .5282398
--------------------------------------------------------------------------------

. reg employed_rate2024 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |  1868.41785        28  66.7292088   Prob > F        =    0.0000
    Residual |  557.892893 1,718,009  .000324732   R-squared       =    0.7701
-------------+----------------------------------   Adj R-squared   =    0.7701
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01802

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0096146   .0001102   -87.27   0.000    -.0098305   -.0093987
         treat |  -.0296393   .0000957  -309.80   0.000    -.0298268   -.0294517
treated35_2009 |  -.0003471   .0000816    -4.25   0.000     -.000507   -.0001871
     1.prov_10 |  -.1623606   .0001404 -1156.58   0.000    -.1626357   -.1620855
     1.prov_11 |  -.0439087    .000228  -192.58   0.000    -.0443556   -.0434618
     1.prov_12 |   -.068385   .0001151  -593.97   0.000    -.0686106   -.0681593
     1.prov_13 |  -.0777224   .0001247  -623.45   0.000    -.0779668   -.0774781
     1.prov_24 |   .0158428   .0000478   331.12   0.000      .015749    .0159365
     1.prov_35 |  -.0224216   .0000438  -512.07   0.000    -.0225075   -.0223358
     1.prov_46 |   .0085719    .000107    80.14   0.000     .0083622    .0087815
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0491358   .0000552   890.13   0.000     .0490276     .049244
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0220143   .0000872  -252.55   0.000    -.0221851   -.0218434
   1.year_2002 |  -.0170156   .0000868  -195.94   0.000    -.0171859   -.0168454
   1.year_2003 |   -.011707   .0000865  -135.34   0.000    -.0118765   -.0115374
   1.year_2004 |  -.0131985   .0000862  -153.18   0.000    -.0133674   -.0130296
   1.year_2005 |  -.0112269   .0000859  -130.71   0.000    -.0113953   -.0110586
   1.year_2006 |  -.0009426   .0000857   -11.00   0.000    -.0011106   -.0007747
   1.year_2007 |   .0074585   .0000855    87.23   0.000     .0072909    .0076261
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0245391     .00011  -223.14   0.000    -.0247547   -.0243236
   1.year_2010 |  -.0260287     .00011  -236.60   0.000    -.0262443   -.0258131
   1.year_2011 |  -.0213115   .0000836  -254.97   0.000    -.0214753   -.0211476
   1.year_2012 |  -.0217993   .0000831  -262.27   0.000    -.0219622   -.0216364
   1.year_2013 |  -.0184455   .0000827  -222.92   0.000    -.0186076   -.0182833
   1.year_2014 |  -.0130524   .0000826  -158.07   0.000    -.0132143   -.0128906
   1.year_2015 |  -.0184701   .0000826  -223.67   0.000    -.0186319   -.0183082
   1.year_2016 |  -.0145078   .0000827  -175.47   0.000    -.0146698   -.0143457
   1.year_2017 |  -.0061821   .0000828   -74.66   0.000    -.0063444   -.0060198
   1.year_2018 |  -.0096255   .0000828  -116.22   0.000    -.0097878   -.0094632
   1.year_2019 |          0  (omitted)
         _cons |   .7408756   .0001038  7134.55   0.000     .7406721    .7410792
--------------------------------------------------------------------------------

. reg employed_rate2529 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  =  97599.46
       Model |   627.81352        28  22.4219114   Prob > F        =    0.0000
    Residual |  386.750018 1,683,469  .000229734   R-squared       =    0.6188
-------------+----------------------------------   Adj R-squared   =    0.6188
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01516

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0059885   .0000937    63.94   0.000     .0058049    .0061721
         treat |  -.0238447   .0000833  -286.30   0.000    -.0240079   -.0236814
treated35_2009 |   .0013552   .0000706    19.19   0.000     .0012168    .0014936
     1.prov_10 |  -.1264895   .0001216 -1039.96   0.000    -.1267278   -.1262511
     1.prov_11 |  -.0269937   .0002067  -130.62   0.000    -.0273988   -.0265887
     1.prov_12 |  -.0431895   .0001001  -431.37   0.000    -.0433857   -.0429933
     1.prov_13 |  -.0421147   .0001079  -390.41   0.000    -.0423261   -.0419032
     1.prov_24 |    .015844   .0000408   388.49   0.000     .0157641    .0159239
     1.prov_35 |   .0052597   .0000376   139.87   0.000      .005186    .0053334
     1.prov_46 |  -.0099351   .0000917  -108.30   0.000    -.0101149   -.0097553
     1.prov_47 |          0  (omitted)
     1.prov_48 |   .0258715   .0000461   561.13   0.000     .0257811    .0259618
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0159697   .0000746  -214.17   0.000    -.0161158   -.0158235
   1.year_2002 |  -.0204926   .0000744  -275.26   0.000    -.0206385   -.0203467
   1.year_2003 |   -.013154   .0000743  -176.96   0.000    -.0132997   -.0130083
   1.year_2004 |   -.017604   .0000741  -237.53   0.000    -.0177493   -.0174588
   1.year_2005 |  -.0064048   .0000739   -86.68   0.000    -.0065496     -.00626
   1.year_2006 |    .000048   .0000736     0.65   0.514    -.0000962    .0001922
   1.year_2007 |   .0011877   .0000732    16.22   0.000     .0010442    .0013311
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0313495   .0000933  -335.97   0.000    -.0315324   -.0311666
   1.year_2010 |   -.025032   .0000932  -268.55   0.000    -.0252147   -.0248493
   1.year_2011 |  -.0276081   .0000694  -397.59   0.000    -.0277441    -.027472
   1.year_2012 |  -.0180133   .0000693  -260.00   0.000    -.0181491   -.0178775
   1.year_2013 |   -.025603   .0000692  -370.13   0.000    -.0257386   -.0254674
   1.year_2014 |   -.026113    .000069  -378.53   0.000    -.0262482   -.0259778
   1.year_2015 |  -.0255128   .0000687  -371.10   0.000    -.0256475    -.025378
   1.year_2016 |  -.0217378   .0000684  -317.60   0.000    -.0218719   -.0216036
   1.year_2017 |  -.0126807   .0000681  -186.18   0.000    -.0128141   -.0125472
   1.year_2018 |   .0007468   .0000677    11.04   0.000     .0006142    .0008794
   1.year_2019 |          0  (omitted)
         _cons |   .8165146     .00009  9075.41   0.000     .8163383    .8166909
--------------------------------------------------------------------------------

. 
end of do-file

. gen agegroup_1519 = (age_12 == 1)

. gen agegroup_2024 = (age_12 == 2)

. gen agegroup_2529 = (age_12 == 3)

. 
. gen treated24_2011_1519 = treat * post2011 * agegroup_1519

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate1519 post2011 treat treated24_2011_1519 i.prov_* i.year_* [aweight=fw
> eight]
(sum of wgt is 478,553,506)
note: 1.prov_47 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  77328.31
       Model |  1884.70818        28  67.3110063   Prob > F        =    0.0000
    Residual |  1617.24479 1,857,925  .000870458   R-squared       =    0.5382
-------------+----------------------------------   Adj R-squared   =    0.5382
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =     .0295

-------------------------------------------------------------------------------------
  employed_rate1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           post2011 |   .0014201   .0001728     8.22   0.000     .0010815    .0017587
              treat |  -.0577439   .0001464  -394.48   0.000    -.0580308    -.057457
treated24_2011_1519 |   .0182415   .0001262   144.51   0.000     .0179941     .018489
          1.prov_10 |  -.1640672   .0002144  -765.36   0.000    -.1644874   -.1636471
          1.prov_11 |  -.0106634   .0003432   -31.07   0.000     -.011336   -.0099907
          1.prov_12 |  -.0772877   .0001782  -433.75   0.000     -.077637   -.0769385
          1.prov_13 |  -.0553979   .0001908  -290.33   0.000    -.0557719    -.055024
          1.prov_24 |   .0206217    .000076   271.41   0.000     .0204728    .0207706
          1.prov_35 |  -.0018022   .0000691   -26.08   0.000    -.0019376   -.0016667
          1.prov_46 |   -.010973   .0001642   -66.81   0.000    -.0112949   -.0106511
          1.prov_47 |          0  (omitted)
          1.prov_48 |   .0474728   .0000881   538.70   0.000        .0473    .0476455
          1.prov_59 |          0  (omitted)
        1.year_2001 |   .0187615   .0001326   141.51   0.000     .0185017    .0190214
        1.year_2002 |    .030901   .0001324   233.36   0.000     .0306415    .0311605
        1.year_2003 |   .0337485   .0001323   255.01   0.000     .0334891    .0340079
        1.year_2004 |   .0298777   .0001321   226.17   0.000     .0296188    .0301366
        1.year_2005 |   .0333211   .0001316   253.15   0.000     .0330631    .0335791
        1.year_2006 |   .0382486   .0001311   291.69   0.000     .0379916    .0385056
        1.year_2007 |   .0569924   .0001308   435.88   0.000     .0567361    .0572486
        1.year_2008 |   .0609459   .0001305   467.04   0.000     .0606902    .0612017
        1.year_2009 |   .0174057   .0001306   133.30   0.000     .0171497    .0176616
        1.year_2010 |          0  (omitted)
        1.year_2011 |  -.0140321   .0001338  -104.85   0.000    -.0142944   -.0137698
        1.year_2012 |  -.0221814   .0001342  -165.29   0.000    -.0224444   -.0219184
        1.year_2013 |  -.0275764   .0001347  -204.69   0.000    -.0278405   -.0273124
        1.year_2014 |  -.0166471   .0001354  -122.95   0.000    -.0169125   -.0163817
        1.year_2015 |   -.014712   .0001361  -108.11   0.000    -.0149787   -.0144453
        1.year_2016 |  -.0183722   .0001367  -134.44   0.000      -.01864   -.0181044
        1.year_2017 |  -.0089095    .000137   -65.04   0.000    -.0091779    -.008641
        1.year_2018 |   .0009501    .000137     6.94   0.000     .0006817    .0012186
        1.year_2019 |          0  (omitted)
              _cons |   .4669837   .0001584  2947.91   0.000     .4666732    .4672942
-------------------------------------------------------------------------------------

. 
end of do-file

. drop treated24_2011_1519

. drop agegroup_1519

. drop agegroup_2024

. drop agegroup_2529

. gen treat = (prov == 24)
variable treat already defined
r(110);

. 
. drop treat

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treat = (prov == 24)

. gen treated24_2011 = treat * post2011 
variable treated24_2011 already defined
r(110);

end of do-file

r(110);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treat = (prov == 24)
variable treat already defined
r(110);

end of do-file

r(110);

. drop treat

. drop treated24_2011

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treat = (prov == 24)

. gen treated24_2011 = treat * post2011 

. * Quebec as the treatment group
. reg employed_rate1519 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  >  99999.00
       Model |  2415.95004        28  86.2839301   Prob > F        =    0.0000
    Residual |  1086.00292 1,857,925  .000584525   R-squared       =    0.6899
-------------+----------------------------------   Adj R-squared   =    0.6899
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02418

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |  -.0007327   .0001111    -6.60   0.000    -.0009504    -.000515
         treat |  -.0176979   .0000737  -240.04   0.000    -.0178424   -.0175534
treated24_2011 |   .0837904   .0000864   969.51   0.000      .083621    .0839598
     1.prov_10 |  -.1149835   .0001533  -749.85   0.000    -.1152841    -.114683
     1.prov_11 |   .0384864   .0002679   143.68   0.000     .0379614    .0390114
     1.prov_12 |   -.028163   .0001182  -238.18   0.000    -.0283948   -.0279313
     1.prov_13 |  -.0062697   .0001308   -47.93   0.000    -.0065261   -.0060134
     1.prov_24 |          0  (omitted)
     1.prov_35 |  -.0017224   .0000566   -30.42   0.000    -.0018334   -.0016114
     1.prov_46 |   .0382367   .0001038   368.42   0.000     .0380333    .0384401
     1.prov_47 |   .0491605   .0001104   445.26   0.000     .0489441    .0493769
     1.prov_48 |   .0476166   .0000722   659.38   0.000     .0474751    .0477581
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0187554   .0001086   172.63   0.000     .0185425    .0189684
   1.year_2002 |    .030718   .0001085   283.10   0.000     .0305053    .0309306
   1.year_2003 |   .0334594   .0001084   308.53   0.000     .0332468    .0336719
   1.year_2004 |    .029521   .0001083   272.70   0.000     .0293088    .0297332
   1.year_2005 |     .03296   .0001079   305.57   0.000     .0327486    .0331714
   1.year_2006 |   .0379547   .0001075   353.22   0.000     .0377441    .0381653
   1.year_2007 |   .0568261   .0001071   530.36   0.000     .0566161    .0570361
   1.year_2008 |   .0608832   .0001069   569.35   0.000     .0606736    .0610928
   1.year_2009 |   .0173997    .000107   162.62   0.000       .01719    .0176094
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0149776   .0001097  -136.57   0.000    -.0151926   -.0147627
   1.year_2012 |  -.0229522     .00011  -208.71   0.000    -.0231677   -.0227367
   1.year_2013 |  -.0281655   .0001104  -255.12   0.000    -.0283818   -.0279491
   1.year_2014 |   -.017081    .000111  -153.94   0.000    -.0172984   -.0168635
   1.year_2015 |  -.0150267   .0001115  -134.75   0.000    -.0152452   -.0148081
   1.year_2016 |  -.0185825    .000112  -165.94   0.000     -.018802    -.018363
   1.year_2017 |  -.0090406   .0001123   -80.54   0.000    -.0092606   -.0088205
   1.year_2018 |   .0008986   .0001122     8.01   0.000     .0006786    .0011186
   1.year_2019 |          0  (omitted)
         _cons |   .4190647   .0000891  4703.22   0.000     .4188901    .4192394
--------------------------------------------------------------------------------

. outreg2 using "339t1.xls", ctitle("`x'") se 2aster replace keep(post2011 treat treated
> 24_2011) addtext(FE, YES)
339t1.xls
dir : seeout

. reg employed_rate2024 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |  1954.37698        28  69.7991779   Prob > F        =    0.0000
    Residual |  471.933756 1,718,009  .000274698   R-squared       =    0.8055
-------------+----------------------------------   Adj R-squared   =    0.8055
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01657

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0184914   .0000782   236.33   0.000      .018338    .0186447
         treat |  -.0007362   .0000531   -13.88   0.000    -.0008402   -.0006322
treated24_2011 |   .0340068   .0000608   559.41   0.000     .0338876    .0341259
     1.prov_10 |  -.1329494   .0001127 -1179.55   0.000    -.1331703   -.1327285
     1.prov_11 |  -.0141917      .0002   -70.95   0.000    -.0145838   -.0137997
     1.prov_12 |  -.0387493   .0000852  -455.03   0.000    -.0389162   -.0385824
     1.prov_13 |  -.0482406   .0000958  -503.41   0.000    -.0484285   -.0480528
     1.prov_24 |          0  (omitted)
     1.prov_35 |  -.0223564   .0000403  -555.14   0.000    -.0224353   -.0222775
     1.prov_46 |   .0383979   .0000756   507.92   0.000     .0382497    .0385461
     1.prov_47 |   .0297374     .00008   371.73   0.000     .0295806    .0298942
     1.prov_48 |   .0491193   .0000508   967.48   0.000     .0490198    .0492188
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0140739     .00008   175.86   0.000     .0139171    .0142308
   1.year_2002 |   .0190192   .0000797   238.55   0.000     .0188629    .0191754
   1.year_2003 |   .0242492   .0000794   305.36   0.000     .0240936    .0244049
   1.year_2004 |   .0226757   .0000791   286.66   0.000     .0225207    .0228308
   1.year_2005 |   .0245547   .0000789   311.40   0.000     .0244001    .0247092
   1.year_2006 |    .034747   .0000787   441.69   0.000     .0345928    .0349011
   1.year_2007 |   .0430531   .0000785   548.47   0.000     .0428993     .043207
   1.year_2008 |   .0355392   .0000783   453.62   0.000     .0353857    .0356928
   1.year_2009 |   .0013573   .0000781    17.37   0.000     .0012041    .0015104
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0216222   .0000769  -281.26   0.000    -.0217729   -.0214716
   1.year_2012 |  -.0221378   .0000764  -289.58   0.000    -.0222876    -.021988
   1.year_2013 |  -.0187874   .0000761  -246.86   0.000    -.0189366   -.0186382
   1.year_2014 |  -.0133772   .0000759  -176.14   0.000    -.0135261   -.0132283
   1.year_2015 |  -.0187498    .000076  -246.87   0.000    -.0188987    -.018601
   1.year_2016 |  -.0147291    .000076  -193.69   0.000    -.0148781     -.01458
   1.year_2017 |  -.0063311   .0000762   -83.13   0.000    -.0064804   -.0061818
   1.year_2018 |  -.0097005   .0000762  -127.35   0.000    -.0098498   -.0095512
   1.year_2019 |          0  (omitted)
         _cons |   .6792147   .0000645  1.1e+04   0.000     .6790883    .6793412
--------------------------------------------------------------------------------

. outreg2 using "339t1.xls", ctitle("`x'") se 2aster append keep(post2011 treat treated2
> 4_2011) addtext(FE, YES)
339t1.xls
dir : seeout

. reg employed_rate2529 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  >  99999.00
       Model |  684.487702        28  24.4459894   Prob > F        =    0.0000
    Residual |  330.075836 1,683,469  .000196069   R-squared       =    0.6747
-------------+----------------------------------   Adj R-squared   =    0.6747
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =      .014

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0200558   .0000653   307.26   0.000     .0199279    .0201837
         treat |   .0022583   .0000454    49.79   0.000     .0021694    .0023472
treated24_2011 |   .0277032   .0000515   538.04   0.000     .0276022    .0278041
     1.prov_10 |  -.1034859   .0000986 -1049.84   0.000    -.1036791   -.1032927
     1.prov_11 |  -.0039379   .0001832   -21.50   0.000    -.0042969    -.003579
     1.prov_12 |  -.0201294   .0000752  -267.79   0.000    -.0202767   -.0199821
     1.prov_13 |  -.0192179   .0000837  -229.50   0.000     -.019382   -.0190538
     1.prov_24 |          0  (omitted)
     1.prov_35 |   .0052832   .0000347   152.08   0.000     .0052151    .0053513
     1.prov_46 |   .0132599   .0000655   202.58   0.000     .0131316    .0133882
     1.prov_47 |   .0233226   .0000686   339.76   0.000     .0231881    .0234571
     1.prov_48 |   .0260503   .0000426   611.58   0.000     .0259668    .0261337
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0031223   .0000684    45.64   0.000     .0029882    .0032564
   1.year_2002 |  -.0013499   .0000683   -19.76   0.000    -.0014838   -.0012161
   1.year_2003 |   .0060445   .0000682    88.63   0.000     .0059108    .0061782
   1.year_2004 |   .0016349    .000068    24.04   0.000     .0015016    .0017682
   1.year_2005 |   .0128593   .0000678   189.70   0.000     .0127265    .0129922
   1.year_2006 |   .0193122   .0000675   286.08   0.000     .0191799    .0194445
   1.year_2007 |   .0204089   .0000671   303.93   0.000     .0202773    .0205405
   1.year_2008 |   .0191487   .0000667   286.98   0.000     .0190179    .0192795
   1.year_2009 |   -.006287   .0000663   -94.82   0.000    -.0064169    -.006157
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0277053   .0000641  -431.89   0.000    -.0278311   -.0275796
   1.year_2012 |  -.0180651    .000064  -282.24   0.000    -.0181905   -.0179396
   1.year_2013 |  -.0256309   .0000639  -401.09   0.000    -.0257561   -.0255056
   1.year_2014 |   -.026119   .0000637  -409.83   0.000    -.0262439   -.0259941
   1.year_2015 |  -.0255182   .0000635  -401.79   0.000    -.0256427   -.0253937
   1.year_2016 |  -.0217598   .0000632  -344.14   0.000    -.0218837   -.0216359
   1.year_2017 |   -.012712   .0000629  -202.03   0.000    -.0128353   -.0125886
   1.year_2018 |   .0007277   .0000625    11.64   0.000     .0006052    .0008502
   1.year_2019 |          0  (omitted)
         _cons |   .7767784   .0000548  1.4e+04   0.000     .7766709    .7768859
--------------------------------------------------------------------------------

. outreg2 using "339t1.xls", ctitle("`x'") se 2aster append keep(post2011 treat treated2
> 4_2011) addtext(FE, YES)
339t1.xls
dir : seeout

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Ontario as the treatment group
. drop treat 

. gen treat = (prov == 35)

. gen treated35_2009 = treat * post2009
variable treated35_2009 already defined
r(110);

end of do-file

r(110);

. drop treated35_2009

. drop treated48_2015

. drop treated59_2012

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. drop treat 

. gen treat = (prov == 35)

. gen treated35_2009 = treat * post2009

. 
. reg employed_rate1519 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  92119.43
       Model |  2035.65334        28  72.7019049   Prob > F        =    0.0000
    Residual |  1466.29963 1,857,925  .000789214   R-squared       =    0.5813
-------------+----------------------------------   Adj R-squared   =    0.5813
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02809

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0277859   .0001318  -210.88   0.000    -.0280441   -.0275276
         treat |   .0210237   .0000822   255.73   0.000     .0208626    .0211848
treated35_2009 |  -.0393863   .0000851  -462.92   0.000    -.0395531   -.0392195
     1.prov_10 |  -.1132041   .0001782  -635.32   0.000    -.1135533   -.1128549
     1.prov_11 |   .0392373   .0003113   126.06   0.000     .0386273    .0398474
     1.prov_12 |  -.0270384   .0001374  -196.79   0.000    -.0273077   -.0267691
     1.prov_13 |  -.0051941    .000152   -34.17   0.000     -.005492   -.0048962
     1.prov_24 |   .0206923   .0000723   286.01   0.000     .0205505    .0208341
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0380828   .0001206   315.79   0.000     .0378464    .0383192
     1.prov_47 |   .0497727   .0001283   387.96   0.000     .0495212    .0500241
     1.prov_48 |    .047386   .0000839   564.71   0.000     .0472215    .0475504
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0417727   .0001262  -331.12   0.000      -.04202   -.0415254
   1.year_2002 |  -.0297678    .000126  -236.26   0.000    -.0300148   -.0295209
   1.year_2003 |  -.0270282   .0001259  -214.63   0.000     -.027275   -.0267814
   1.year_2004 |  -.0309901   .0001257  -246.54   0.000    -.0312364   -.0307437
   1.year_2005 |  -.0275981   .0001252  -220.34   0.000    -.0278435   -.0273526
   1.year_2006 |  -.0226982   .0001248  -181.91   0.000    -.0229427   -.0224536
   1.year_2007 |  -.0039488   .0001244   -31.74   0.000    -.0041926   -.0037049
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0000514   .0001272    -0.40   0.686    -.0003008     .000198
   1.year_2010 |  -.0174053   .0001273  -136.77   0.000    -.0176547   -.0171559
   1.year_2011 |  -.0141582   .0001274  -111.11   0.000    -.0144079   -.0139084
   1.year_2012 |   -.022284   .0001278  -174.39   0.000    -.0225344   -.0220335
   1.year_2013 |  -.0276595   .0001283  -215.62   0.000    -.0279109   -.0274081
   1.year_2014 |  -.0167233   .0001289  -129.71   0.000     -.016976   -.0164706
   1.year_2015 |  -.0147974   .0001296  -114.20   0.000    -.0150513   -.0145434
   1.year_2016 |  -.0184634   .0001301  -141.90   0.000    -.0187184   -.0182083
   1.year_2017 |  -.0089864   .0001304   -68.90   0.000     -.009242   -.0087307
   1.year_2018 |   .0009109   .0001304     6.98   0.000     .0006553    .0011665
   1.year_2019 |          0  (omitted)
         _cons |   .4621616   .0001047  4414.11   0.000     .4619564    .4623668
--------------------------------------------------------------------------------

. reg employed_rate2024 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |   1937.8477        28  69.2088464   Prob > F        =    0.0000
    Residual |   488.46304 1,718,009  .000284319   R-squared       =    0.7987
-------------+----------------------------------   Adj R-squared   =    0.7987
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01686

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0008775   .0000816    10.75   0.000     .0007175    .0010375
         treat |  -.0062964   .0000524  -120.21   0.000     -.006399   -.0061937
treated35_2009 |   -.026566   .0000538  -494.18   0.000    -.0266713   -.0264606
     1.prov_10 |  -.1320272   .0001147 -1151.35   0.000    -.1322519   -.1318024
     1.prov_11 |  -.0139531   .0002035   -68.56   0.000    -.0143519   -.0135542
     1.prov_12 |  -.0383499   .0000866  -442.65   0.000    -.0385197   -.0381801
     1.prov_13 |  -.0474763   .0000975  -486.97   0.000    -.0476674   -.0472852
     1.prov_24 |    .016018   .0000448   357.78   0.000     .0159303    .0161058
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0383866   .0000769   499.11   0.000     .0382359    .0385374
     1.prov_47 |   .0299045   .0000814   367.44   0.000      .029745     .030064
     1.prov_48 |   .0491377   .0000517   951.32   0.000     .0490364    .0492389
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0216824   .0000816  -265.83   0.000    -.0218422   -.0215225
   1.year_2002 |  -.0167271   .0000813  -205.84   0.000    -.0168864   -.0165679
   1.year_2003 |  -.0114802   .0000809  -141.84   0.000    -.0116389   -.0113216
   1.year_2004 |  -.0130292   .0000806  -161.60   0.000    -.0131872   -.0128711
   1.year_2005 |  -.0111215   .0000804  -138.38   0.000     -.011279    -.010964
   1.year_2006 |  -.0008858   .0000802   -11.05   0.000     -.001043   -.0007286
   1.year_2007 |   .0074722     .00008    93.39   0.000     .0073153     .007629
   1.year_2008 |          0  (omitted)
   1.year_2009 |   -.024499   .0000784  -312.40   0.000    -.0246527   -.0243453
   1.year_2010 |  -.0260162   .0000785  -331.38   0.000    -.0261701   -.0258624
   1.year_2011 |  -.0215828   .0000782  -275.96   0.000     -.021736   -.0214295
   1.year_2012 |  -.0220533   .0000778  -283.55   0.000    -.0222057   -.0219008
   1.year_2013 |  -.0186836   .0000774  -241.31   0.000    -.0188354   -.0185319
   1.year_2014 |  -.0132749   .0000773  -171.81   0.000    -.0134263   -.0131234
   1.year_2015 |  -.0186675   .0000773  -241.59   0.000    -.0188189    -.018516
   1.year_2016 |  -.0146726   .0000774  -189.66   0.000    -.0148243    -.014521
   1.year_2017 |  -.0062996   .0000775   -81.30   0.000    -.0064515   -.0061478
   1.year_2018 |  -.0096787   .0000775  -124.90   0.000    -.0098306   -.0095269
   1.year_2019 |          0  (omitted)
         _cons |   .7047585   .0000667  1.1e+04   0.000     .7046278    .7048892
--------------------------------------------------------------------------------

. reg employed_rate2529 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  >  99999.00
       Model |  701.015992        28  25.0362854   Prob > F        =    0.0000
    Residual |  313.547546 1,683,469  .000186251   R-squared       =    0.6910
-------------+----------------------------------   Adj R-squared   =    0.6909
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01365

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0181341   .0000655   276.91   0.000     .0180058    .0182625
         treat |   .0223023   .0000434   513.74   0.000     .0222172    .0223874
treated35_2009 |  -.0277721   .0000443  -627.28   0.000    -.0278589   -.0276853
     1.prov_10 |  -.1028871   .0000961 -1070.91   0.000    -.1030754   -.1026988
     1.prov_11 |  -.0034991   .0001785   -19.60   0.000     -.003849   -.0031493
     1.prov_12 |  -.0197088   .0000733  -269.01   0.000    -.0198523   -.0195652
     1.prov_13 |   -.018286   .0000816  -224.05   0.000    -.0184459    -.018126
     1.prov_24 |   .0160881   .0000367   438.09   0.000     .0160161    .0161601
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0132145   .0000638   207.14   0.000     .0130894    .0133395
     1.prov_47 |   .0228521   .0000669   341.57   0.000      .022721    .0229833
     1.prov_48 |   .0255821   .0000415   616.19   0.000     .0255008    .0256635
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0161247   .0000671  -240.17   0.000    -.0162563   -.0159931
   1.year_2002 |  -.0206485    .000067  -308.04   0.000    -.0207799   -.0205172
   1.year_2003 |  -.0132785   .0000669  -198.39   0.000    -.0134097   -.0131473
   1.year_2004 |  -.0176934   .0000667  -265.15   0.000    -.0178242   -.0175626
   1.year_2005 |  -.0064508   .0000665   -96.96   0.000    -.0065812   -.0063204
   1.year_2006 |    .000043   .0000663     0.65   0.516    -.0000868    .0001729
   1.year_2007 |   .0011984   .0000659    18.18   0.000     .0010692    .0013276
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0328212   .0000627  -523.51   0.000    -.0329441   -.0326983
   1.year_2010 |  -.0265568   .0000626  -424.02   0.000    -.0266795    -.026434
   1.year_2011 |  -.0279175   .0000625  -446.51   0.000    -.0280401    -.027795
   1.year_2012 |  -.0182896   .0000624  -293.18   0.000    -.0184119   -.0181673
   1.year_2013 |  -.0258628   .0000623  -415.24   0.000    -.0259849   -.0257407
   1.year_2014 |  -.0263557   .0000621  -424.30   0.000    -.0264775    -.026234
   1.year_2015 |  -.0257377   .0000619  -415.78   0.000     -.025859   -.0256163
   1.year_2016 |  -.0219307   .0000616  -355.86   0.000    -.0220515   -.0218099
   1.year_2017 |  -.0128201   .0000613  -209.05   0.000    -.0129402   -.0126999
   1.year_2018 |   .0006843   .0000609    11.23   0.000     .0005648    .0008037
   1.year_2019 |          0  (omitted)
         _cons |   .7861669   .0000548  1.4e+04   0.000     .7860595    .7862744
--------------------------------------------------------------------------------

. 
end of do-file

. drop treat

. drop treated35_2009

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Ontario as the treatment group
. drop treat 
treat ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treat = (prov == 35)

. gen treated35_2009 = treat * post2009

. 
. reg employed_rate1519 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  92119.43
       Model |  2035.65334        28  72.7019049   Prob > F        =    0.0000
    Residual |  1466.29963 1,857,925  .000789214   R-squared       =    0.5813
-------------+----------------------------------   Adj R-squared   =    0.5813
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02809

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0277859   .0001318  -210.88   0.000    -.0280441   -.0275276
         treat |   .0210237   .0000822   255.73   0.000     .0208626    .0211848
treated35_2009 |  -.0393863   .0000851  -462.92   0.000    -.0395531   -.0392195
     1.prov_10 |  -.1132041   .0001782  -635.32   0.000    -.1135533   -.1128549
     1.prov_11 |   .0392373   .0003113   126.06   0.000     .0386273    .0398474
     1.prov_12 |  -.0270384   .0001374  -196.79   0.000    -.0273077   -.0267691
     1.prov_13 |  -.0051941    .000152   -34.17   0.000     -.005492   -.0048962
     1.prov_24 |   .0206923   .0000723   286.01   0.000     .0205505    .0208341
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0380828   .0001206   315.79   0.000     .0378464    .0383192
     1.prov_47 |   .0497727   .0001283   387.96   0.000     .0495212    .0500241
     1.prov_48 |    .047386   .0000839   564.71   0.000     .0472215    .0475504
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0417727   .0001262  -331.12   0.000      -.04202   -.0415254
   1.year_2002 |  -.0297678    .000126  -236.26   0.000    -.0300148   -.0295209
   1.year_2003 |  -.0270282   .0001259  -214.63   0.000     -.027275   -.0267814
   1.year_2004 |  -.0309901   .0001257  -246.54   0.000    -.0312364   -.0307437
   1.year_2005 |  -.0275981   .0001252  -220.34   0.000    -.0278435   -.0273526
   1.year_2006 |  -.0226982   .0001248  -181.91   0.000    -.0229427   -.0224536
   1.year_2007 |  -.0039488   .0001244   -31.74   0.000    -.0041926   -.0037049
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0000514   .0001272    -0.40   0.686    -.0003008     .000198
   1.year_2010 |  -.0174053   .0001273  -136.77   0.000    -.0176547   -.0171559
   1.year_2011 |  -.0141582   .0001274  -111.11   0.000    -.0144079   -.0139084
   1.year_2012 |   -.022284   .0001278  -174.39   0.000    -.0225344   -.0220335
   1.year_2013 |  -.0276595   .0001283  -215.62   0.000    -.0279109   -.0274081
   1.year_2014 |  -.0167233   .0001289  -129.71   0.000     -.016976   -.0164706
   1.year_2015 |  -.0147974   .0001296  -114.20   0.000    -.0150513   -.0145434
   1.year_2016 |  -.0184634   .0001301  -141.90   0.000    -.0187184   -.0182083
   1.year_2017 |  -.0089864   .0001304   -68.90   0.000     -.009242   -.0087307
   1.year_2018 |   .0009109   .0001304     6.98   0.000     .0006553    .0011665
   1.year_2019 |          0  (omitted)
         _cons |   .4621616   .0001047  4414.11   0.000     .4619564    .4623668
--------------------------------------------------------------------------------

. outreg2 using "339t2.xls", ctitle("`x'") se 2aster replace keep(post2009 treat treated
> 35_2009) addtext(FE, YES)
339t2.xls
dir : seeout

. reg employed_rate2024 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |   1937.8477        28  69.2088464   Prob > F        =    0.0000
    Residual |   488.46304 1,718,009  .000284319   R-squared       =    0.7987
-------------+----------------------------------   Adj R-squared   =    0.7987
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01686

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0008775   .0000816    10.75   0.000     .0007175    .0010375
         treat |  -.0062964   .0000524  -120.21   0.000     -.006399   -.0061937
treated35_2009 |   -.026566   .0000538  -494.18   0.000    -.0266713   -.0264606
     1.prov_10 |  -.1320272   .0001147 -1151.35   0.000    -.1322519   -.1318024
     1.prov_11 |  -.0139531   .0002035   -68.56   0.000    -.0143519   -.0135542
     1.prov_12 |  -.0383499   .0000866  -442.65   0.000    -.0385197   -.0381801
     1.prov_13 |  -.0474763   .0000975  -486.97   0.000    -.0476674   -.0472852
     1.prov_24 |    .016018   .0000448   357.78   0.000     .0159303    .0161058
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0383866   .0000769   499.11   0.000     .0382359    .0385374
     1.prov_47 |   .0299045   .0000814   367.44   0.000      .029745     .030064
     1.prov_48 |   .0491377   .0000517   951.32   0.000     .0490364    .0492389
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0216824   .0000816  -265.83   0.000    -.0218422   -.0215225
   1.year_2002 |  -.0167271   .0000813  -205.84   0.000    -.0168864   -.0165679
   1.year_2003 |  -.0114802   .0000809  -141.84   0.000    -.0116389   -.0113216
   1.year_2004 |  -.0130292   .0000806  -161.60   0.000    -.0131872   -.0128711
   1.year_2005 |  -.0111215   .0000804  -138.38   0.000     -.011279    -.010964
   1.year_2006 |  -.0008858   .0000802   -11.05   0.000     -.001043   -.0007286
   1.year_2007 |   .0074722     .00008    93.39   0.000     .0073153     .007629
   1.year_2008 |          0  (omitted)
   1.year_2009 |   -.024499   .0000784  -312.40   0.000    -.0246527   -.0243453
   1.year_2010 |  -.0260162   .0000785  -331.38   0.000    -.0261701   -.0258624
   1.year_2011 |  -.0215828   .0000782  -275.96   0.000     -.021736   -.0214295
   1.year_2012 |  -.0220533   .0000778  -283.55   0.000    -.0222057   -.0219008
   1.year_2013 |  -.0186836   .0000774  -241.31   0.000    -.0188354   -.0185319
   1.year_2014 |  -.0132749   .0000773  -171.81   0.000    -.0134263   -.0131234
   1.year_2015 |  -.0186675   .0000773  -241.59   0.000    -.0188189    -.018516
   1.year_2016 |  -.0146726   .0000774  -189.66   0.000    -.0148243    -.014521
   1.year_2017 |  -.0062996   .0000775   -81.30   0.000    -.0064515   -.0061478
   1.year_2018 |  -.0096787   .0000775  -124.90   0.000    -.0098306   -.0095269
   1.year_2019 |          0  (omitted)
         _cons |   .7047585   .0000667  1.1e+04   0.000     .7046278    .7048892
--------------------------------------------------------------------------------

. outreg2 using "339t2.xls", ctitle("`x'") se 2aster append keep(post2009 treat treated3
> 5_2009) addtext(FE, YES)
339t2.xls
dir : seeout

. reg employed_rate2529 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  >  99999.00
       Model |  701.015992        28  25.0362854   Prob > F        =    0.0000
    Residual |  313.547546 1,683,469  .000186251   R-squared       =    0.6910
-------------+----------------------------------   Adj R-squared   =    0.6909
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01365

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0181341   .0000655   276.91   0.000     .0180058    .0182625
         treat |   .0223023   .0000434   513.74   0.000     .0222172    .0223874
treated35_2009 |  -.0277721   .0000443  -627.28   0.000    -.0278589   -.0276853
     1.prov_10 |  -.1028871   .0000961 -1070.91   0.000    -.1030754   -.1026988
     1.prov_11 |  -.0034991   .0001785   -19.60   0.000     -.003849   -.0031493
     1.prov_12 |  -.0197088   .0000733  -269.01   0.000    -.0198523   -.0195652
     1.prov_13 |   -.018286   .0000816  -224.05   0.000    -.0184459    -.018126
     1.prov_24 |   .0160881   .0000367   438.09   0.000     .0160161    .0161601
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0132145   .0000638   207.14   0.000     .0130894    .0133395
     1.prov_47 |   .0228521   .0000669   341.57   0.000      .022721    .0229833
     1.prov_48 |   .0255821   .0000415   616.19   0.000     .0255008    .0256635
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0161247   .0000671  -240.17   0.000    -.0162563   -.0159931
   1.year_2002 |  -.0206485    .000067  -308.04   0.000    -.0207799   -.0205172
   1.year_2003 |  -.0132785   .0000669  -198.39   0.000    -.0134097   -.0131473
   1.year_2004 |  -.0176934   .0000667  -265.15   0.000    -.0178242   -.0175626
   1.year_2005 |  -.0064508   .0000665   -96.96   0.000    -.0065812   -.0063204
   1.year_2006 |    .000043   .0000663     0.65   0.516    -.0000868    .0001729
   1.year_2007 |   .0011984   .0000659    18.18   0.000     .0010692    .0013276
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0328212   .0000627  -523.51   0.000    -.0329441   -.0326983
   1.year_2010 |  -.0265568   .0000626  -424.02   0.000    -.0266795    -.026434
   1.year_2011 |  -.0279175   .0000625  -446.51   0.000    -.0280401    -.027795
   1.year_2012 |  -.0182896   .0000624  -293.18   0.000    -.0184119   -.0181673
   1.year_2013 |  -.0258628   .0000623  -415.24   0.000    -.0259849   -.0257407
   1.year_2014 |  -.0263557   .0000621  -424.30   0.000    -.0264775    -.026234
   1.year_2015 |  -.0257377   .0000619  -415.78   0.000     -.025859   -.0256163
   1.year_2016 |  -.0219307   .0000616  -355.86   0.000    -.0220515   -.0218099
   1.year_2017 |  -.0128201   .0000613  -209.05   0.000    -.0129402   -.0126999
   1.year_2018 |   .0006843   .0000609    11.23   0.000     .0005648    .0008037
   1.year_2019 |          0  (omitted)
         _cons |   .7861669   .0000548  1.4e+04   0.000     .7860595    .7862744
--------------------------------------------------------------------------------

. outreg2 using "339t2.xls", ctitle("`x'") se 2aster append keep(post2009 treat treated3
> 5_2009) addtext(FE, YES)
339t2.xls
dir : seeout

. * Alterta as the treatment group 
. drop treat 

. gen treat = (prov == 48)

. gen treated48_2015 = treat * post2015
post2015 not found
r(111);

end of do-file

r(111);

. gen post2015 = (survyear >= 2015)

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. gen treated48_2015 = treat * post2015

. 
. reg employed_rate1519 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  >  99999.00
       Model |  2180.41808        28  77.8720741   Prob > F        =    0.0000
    Residual |  1321.53489 1,857,925  .000711296   R-squared       =    0.6226
-------------+----------------------------------   Adj R-squared   =    0.6226
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02667

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0276941   .0001235   224.20   0.000      .027452    .0279362
         treat |   .0719679   .0000878   819.96   0.000     .0717958    .0721399
treated48_2015 |  -.0935957   .0001409  -664.30   0.000    -.0938718   -.0933195
     1.prov_10 |  -.1136892   .0001692  -672.11   0.000    -.1140207   -.1133576
     1.prov_11 |   .0391164   .0002955   132.38   0.000     .0385372    .0396955
     1.prov_12 |  -.0272896   .0001304  -209.22   0.000    -.0275452   -.0270339
     1.prov_13 |  -.0054253   .0001443   -37.60   0.000    -.0057081   -.0051425
     1.prov_24 |   .0207732   .0000687   302.44   0.000     .0206386    .0209078
     1.prov_35 |  -.0017905   .0000625   -28.66   0.000    -.0019129   -.0016681
     1.prov_46 |   .0381175   .0001145   332.94   0.000     .0378931    .0383419
     1.prov_47 |   .0495746   .0001218   407.04   0.000     .0493359    .0498134
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0184878   .0001215   152.22   0.000     .0182497    .0187258
   1.year_2002 |   .0305693   .0001213   252.00   0.000     .0303316    .0308071
   1.year_2003 |   .0333769   .0001212   275.29   0.000     .0331392    .0336145
   1.year_2004 |   .0294711    .000121   243.51   0.000     .0292338    .0297083
   1.year_2005 |   .0328752   .0001206   272.59   0.000     .0326388    .0331115
   1.year_2006 |   .0377805   .0001202   314.42   0.000      .037545     .038016
   1.year_2007 |   .0565337   .0001198   471.80   0.000     .0562988    .0567686
   1.year_2008 |   .0604987   .0001196   505.86   0.000     .0602643    .0607331
   1.year_2009 |   .0169721   .0001197   141.83   0.000     .0167376    .0172066
   1.year_2010 |  -.0004639   .0001197    -3.88   0.000    -.0006984   -.0002293
   1.year_2011 |   .0027255   .0001198    22.74   0.000     .0024906    .0029603
   1.year_2012 |  -.0054445   .0001202   -45.30   0.000      -.00568   -.0052089
   1.year_2013 |  -.0108783   .0001207   -90.16   0.000    -.0111147   -.0106418
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0148807    .000123  -120.97   0.000    -.0151218   -.0146396
   1.year_2016 |  -.0184873   .0001235  -149.66   0.000    -.0187294   -.0182452
   1.year_2017 |  -.0089933   .0001238   -72.63   0.000     -.009236   -.0087506
   1.year_2018 |   .0009041   .0001238     7.30   0.000     .0006614    .0011467
   1.year_2019 |          0  (omitted)
         _cons |   .4080532   .0000997  4093.90   0.000     .4078579    .4082486
--------------------------------------------------------------------------------

. outreg2 using "339t3.xls", ctitle("`x'") se 2aster replace keep(post2015 treat treated
> 48_2015) addtext(FE, YES)
339t3.xls
dir : seeout

. reg employed_rate2024 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |  1973.17738        28  70.4706208   Prob > F        =    0.0000
    Residual |  453.133357 1,718,009  .000263755   R-squared       =    0.8132
-------------+----------------------------------   Adj R-squared   =    0.8132
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01624

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0193014   .0000751   257.10   0.000     .0191543    .0194486
         treat |   .0640369   .0000551  1162.59   0.000     .0639289    .0641448
treated48_2015 |  -.0543779   .0000863  -630.24   0.000    -.0545471   -.0542088
     1.prov_10 |  -.1322744   .0001104 -1197.67   0.000    -.1324909   -.1320579
     1.prov_11 |  -.0140112    .000196   -71.48   0.000    -.0143953    -.013627
     1.prov_12 |  -.0384239   .0000834  -460.47   0.000    -.0385874   -.0382603
     1.prov_13 |  -.0476907   .0000939  -507.90   0.000    -.0478748   -.0475067
     1.prov_24 |    .015952   .0000431   369.94   0.000     .0158675    .0160365
     1.prov_35 |  -.0224443   .0000395  -568.77   0.000    -.0225217    -.022367
     1.prov_46 |   .0383832   .0000741   518.15   0.000      .038238    .0385284
     1.prov_47 |   .0299166   .0000784   381.65   0.000      .029763    .0300703
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0010994   .0000773    14.23   0.000     .0009479    .0012508
   1.year_2002 |   .0060727    .000077    78.90   0.000     .0059218    .0062235
   1.year_2003 |   .0113701   .0000767   148.33   0.000     .0112198    .0115203
   1.year_2004 |   .0098616   .0000763   129.17   0.000     .0097119    .0100112
   1.year_2005 |    .011788   .0000761   154.91   0.000     .0116389    .0119372
   1.year_2006 |   .0220001   .0000759   289.80   0.000     .0218513    .0221489
   1.year_2007 |   .0303523   .0000757   400.73   0.000     .0302038    .0305007
   1.year_2008 |   .0228829   .0000756   302.71   0.000     .0227347     .023031
   1.year_2009 |   -.011255   .0000754  -149.34   0.000    -.0114027   -.0111073
   1.year_2010 |  -.0127184   .0000754  -168.57   0.000    -.0128662   -.0125705
   1.year_2011 |  -.0082612   .0000752  -109.92   0.000    -.0084085   -.0081139
   1.year_2012 |  -.0087361   .0000747  -116.89   0.000    -.0088826   -.0085897
   1.year_2013 |  -.0053851   .0000744   -72.38   0.000    -.0055309   -.0052392
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0182384   .0000744  -245.07   0.000    -.0183843   -.0180926
   1.year_2016 |  -.0143233   .0000745  -192.22   0.000    -.0144693   -.0141772
   1.year_2017 |  -.0060591   .0000746   -81.19   0.000    -.0062054   -.0059129
   1.year_2018 |  -.0095737   .0000746  -128.27   0.000      -.00972   -.0094274
   1.year_2019 |          0  (omitted)
         _cons |   .6864357   .0000615  1.1e+04   0.000     .6863151    .6865563
--------------------------------------------------------------------------------

. outreg2 using "339t3.xls", ctitle("`x'") se 2aster append keep(post2015 treat treated4
> 8_2015) addtext(FE, YES)
339t3.xls
dir : seeout

. reg employed_rate2529 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  >  99999.00
       Model |  682.442025        28  24.3729295   Prob > F        =    0.0000
    Residual |  332.121513 1,683,469  .000197284   R-squared       =    0.6726
-------------+----------------------------------   Adj R-squared   =    0.6726
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01405

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0309626   .0000646   479.39   0.000      .030836    .0310891
         treat |   .0369746   .0000476   776.12   0.000     .0368812    .0370679
treated48_2015 |  -.0372352   .0000707  -526.62   0.000    -.0373738   -.0370966
     1.prov_10 |   -.103184   .0000989 -1043.55   0.000    -.1033778   -.1029902
     1.prov_11 |  -.0037913   .0001837   -20.64   0.000    -.0041514   -.0034312
     1.prov_12 |  -.0199823   .0000754  -265.01   0.000    -.0201301   -.0198345
     1.prov_13 |   -.018734    .000084  -223.04   0.000    -.0188986   -.0185693
     1.prov_24 |   .0158745   .0000378   420.04   0.000     .0158005    .0159486
     1.prov_35 |   .0052054   .0000348   149.38   0.000     .0051371    .0052737
     1.prov_46 |   .0131609   .0000657   200.45   0.000     .0130322    .0132896
     1.prov_47 |   .0230283   .0000689   334.44   0.000     .0228934    .0231633
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0033202   .0000681    48.73   0.000     .0031867    .0034538
   1.year_2002 |  -.0012278    .000068   -18.05   0.000    -.0013611   -.0010944
   1.year_2003 |   .0060906   .0000679    89.67   0.000     .0059575    .0062238
   1.year_2004 |   .0016234   .0000677    23.97   0.000     .0014906    .0017561
   1.year_2005 |   .0127939   .0000675   189.53   0.000     .0126616    .0129262
   1.year_2006 |   .0192045   .0000672   285.71   0.000     .0190727    .0193362
   1.year_2007 |   .0203041   .0000669   303.70   0.000     .0201731    .0204352
   1.year_2008 |   .0190787   .0000664   287.22   0.000     .0189485    .0192089
   1.year_2009 |  -.0063168    .000066   -95.71   0.000    -.0064462   -.0061874
   1.year_2010 |   -.000037   .0000659    -0.56   0.575    -.0001662    .0000922
   1.year_2011 |  -.0014306   .0000658   -21.73   0.000    -.0015596   -.0013016
   1.year_2012 |   .0081461   .0000657   124.02   0.000     .0080173    .0082748
   1.year_2013 |   .0005307   .0000656     8.09   0.000     .0004022    .0006593
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0250977   .0000637  -393.92   0.000    -.0252226   -.0249728
   1.year_2016 |  -.0213992   .0000634  -337.37   0.000    -.0215235   -.0212749
   1.year_2017 |  -.0124507   .0000631  -197.26   0.000    -.0125744    -.012327
   1.year_2018 |   .0008532   .0000627    13.61   0.000     .0007302    .0009761
   1.year_2019 |          0  (omitted)
         _cons |   .7722618   .0000543  1.4e+04   0.000     .7721555    .7723682
--------------------------------------------------------------------------------

. outreg2 using "339t3.xls", ctitle("`x'") se 2aster append keep(post2015 treat treated4
> 8_2015) addtext(FE, YES)
339t3.xls
dir : seeout

. * BC as the treatment group
. drop treat 

. gen treat = (prov == 59)

. gen treated59_2012 = treat * post2012

. 
. reg employed_rate1519 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  76245.04
       Model |  1872.42263        28  66.8722369   Prob > F        =    0.0000
    Residual |  1629.53033 1,857,925   .00087707   R-squared       =    0.5347
-------------+----------------------------------   Adj R-squared   =    0.5347
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02962

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0126384   .0001354    93.33   0.000      .012373    .0129039
         treat |  -.0519659    .000104  -499.91   0.000    -.0521697   -.0517622
treated59_2012 |   .0107604   .0001313    81.96   0.000     .0105031    .0110177
     1.prov_10 |  -.1616219   .0001893  -853.83   0.000    -.1619929   -.1612509
     1.prov_11 |   -.008627    .000329   -26.23   0.000    -.0092718   -.0079823
     1.prov_12 |  -.0750952   .0001467  -511.83   0.000    -.0753828   -.0748077
     1.prov_13 |  -.0532286   .0001619  -328.72   0.000     -.053546   -.0529113
     1.prov_24 |  -.0269394   .0000798  -337.67   0.000    -.0270958   -.0267831
     1.prov_35 |  -.0492898   .0000732  -673.35   0.000    -.0494333   -.0491464
     1.prov_46 |  -.0093344   .0001293   -72.21   0.000    -.0095877    -.009081
     1.prov_47 |   .0019511   .0001373    14.22   0.000     .0016821    .0022201
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0157279   .0001333   118.02   0.000     .0154667    .0159891
   1.year_2002 |   .0278472   .0001331   209.22   0.000     .0275863     .028108
   1.year_2003 |   .0306751    .000133   230.59   0.000     .0304144    .0309358
   1.year_2004 |   .0267845   .0001328   201.71   0.000     .0265243    .0270448
   1.year_2005 |   .0302077   .0001323   228.30   0.000     .0299484     .030467
   1.year_2006 |   .0351141   .0001318   266.39   0.000     .0348558    .0353725
   1.year_2007 |    .053843   .0001314   409.65   0.000     .0535854    .0541006
   1.year_2008 |   .0577832   .0001312   440.49   0.000     .0575261    .0580403
   1.year_2009 |    .014234   .0001313   108.44   0.000     .0139768    .0144913
   1.year_2010 |   -.003206   .0001313   -24.42   0.000    -.0034633   -.0029487
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0221606   .0001347  -164.51   0.000    -.0224246   -.0218965
   1.year_2013 |  -.0275631   .0001352  -203.82   0.000    -.0278281    -.027298
   1.year_2014 |  -.0166398   .0001359  -122.43   0.000    -.0169062   -.0163734
   1.year_2015 |  -.0147154   .0001366  -107.73   0.000    -.0149832   -.0144477
   1.year_2016 |  -.0183878   .0001372  -134.05   0.000    -.0186567    -.018119
   1.year_2017 |  -.0089281   .0001375   -64.93   0.000    -.0091976   -.0086586
   1.year_2018 |   .0009381   .0001375     6.82   0.000     .0006686    .0012075
   1.year_2019 |          0  (omitted)
         _cons |   .4616143   .0001115  4141.12   0.000     .4613958    .4618328
--------------------------------------------------------------------------------

. outreg2 using "339t4.xls", ctitle("`x'") se 2aster replace keep(post2012 treat treated
> 59_2012) addtext(FE, YES)
339t4.xls
dir : seeout

. reg employed_rate2024 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 516,809,590)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,718,038
-------------+----------------------------------   F(28, 1718009)  >  99999.00
       Model |  1886.94278        28  67.3908136   Prob > F        =    0.0000
    Residual |  539.367958 1,718,009  .000313949   R-squared       =    0.7777
-------------+----------------------------------   Adj R-squared   =    0.7777
       Total |  2426.31074 1,718,037  .001412258   Root MSE        =    .01772

--------------------------------------------------------------------------------
employed_~2024 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0187036   .0000829   225.67   0.000     .0185411     .018866
         treat |  -.0578258    .000065  -889.59   0.000    -.0579532   -.0576984
treated59_2012 |    .019582   .0000806   242.95   0.000     .0194241      .01974
     1.prov_10 |  -.1818189   .0001212 -1500.72   0.000    -.1820564   -.1815814
     1.prov_11 |   -.063256   .0002142  -295.28   0.000    -.0636759   -.0628361
     1.prov_12 |  -.0877661   .0000919  -954.91   0.000    -.0879463    -.087586
     1.prov_13 |  -.0971544   .0001032  -941.24   0.000    -.0973567   -.0969521
     1.prov_24 |  -.0333129   .0000487  -683.89   0.000    -.0334084   -.0332174
     1.prov_35 |  -.0715249   .0000449 -1594.10   0.000    -.0716129    -.071437
     1.prov_46 |  -.0107349   .0000818  -131.23   0.000    -.0108952   -.0105746
     1.prov_47 |  -.0193453   .0000864  -223.78   0.000    -.0195148   -.0191759
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0091991   .0000852   107.91   0.000      .009032    .0093662
   1.year_2002 |    .014204   .0000849   167.25   0.000     .0140375    .0143704
   1.year_2003 |   .0195222   .0000846   230.79   0.000     .0193564     .019688
   1.year_2004 |   .0180369   .0000843   214.06   0.000     .0178717     .018202
   1.year_2005 |   .0200136    .000084   238.28   0.000      .019849    .0201782
   1.year_2006 |   .0302982   .0000838   361.58   0.000      .030134    .0304625
   1.year_2007 |   .0387078   .0000836   462.95   0.000      .038544    .0388717
   1.year_2008 |   .0312668   .0000834   374.68   0.000     .0311033    .0314304
   1.year_2009 |  -.0028664   .0000832   -34.45   0.000    -.0030295   -.0027033
   1.year_2010 |  -.0043975   .0000833   -52.80   0.000    -.0045607   -.0042342
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0217077   .0000817  -265.61   0.000    -.0218678   -.0215475
   1.year_2013 |  -.0183528   .0000814  -225.57   0.000    -.0185122   -.0181933
   1.year_2014 |  -.0129704   .0000812  -159.75   0.000    -.0131295   -.0128113
   1.year_2015 |  -.0184156   .0000812  -226.81   0.000    -.0185747   -.0182564
   1.year_2016 |  -.0144774   .0000813  -178.08   0.000    -.0146368   -.0143181
   1.year_2017 |  -.0061621   .0000814   -75.68   0.000    -.0063216   -.0060025
   1.year_2018 |    -.00961   .0000814  -118.01   0.000    -.0097696   -.0094504
   1.year_2019 |          0  (omitted)
         _cons |   .7302389   .0000695  1.1e+04   0.000     .7301028    .7303751
--------------------------------------------------------------------------------

. outreg2 using "339t4.xls", ctitle("`x'") se 2aster append keep(post2012 treat treated5
> 9_2012) addtext(FE, YES)
339t4.xls
dir : seeout

. reg employed_rate2529 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 518,555,002)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,683,498
-------------+----------------------------------   F(28, 1683469)  >  99999.00
       Model |  654.105608        28  23.3609146   Prob > F        =    0.0000
    Residual |   360.45793 1,683,469  .000214116   R-squared       =    0.6447
-------------+----------------------------------   Adj R-squared   =    0.6447
       Total |  1014.56354 1,683,497  .000602652   Root MSE        =    .01463

--------------------------------------------------------------------------------
employed_~2529 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0245037   .0000676   362.38   0.000     .0243712    .0246363
         treat |  -.0366486   .0000541  -677.84   0.000    -.0367546   -.0365426
treated59_2012 |   .0237981   .0000678   350.98   0.000     .0236652     .023931
     1.prov_10 |   -.129337    .000103 -1255.61   0.000    -.1295388   -.1291351
     1.prov_11 |  -.0298164   .0001914  -155.78   0.000    -.0301916   -.0294413
     1.prov_12 |  -.0460097   .0000785  -585.76   0.000    -.0461636   -.0458557
     1.prov_13 |  -.0449966   .0000875  -514.21   0.000    -.0451681    -.044825
     1.prov_24 |  -.0101655   .0000394  -258.28   0.000    -.0102427   -.0100884
     1.prov_35 |  -.0206753   .0000363  -569.87   0.000    -.0207464   -.0206042
     1.prov_46 |  -.0127097   .0000684  -185.85   0.000    -.0128438   -.0125757
     1.prov_47 |  -.0027373   .0000717   -38.17   0.000    -.0028779   -.0025968
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0044326   .0000714    62.09   0.000     .0042927    .0045725
   1.year_2002 |  -.0001236   .0000713    -1.73   0.083    -.0002633    .0000161
   1.year_2003 |   .0071897   .0000712   101.03   0.000     .0070502    .0073292
   1.year_2004 |   .0027285    .000071    38.46   0.000     .0025894    .0028675
   1.year_2005 |   .0139298   .0000707   196.94   0.000     .0137912    .0140684
   1.year_2006 |   .0203944   .0000704   289.54   0.000     .0202564    .0205325
   1.year_2007 |   .0215552   .0000701   307.66   0.000     .0214179    .0216926
   1.year_2008 |   .0203887   .0000696   292.86   0.000     .0202522    .0205251
   1.year_2009 |  -.0049469   .0000692   -71.51   0.000    -.0050825   -.0048113
   1.year_2010 |   .0013938   .0000691    20.17   0.000     .0012584    .0015293
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0180741   .0000669  -270.22   0.000    -.0182052    -.017943
   1.year_2013 |  -.0256341   .0000668  -383.86   0.000     -.025765   -.0255032
   1.year_2014 |  -.0261197   .0000666  -392.19   0.000    -.0262502   -.0259891
   1.year_2015 |  -.0255003   .0000664  -384.21   0.000    -.0256304   -.0253702
   1.year_2016 |  -.0217161   .0000661  -328.65   0.000    -.0218456   -.0215866
   1.year_2017 |  -.0126584   .0000658  -192.51   0.000    -.0127873   -.0125295
   1.year_2018 |   .0007648   .0000653    11.71   0.000     .0006368    .0008929
   1.year_2019 |          0  (omitted)
         _cons |   .7997049    .000057  1.4e+04   0.000     .7995932    .7998166
--------------------------------------------------------------------------------

. outreg2 using "339t4.xls", ctitle("`x'") se 2aster append keep(post2012 treat treated5
> 9_2012) addtext(FE, YES)
339t4.xls
dir : seeout

. 
end of do-file

. reg employed_rate1519 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5347
                                                Root MSE          =     .02962

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0126384   .0215246     0.59   0.572    -.0360536    .0613305
         treat |  -.0519659   .0084279    -6.17   0.000    -.0710311   -.0329008
treated59_2012 |   .0107604   .0197505     0.54   0.599    -.0339183    .0554391
     1.prov_10 |  -.1616219    .001773   -91.16   0.000    -.1656328   -.1576111
     1.prov_11 |   -.008627   .0008288   -10.41   0.000     -.010502   -.0067521
     1.prov_12 |  -.0750952    .001101   -68.21   0.000    -.0775859   -.0726046
     1.prov_13 |  -.0532286   .0011136   -47.80   0.000    -.0557478   -.0507094
     1.prov_24 |  -.0269394   .0005028   -53.58   0.000    -.0280769    -.025802
     1.prov_35 |  -.0492898   .0000899  -548.21   0.000    -.0494932   -.0490864
     1.prov_46 |  -.0093344   .0000807  -115.70   0.000    -.0095169   -.0091519
     1.prov_47 |   .0019511   .0007635     2.56   0.031     .0002239    .0036783
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0157279    .034905     0.45   0.663    -.0632327    .0946886
   1.year_2002 |   .0278472   .0256677     1.08   0.306    -.0302172    .0859115
   1.year_2003 |   .0306751   .0210546     1.46   0.179    -.0169538     .078304
   1.year_2004 |   .0267845   .0221339     1.21   0.257    -.0232859     .076855
   1.year_2005 |   .0302077   .0196924     1.53   0.159    -.0143397    .0747551
   1.year_2006 |   .0351141   .0186377     1.88   0.092    -.0070474    .0772756
   1.year_2007 |    .053843   .0180668     2.98   0.015      .012973     .094713
   1.year_2008 |   .0577832    .008571     6.74   0.000     .0383942    .0771721
   1.year_2009 |    .014234   .0064919     2.19   0.056    -.0004517    .0289198
   1.year_2010 |   -.003206   .0037608    -0.85   0.416    -.0117135    .0053016
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0221606     .01879    -1.18   0.268    -.0646666    .0203455
   1.year_2013 |  -.0275631    .018686    -1.48   0.174    -.0698337    .0147076
   1.year_2014 |  -.0166398   .0202631    -0.82   0.433    -.0624781    .0291985
   1.year_2015 |  -.0147154   .0168409    -0.87   0.405    -.0528123    .0233814
   1.year_2016 |  -.0183878   .0177137    -1.04   0.326    -.0584591    .0216834
   1.year_2017 |  -.0089281   .0160768    -0.56   0.592    -.0452965    .0274402
   1.year_2018 |   .0009381   .0088935     0.11   0.918    -.0191805    .0210566
   1.year_2019 |          0  (omitted)
         _cons |   .4616143   .0085061    54.27   0.000     .4423722    .4808565
--------------------------------------------------------------------------------

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Cluster the data at the prov level, account for province-level fixed effects and are
>  robust to within-province correlation in the error terms.
. * Quebec as the treatment group
. drop treat

. gen treat = (prov == 24)

. drop treated24_2011 = treat * post2011 
=exp not allowed
r(101);

end of do-file

r(101);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. * Cluster the data at the prov level, account for province-level fixed effects and are
>  robust to within-province correlation in the error terms.
. * Quebec as the treatment group
. drop treat

. gen treat = (prov == 24)

. drop treated24_2011  

. gen treated24_2011 = treat * post2011 

. 
. reg employed_rate1519 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6899
                                                Root MSE          =     .02418

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |  -.0007327   .0143397    -0.05   0.960    -.0331713    .0317059
         treat |  -.0176979   .0035994    -4.92   0.001    -.0258404   -.0095554
treated24_2011 |   .0837904   .0075003    11.17   0.000     .0668236    .1007572
     1.prov_10 |  -.1149835    .000738  -155.81   0.000    -.1166529   -.1133142
     1.prov_11 |   .0384864   .0002838   135.62   0.000     .0378444    .0391284
     1.prov_12 |   -.028163    .000378   -74.50   0.000    -.0290182   -.0273078
     1.prov_13 |  -.0062697   .0004005   -15.65   0.000    -.0071757   -.0053638
     1.prov_24 |          0  (omitted)
     1.prov_35 |  -.0017224   .0001411   -12.20   0.000    -.0020416   -.0014031
     1.prov_46 |   .0382367   .0000934   409.57   0.000     .0380255    .0384479
     1.prov_47 |   .0491605   .0002528   194.43   0.000     .0485885    .0497325
     1.prov_48 |   .0476166   .0001328   358.44   0.000     .0473161    .0479171
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0187554   .0364236     0.51   0.619    -.0636404    .1011512
   1.year_2002 |    .030718   .0271665     1.13   0.287     -.030737    .0921729
   1.year_2003 |   .0334594   .0230239     1.45   0.180    -.0186244    .0855431
   1.year_2004 |    .029521   .0239632     1.23   0.249    -.0246875    .0837295
   1.year_2005 |     .03296   .0213118     1.55   0.156    -.0152506    .0811706
   1.year_2006 |   .0379547   .0201192     1.89   0.092    -.0075581    .0834674
   1.year_2007 |   .0568261    .018777     3.03   0.014     .0143497    .0993025
   1.year_2008 |   .0608832   .0088482     6.88   0.000     .0408672    .0808991
   1.year_2009 |   .0173997   .0068249     2.55   0.031     .0019608    .0328387
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0149776   .0196913    -0.76   0.466    -.0595224    .0295672
   1.year_2012 |  -.0229522   .0190251    -1.21   0.258      -.06599    .0200856
   1.year_2013 |  -.0281655   .0189036    -1.49   0.170    -.0709283    .0145974
   1.year_2014 |   -.017081   .0204626    -0.83   0.425    -.0633706    .0292086
   1.year_2015 |  -.0150267   .0169885    -0.88   0.399    -.0534574    .0234041
   1.year_2016 |  -.0185825   .0178402    -1.04   0.325    -.0589398    .0217748
   1.year_2017 |  -.0090406   .0161457    -0.56   0.589    -.0455646    .0274835
   1.year_2018 |   .0008986   .0089153     0.10   0.922    -.0192692    .0210664
   1.year_2019 |          0  (omitted)
         _cons |   .4190647   .0178526    23.47   0.000     .3786793    .4594501
--------------------------------------------------------------------------------

. outreg2 using "339t5.xls", ctitle("`x'") se 2aster replace keep(post2011 treat treated
> 24_2011) addtext(FE, YES)
339t5.xls
dir : seeout

. reg employed_rate2024 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 516,809,590)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,718,038
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8055
                                                Root MSE          =     .01657

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2024 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0184914   .0071839     2.57   0.030     .0022404    .0347424
         treat |  -.0007362   .0032856    -0.22   0.828    -.0081686    .0066962
treated24_2011 |   .0340068   .0062243     5.46   0.000     .0199264    .0480871
     1.prov_10 |  -.1329494   .0006265  -212.22   0.000    -.1343666   -.1315323
     1.prov_11 |  -.0141917   .0001929   -73.55   0.000    -.0146282   -.0137553
     1.prov_12 |  -.0387493   .0002938  -131.89   0.000     -.039414   -.0380847
     1.prov_13 |  -.0482406    .000505   -95.53   0.000    -.0493829   -.0470984
     1.prov_24 |          0  (omitted)
     1.prov_35 |  -.0223564    .000056  -399.09   0.000    -.0224831   -.0222297
     1.prov_46 |   .0383979   .0000312  1232.05   0.000     .0383274    .0384684
     1.prov_47 |   .0297374   .0001979   150.30   0.000     .0292898     .030185
     1.prov_48 |   .0491193   .0001056   465.14   0.000     .0488804    .0493582
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0140739   .0139876     1.01   0.341    -.0175683    .0457162
   1.year_2002 |   .0190192   .0143065     1.33   0.216    -.0133443    .0513827
   1.year_2003 |   .0242492   .0138458     1.75   0.114    -.0070722    .0555706
   1.year_2004 |   .0226757   .0110794     2.05   0.071    -.0023877    .0477392
   1.year_2005 |   .0245547   .0071688     3.43   0.008     .0083377    .0407716
   1.year_2006 |    .034747   .0084655     4.10   0.003     .0155966    .0538973
   1.year_2007 |   .0430531   .0064142     6.71   0.000     .0285433     .057563
   1.year_2008 |   .0355392   .0068113     5.22   0.001     .0201309    .0509475
   1.year_2009 |   .0013573   .0023134     0.59   0.572    -.0038759    .0065904
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0216222   .0102662    -2.11   0.064    -.0448461    .0016016
   1.year_2012 |  -.0221378   .0098055    -2.26   0.050    -.0443193    .0000437
   1.year_2013 |  -.0187874   .0081113    -2.32   0.046    -.0371365   -.0004383
   1.year_2014 |  -.0133772   .0089022    -1.50   0.167    -.0335153    .0067609
   1.year_2015 |  -.0187498   .0077757    -2.41   0.039    -.0363398   -.0011599
   1.year_2016 |  -.0147291   .0066193    -2.23   0.053     -.029703    .0002449
   1.year_2017 |  -.0063311   .0121223    -0.52   0.614    -.0337536    .0210915
   1.year_2018 |  -.0097005   .0028178    -3.44   0.007    -.0160749   -.0033261
   1.year_2019 |          0  (omitted)
         _cons |   .6792147   .0064049   106.05   0.000     .6647259    .6937036
--------------------------------------------------------------------------------

. outreg2 using "339t5.xls", ctitle("`x'") se 2aster append keep(post2011 treat treated2
> 4_2011) addtext(FE, YES)
339t5.xls
dir : seeout

. reg employed_rate2529 post2011 treat treated24_2011 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 518,555,002)
note: 1.prov_24 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2010 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,683,498
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6747
                                                Root MSE          =       .014

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2529 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2011 |   .0200558    .006701     2.99   0.015     .0048971    .0352145
         treat |   .0022583   .0030596     0.74   0.479    -.0046629    .0091795
treated24_2011 |   .0277032   .0060133     4.61   0.001     .0141001    .0413062
     1.prov_10 |  -.1034859   .0004236  -244.33   0.000    -.1044441   -.1025278
     1.prov_11 |  -.0039379   .0002535   -15.53   0.000    -.0045114   -.0033644
     1.prov_12 |  -.0201294   .0002914   -69.09   0.000    -.0207885   -.0194703
     1.prov_13 |  -.0192179   .0005473   -35.11   0.000     -.020456   -.0179798
     1.prov_24 |          0  (omitted)
     1.prov_35 |   .0052832     .00008    66.08   0.000     .0051024    .0054641
     1.prov_46 |   .0132599   .0000768   172.61   0.000     .0130861    .0134337
     1.prov_47 |   .0233226   .0001959   119.07   0.000     .0228795    .0237657
     1.prov_48 |   .0260503   .0002553   102.04   0.000     .0254727    .0266278
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0031223   .0180364     0.17   0.866     -.037679    .0439236
   1.year_2002 |  -.0013499   .0118832    -0.11   0.912    -.0282315    .0255316
   1.year_2003 |   .0060445    .013665     0.44   0.669    -.0248678    .0369568
   1.year_2004 |   .0016349   .0090441     0.18   0.861    -.0188242     .022094
   1.year_2005 |   .0128593   .0118143     1.09   0.305    -.0138664    .0395851
   1.year_2006 |   .0193122   .0069706     2.77   0.022     .0035436    .0350807
   1.year_2007 |   .0204089   .0052955     3.85   0.004     .0084297    .0323881
   1.year_2008 |   .0191487   .0048496     3.95   0.003     .0081782    .0301192
   1.year_2009 |   -.006287    .004351    -1.44   0.182    -.0161296    .0035556
   1.year_2010 |          0  (omitted)
   1.year_2011 |  -.0277053   .0079611    -3.48   0.007    -.0457147    -.009696
   1.year_2012 |  -.0180651   .0081706    -2.21   0.054    -.0365482     .000418
   1.year_2013 |  -.0256309    .008894    -2.88   0.018    -.0457506   -.0055112
   1.year_2014 |   -.026119   .0097136    -2.69   0.025    -.0480926   -.0041454
   1.year_2015 |  -.0255182   .0067251    -3.79   0.004    -.0407315   -.0103049
   1.year_2016 |  -.0217598   .0057795    -3.77   0.004    -.0348339   -.0086857
   1.year_2017 |   -.012712   .0046966    -2.71   0.024    -.0233363   -.0020876
   1.year_2018 |   .0007277   .0036682     0.20   0.847    -.0075703    .0090257
   1.year_2019 |          0  (omitted)
         _cons |   .7767784   .0062448   124.39   0.000     .7626516    .7909052
--------------------------------------------------------------------------------

. outreg2 using "339t5.xls", ctitle("`x'") se 2aster append keep(post2011 treat treated2
> 4_2011) addtext(FE, YES)
339t5.xls
dir : seeout

. * Ontario as the treatment group
. drop treat 

. gen treat = (prov == 35)

. drop treated35_2009 

. gen treated35_2009 = treat * post2009

. 
. reg employed_rate1519 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ]
(sum of wgt is 478,553,506)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   = 1,857,954
-------------+----------------------------------   F(28, 1857925)  =  92119.43
       Model |  2035.65334        28  72.7019049   Prob > F        =    0.0000
    Residual |  1466.29963 1,857,925  .000789214   R-squared       =    0.5813
-------------+----------------------------------   Adj R-squared   =    0.5813
       Total |  3501.95297 1,857,953  .001884845   Root MSE        =    .02809

--------------------------------------------------------------------------------
employed_~1519 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0277859   .0001318  -210.88   0.000    -.0280441   -.0275276
         treat |   .0210237   .0000822   255.73   0.000     .0208626    .0211848
treated35_2009 |  -.0393863   .0000851  -462.92   0.000    -.0395531   -.0392195
     1.prov_10 |  -.1132041   .0001782  -635.32   0.000    -.1135533   -.1128549
     1.prov_11 |   .0392373   .0003113   126.06   0.000     .0386273    .0398474
     1.prov_12 |  -.0270384   .0001374  -196.79   0.000    -.0273077   -.0267691
     1.prov_13 |  -.0051941    .000152   -34.17   0.000     -.005492   -.0048962
     1.prov_24 |   .0206923   .0000723   286.01   0.000     .0205505    .0208341
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0380828   .0001206   315.79   0.000     .0378464    .0383192
     1.prov_47 |   .0497727   .0001283   387.96   0.000     .0495212    .0500241
     1.prov_48 |    .047386   .0000839   564.71   0.000     .0472215    .0475504
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0417727   .0001262  -331.12   0.000      -.04202   -.0415254
   1.year_2002 |  -.0297678    .000126  -236.26   0.000    -.0300148   -.0295209
   1.year_2003 |  -.0270282   .0001259  -214.63   0.000     -.027275   -.0267814
   1.year_2004 |  -.0309901   .0001257  -246.54   0.000    -.0312364   -.0307437
   1.year_2005 |  -.0275981   .0001252  -220.34   0.000    -.0278435   -.0273526
   1.year_2006 |  -.0226982   .0001248  -181.91   0.000    -.0229427   -.0224536
   1.year_2007 |  -.0039488   .0001244   -31.74   0.000    -.0041926   -.0037049
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0000514   .0001272    -0.40   0.686    -.0003008     .000198
   1.year_2010 |  -.0174053   .0001273  -136.77   0.000    -.0176547   -.0171559
   1.year_2011 |  -.0141582   .0001274  -111.11   0.000    -.0144079   -.0139084
   1.year_2012 |   -.022284   .0001278  -174.39   0.000    -.0225344   -.0220335
   1.year_2013 |  -.0276595   .0001283  -215.62   0.000    -.0279109   -.0274081
   1.year_2014 |  -.0167233   .0001289  -129.71   0.000     -.016976   -.0164706
   1.year_2015 |  -.0147974   .0001296  -114.20   0.000    -.0150513   -.0145434
   1.year_2016 |  -.0184634   .0001301  -141.90   0.000    -.0187184   -.0182083
   1.year_2017 |  -.0089864   .0001304   -68.90   0.000     -.009242   -.0087307
   1.year_2018 |   .0009109   .0001304     6.98   0.000     .0006553    .0011665
   1.year_2019 |          0  (omitted)
         _cons |   .4621616   .0001047  4414.11   0.000     .4619564    .4623668
--------------------------------------------------------------------------------

. outreg2 using "339t6.xls", ctitle("`x'") se 2aster replace keep(post2009 treat treated
> 35_2009) addtext(FE, YES), cluster(prov)
invalid 'cluster' 
r(198);

end of do-file

r(198);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate1519 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5813
                                                Root MSE          =     .02809

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |  -.0277859   .0361495    -0.77   0.462    -.1095616    .0539899
         treat |   .0210237   .0154446     1.36   0.207    -.0139143    .0559617
treated35_2009 |  -.0393863   .0268502    -1.47   0.176    -.1001256     .021353
     1.prov_10 |  -.1132041   .0016758   -67.55   0.000     -.116995   -.1094132
     1.prov_11 |   .0392373   .0006798    57.72   0.000     .0376995    .0407751
     1.prov_12 |  -.0270384   .0009961   -27.14   0.000    -.0292918   -.0247851
     1.prov_13 |  -.0051941   .0009806    -5.30   0.000    -.0074123   -.0029759
     1.prov_24 |   .0206923   .0003352    61.74   0.000     .0199341    .0214504
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0380828   .0001702   223.76   0.000     .0376978    .0384678
     1.prov_47 |   .0497727   .0005661    87.92   0.000      .048492    .0510534
     1.prov_48 |    .047386   .0002508   188.97   0.000     .0468187    .0479532
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0417727     .03092    -1.35   0.210    -.1117185    .0281731
   1.year_2002 |  -.0297678   .0223442    -1.33   0.216    -.0803139    .0207783
   1.year_2003 |  -.0270282    .018929    -1.43   0.187    -.0698486    .0157921
   1.year_2004 |  -.0309901     .01874    -1.65   0.133    -.0733828    .0114027
   1.year_2005 |  -.0275981   .0147368    -1.87   0.094     -.060935    .0057389
   1.year_2006 |  -.0226982   .0127307    -1.78   0.108    -.0514969    .0061006
   1.year_2007 |  -.0039488   .0122441    -0.32   0.754    -.0316467    .0237492
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0000514   .0230759    -0.00   0.998    -.0522526    .0521499
   1.year_2010 |  -.0174053   .0175252    -0.99   0.347      -.05705    .0222395
   1.year_2011 |  -.0141582   .0195344    -0.72   0.487    -.0583481    .0300318
   1.year_2012 |   -.022284   .0189357    -1.18   0.269    -.0651196    .0205516
   1.year_2013 |  -.0276595   .0187999    -1.47   0.175    -.0701878    .0148688
   1.year_2014 |  -.0167233   .0203555    -0.82   0.433    -.0627707    .0293241
   1.year_2015 |  -.0147974    .016923    -0.87   0.405    -.0530799    .0234851
   1.year_2016 |  -.0184634   .0177781    -1.04   0.326    -.0586803    .0217535
   1.year_2017 |  -.0089864   .0161071    -0.56   0.591    -.0454232    .0274505
   1.year_2018 |   .0009109   .0089044     0.10   0.921    -.0192323     .021054
   1.year_2019 |          0  (omitted)
         _cons |   .4621616    .016357    28.25   0.000     .4251595    .4991637
--------------------------------------------------------------------------------

. outreg2 using "339t6.xls", ctitle("`x'") se 2aster replace keep(post2009 treat treated
> 35_2009) addtext(FE, YES)
339t6.xls
dir : seeout

. reg employed_rate2024 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 516,809,590)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,718,038
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7987
                                                Root MSE          =     .01686

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2024 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0008775    .016502     0.05   0.959    -.0364525    .0382076
         treat |  -.0062964   .0062122    -1.01   0.337    -.0203493    .0077566
treated35_2009 |   -.026566    .010318    -2.57   0.030    -.0499069    -.003225
     1.prov_10 |  -.1320272   .0007187  -183.70   0.000     -.133653   -.1304013
     1.prov_11 |  -.0139531   .0002072   -67.34   0.000    -.0144218   -.0134843
     1.prov_12 |  -.0383499   .0003469  -110.56   0.000    -.0391346   -.0375652
     1.prov_13 |  -.0474763   .0005896   -80.52   0.000    -.0488101   -.0461425
     1.prov_24 |    .016018   .0002883    55.56   0.000     .0153658    .0166702
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0383866   .0000267  1438.75   0.000     .0383263     .038447
     1.prov_47 |   .0299045   .0002118   141.17   0.000     .0294253    .0303837
     1.prov_48 |   .0491377   .0001081   454.65   0.000     .0488932    .0493822
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0216824   .0118048    -1.84   0.099    -.0483867     .005022
   1.year_2002 |  -.0167271   .0133023    -1.26   0.240    -.0468189    .0133647
   1.year_2003 |  -.0114802   .0133622    -0.86   0.413    -.0417077    .0187472
   1.year_2004 |  -.0130292   .0102291    -1.27   0.235    -.0361691    .0101108
   1.year_2005 |  -.0111215   .0040312    -2.76   0.022    -.0202408   -.0020023
   1.year_2006 |  -.0008858   .0034526    -0.26   0.803    -.0086961    .0069245
   1.year_2007 |   .0074722   .0012248     6.10   0.000     .0047015    .0102428
   1.year_2008 |          0  (omitted)
   1.year_2009 |   -.024499   .0103597    -2.36   0.042    -.0479342   -.0010638
   1.year_2010 |  -.0260162   .0088927    -2.93   0.017    -.0461329   -.0058996
   1.year_2011 |  -.0215828   .0102095    -2.11   0.064    -.0446782    .0015127
   1.year_2012 |  -.0220533   .0097651    -2.26   0.050    -.0441434    .0000369
   1.year_2013 |  -.0186836   .0080436    -2.32   0.045    -.0368795   -.0004878
   1.year_2014 |  -.0132749   .0088161    -1.51   0.166    -.0332183    .0066685
   1.year_2015 |  -.0186675   .0076814    -2.43   0.038    -.0360439    -.001291
   1.year_2016 |  -.0146726   .0065454    -2.24   0.052    -.0294794    .0001342
   1.year_2017 |  -.0062996    .012063    -0.52   0.614     -.033588    .0209887
   1.year_2018 |  -.0096787   .0027945    -3.46   0.007    -.0160004   -.0033571
   1.year_2019 |          0  (omitted)
         _cons |   .7047585   .0098555    71.51   0.000     .6824639    .7270531
--------------------------------------------------------------------------------

. outreg2 using "339t6.xls", ctitle("`x'") se 2aster append keep(post2009 treat treated3
> 5_2009) addtext(FE, YES)
339t6.xls
dir : seeout

. reg employed_rate2529 post2009 treat treated35_2009 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 518,555,002)
note: 1.prov_35 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2008 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,683,498
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6910
                                                Root MSE          =     .01365

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2529 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2009 |   .0181341   .0136578     1.33   0.217     -.012762    .0490302
         treat |   .0223023   .0044926     4.96   0.001     .0121395    .0324652
treated35_2009 |  -.0277721   .0074346    -3.74   0.005    -.0445904   -.0109538
     1.prov_10 |  -.1028871    .000384  -267.93   0.000    -.1037558   -.1020184
     1.prov_11 |  -.0034991   .0001639   -21.35   0.000    -.0038699   -.0031284
     1.prov_12 |  -.0197088    .000212   -92.96   0.000    -.0201884   -.0192291
     1.prov_13 |   -.018286    .000514   -35.58   0.000    -.0194487   -.0171233
     1.prov_24 |   .0160881   .0001397   115.14   0.000      .015772    .0164042
     1.prov_35 |          0  (omitted)
     1.prov_46 |   .0132145   .0000733   180.32   0.000     .0130487    .0133802
     1.prov_47 |   .0228521   .0002019   113.19   0.000     .0223954    .0233088
     1.prov_48 |   .0255821    .000215   118.99   0.000     .0250958    .0260685
     1.prov_59 |          0  (omitted)
   1.year_2001 |  -.0161247   .0152236    -1.06   0.317    -.0505629    .0183136
   1.year_2002 |  -.0206485   .0092574    -2.23   0.053    -.0415903    .0002932
   1.year_2003 |  -.0132785   .0117348    -1.13   0.287    -.0398245    .0132675
   1.year_2004 |  -.0176934   .0066866    -2.65   0.027    -.0328195   -.0025672
   1.year_2005 |  -.0064508   .0088285    -0.73   0.484    -.0264223    .0135208
   1.year_2006 |    .000043   .0052736     0.01   0.994    -.0118868    .0119728
   1.year_2007 |   .0011984   .0038451     0.31   0.762    -.0074997    .0098965
   1.year_2008 |          0  (omitted)
   1.year_2009 |  -.0328212   .0090235    -3.64   0.005    -.0532339   -.0124085
   1.year_2010 |  -.0265568   .0066051    -4.02   0.003    -.0414987   -.0116149
   1.year_2011 |  -.0279175   .0079813    -3.50   0.007    -.0459724   -.0098627
   1.year_2012 |  -.0182896   .0081729    -2.24   0.052    -.0367779    .0001987
   1.year_2013 |  -.0258628   .0088613    -2.92   0.017    -.0459083   -.0058172
   1.year_2014 |  -.0263557   .0096767    -2.72   0.023    -.0482459   -.0044656
   1.year_2015 |  -.0257377   .0066887    -3.85   0.004    -.0408686   -.0106067
   1.year_2016 |  -.0219307   .0057815    -3.79   0.004    -.0350093    -.008852
   1.year_2017 |  -.0128201    .004703    -2.73   0.023     -.023459   -.0021811
   1.year_2018 |   .0006843   .0036736     0.19   0.856     -.007626    .0089945
   1.year_2019 |          0  (omitted)
         _cons |   .7861669   .0083406    94.26   0.000     .7672992    .8050347
--------------------------------------------------------------------------------

. outreg2 using "339t6.xls", ctitle("`x'") se 2aster append keep(post2009 treat treated3
> 5_2009) addtext(FE, YES)
339t6.xls
dir : seeout

. * Alterta as the treatment group 
. drop treat 

. gen treat = (prov == 48)

. drop treated48_2015 

. gen treated48_2015 = treat * post2015

. 
. reg employed_rate1519 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6226
                                                Root MSE          =     .02667

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0276941   .0180217     1.54   0.159    -.0130738    .0684619
         treat |   .0719679   .0038695    18.60   0.000     .0632143    .0807214
treated48_2015 |  -.0935957   .0156009    -6.00   0.000    -.1288875   -.0583039
     1.prov_10 |  -.1136892   .0014422   -78.83   0.000    -.1169516   -.1104267
     1.prov_11 |   .0391164   .0005233    74.74   0.000     .0379325    .0403003
     1.prov_12 |  -.0272896   .0007766   -35.14   0.000    -.0290463   -.0255329
     1.prov_13 |  -.0054253   .0008002    -6.78   0.000    -.0072354   -.0036152
     1.prov_24 |   .0207732   .0001829   113.55   0.000     .0203594     .021187
     1.prov_35 |  -.0017905   .0001965    -9.11   0.000    -.0022349   -.0013461
     1.prov_46 |   .0381175   .0001495   254.96   0.000     .0377793    .0384557
     1.prov_47 |   .0495746   .0004997    99.22   0.000     .0484444    .0507049
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0184878   .0311196     0.59   0.567    -.0519097    .0888853
   1.year_2002 |   .0305693   .0219394     1.39   0.197    -.0190611    .0801997
   1.year_2003 |   .0333769   .0174276     1.92   0.088    -.0060472    .0728009
   1.year_2004 |   .0294711   .0185755     1.59   0.147    -.0125497    .0714918
   1.year_2005 |   .0328752   .0167503     1.96   0.081    -.0050165    .0707669
   1.year_2006 |   .0377805   .0163316     2.31   0.046     .0008359    .0747251
   1.year_2007 |   .0565337    .015253     3.71   0.005      .022029    .0910384
   1.year_2008 |   .0604987   .0090572     6.68   0.000     .0400098    .0809876
   1.year_2009 |   .0169721   .0053682     3.16   0.012     .0048284    .0291158
   1.year_2010 |  -.0004639   .0064868    -0.07   0.945     -.015138    .0142102
   1.year_2011 |   .0027255   .0045645     0.60   0.565    -.0076002    .0130511
   1.year_2012 |  -.0054445    .006044    -0.90   0.391    -.0191169    .0082279
   1.year_2013 |  -.0108783   .0038766    -2.81   0.021    -.0196477   -.0021088
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0148807   .0168169    -0.88   0.399    -.0529232    .0231618
   1.year_2016 |  -.0184873   .0177558    -1.04   0.325    -.0586536     .021679
   1.year_2017 |  -.0089933   .0161235    -0.56   0.591    -.0454671    .0274805
   1.year_2018 |   .0009041   .0089166     0.10   0.921    -.0192666    .0210747
   1.year_2019 |          0  (omitted)
         _cons |   .4080532   .0054909    74.31   0.000      .395632    .4204744
--------------------------------------------------------------------------------

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster replace keep(post2015 treat treated
> 48_2015) addtext(FE, YES
) required
r(100);

end of do-file

r(100);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster replace keep(post2015 treat treated
> 48_2015) addtext(FE, YES
) required
r(100);

end of do-file

r(100);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. reg employed_rate1519 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6226
                                                Root MSE          =     .02667

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0276941   .0180217     1.54   0.159    -.0130738    .0684619
         treat |   .0719679   .0038695    18.60   0.000     .0632143    .0807214
treated48_2015 |  -.0935957   .0156009    -6.00   0.000    -.1288875   -.0583039
     1.prov_10 |  -.1136892   .0014422   -78.83   0.000    -.1169516   -.1104267
     1.prov_11 |   .0391164   .0005233    74.74   0.000     .0379325    .0403003
     1.prov_12 |  -.0272896   .0007766   -35.14   0.000    -.0290463   -.0255329
     1.prov_13 |  -.0054253   .0008002    -6.78   0.000    -.0072354   -.0036152
     1.prov_24 |   .0207732   .0001829   113.55   0.000     .0203594     .021187
     1.prov_35 |  -.0017905   .0001965    -9.11   0.000    -.0022349   -.0013461
     1.prov_46 |   .0381175   .0001495   254.96   0.000     .0377793    .0384557
     1.prov_47 |   .0495746   .0004997    99.22   0.000     .0484444    .0507049
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0184878   .0311196     0.59   0.567    -.0519097    .0888853
   1.year_2002 |   .0305693   .0219394     1.39   0.197    -.0190611    .0801997
   1.year_2003 |   .0333769   .0174276     1.92   0.088    -.0060472    .0728009
   1.year_2004 |   .0294711   .0185755     1.59   0.147    -.0125497    .0714918
   1.year_2005 |   .0328752   .0167503     1.96   0.081    -.0050165    .0707669
   1.year_2006 |   .0377805   .0163316     2.31   0.046     .0008359    .0747251
   1.year_2007 |   .0565337    .015253     3.71   0.005      .022029    .0910384
   1.year_2008 |   .0604987   .0090572     6.68   0.000     .0400098    .0809876
   1.year_2009 |   .0169721   .0053682     3.16   0.012     .0048284    .0291158
   1.year_2010 |  -.0004639   .0064868    -0.07   0.945     -.015138    .0142102
   1.year_2011 |   .0027255   .0045645     0.60   0.565    -.0076002    .0130511
   1.year_2012 |  -.0054445    .006044    -0.90   0.391    -.0191169    .0082279
   1.year_2013 |  -.0108783   .0038766    -2.81   0.021    -.0196477   -.0021088
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0148807   .0168169    -0.88   0.399    -.0529232    .0231618
   1.year_2016 |  -.0184873   .0177558    -1.04   0.325    -.0586536     .021679
   1.year_2017 |  -.0089933   .0161235    -0.56   0.591    -.0454671    .0274805
   1.year_2018 |   .0009041   .0089166     0.10   0.921    -.0192666    .0210747
   1.year_2019 |          0  (omitted)
         _cons |   .4080532   .0054909    74.31   0.000      .395632    .4204744
--------------------------------------------------------------------------------

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster replace keep(post2015 treat treated
> 48_2015) addtext(FE, YES
) required
r(100);

end of do-file

r(100);

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster replace keep(post2015 treat treated
> 48_2015) addtext(FE, YES)
339t7.xls
dir : seeout

. reg employed_rate2024 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 516,809,590)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,718,038
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8132
                                                Root MSE          =     .01624

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2024 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0193014   .0104571     1.85   0.098    -.0043543    .0429571
         treat |   .0640369   .0023936    26.75   0.000     .0586222    .0694516
treated48_2015 |  -.0543779    .008752    -6.21   0.000    -.0741763   -.0345796
     1.prov_10 |  -.1322744   .0008018  -164.98   0.000    -.1340882   -.1304607
     1.prov_11 |  -.0140112   .0002267   -61.80   0.000     -.014524   -.0134983
     1.prov_12 |  -.0384239   .0003583  -107.24   0.000    -.0392343   -.0376134
     1.prov_13 |  -.0476907   .0006521   -73.13   0.000     -.049166   -.0462155
     1.prov_24 |    .015952   .0003515    45.39   0.000     .0151569     .016747
     1.prov_35 |  -.0224443   .0000865  -259.59   0.000    -.0226399   -.0222487
     1.prov_46 |   .0383832    .000028  1370.63   0.000     .0383198    .0384465
     1.prov_47 |   .0299166   .0002239   133.64   0.000     .0294102     .030423
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0010994   .0133176     0.08   0.936    -.0290272    .0312259
   1.year_2002 |   .0060727   .0129953     0.47   0.651    -.0233247    .0354701
   1.year_2003 |   .0113701   .0124294     0.91   0.384    -.0167472    .0394874
   1.year_2004 |   .0098616   .0100777     0.98   0.353    -.0129357    .0326589
   1.year_2005 |    .011788   .0077406     1.52   0.162    -.0057223    .0292984
   1.year_2006 |   .0220001   .0096148     2.29   0.048     .0002499    .0437503
   1.year_2007 |   .0303523   .0080867     3.75   0.005      .012059    .0486456
   1.year_2008 |   .0228829   .0084584     2.71   0.024     .0037486    .0420171
   1.year_2009 |   -.011255   .0050949    -2.21   0.055    -.0227804    .0002705
   1.year_2010 |  -.0127184   .0030479    -4.17   0.002    -.0196132   -.0058236
   1.year_2011 |  -.0082612   .0036922    -2.24   0.052    -.0166135    .0000911
   1.year_2012 |  -.0087361   .0039724    -2.20   0.055    -.0177223      .00025
   1.year_2013 |  -.0053851   .0023088    -2.33   0.045    -.0106079   -.0001622
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0182384   .0077542    -2.35   0.043    -.0357796   -.0006973
   1.year_2016 |  -.0143233   .0065386    -2.19   0.056    -.0291146    .0004681
   1.year_2017 |  -.0060591   .0120518    -0.50   0.627    -.0333223     .021204
   1.year_2018 |  -.0095737   .0027913    -3.43   0.008    -.0158881   -.0032594
   1.year_2019 |          0  (omitted)
         _cons |   .6864357   .0036423   188.46   0.000     .6781962    .6946751
--------------------------------------------------------------------------------

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster append keep(post2015 treat treated4
> 8_2015) addtext(FE, YES)
339t7.xls
dir : seeout

. reg employed_rate2529 post2015 treat treated48_2015 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 518,555,002)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2014 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,683,498
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6726
                                                Root MSE          =     .01405

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2529 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2015 |   .0309626   .0087761     3.53   0.006     .0111097    .0508154
         treat |   .0369746   .0022586    16.37   0.000     .0318653    .0420838
treated48_2015 |  -.0372352   .0085855    -4.34   0.002     -.056657   -.0178134
     1.prov_10 |   -.103184    .000548  -188.30   0.000    -.1044236   -.1019444
     1.prov_11 |  -.0037913   .0003062   -12.38   0.000     -.004484   -.0030987
     1.prov_12 |  -.0199823   .0003536   -56.51   0.000    -.0207822   -.0191824
     1.prov_13 |   -.018734   .0007362   -25.45   0.000    -.0203993   -.0170686
     1.prov_24 |   .0158745   .0002067    76.82   0.000     .0154071     .016342
     1.prov_35 |   .0052054   .0000477   109.04   0.000     .0050974    .0053134
     1.prov_46 |   .0131609    .000037   356.01   0.000     .0130773    .0132445
     1.prov_47 |   .0230283   .0002679    85.97   0.000     .0224224    .0236343
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0033202   .0145897     0.23   0.825    -.0296841    .0363245
   1.year_2002 |  -.0012278   .0086933    -0.14   0.891    -.0208934    .0184379
   1.year_2003 |   .0060906   .0109114     0.56   0.590    -.0185926    .0307739
   1.year_2004 |   .0016234   .0063058     0.26   0.803    -.0126413     .015888
   1.year_2005 |   .0127939   .0083774     1.53   0.161    -.0061572     .031745
   1.year_2006 |   .0192045   .0045096     4.26   0.002      .009003    .0294059
   1.year_2007 |   .0203041   .0031076     6.53   0.000     .0132742    .0273341
   1.year_2008 |   .0190787    .002133     8.94   0.000     .0142536    .0239039
   1.year_2009 |  -.0063168   .0023993    -2.63   0.027    -.0117444   -.0008892
   1.year_2010 |   -.000037   .0046887    -0.01   0.994    -.0106437    .0105697
   1.year_2011 |  -.0014306   .0042751    -0.33   0.746    -.0111016    .0082405
   1.year_2012 |   .0081461   .0047205     1.73   0.118    -.0025325    .0188246
   1.year_2013 |   .0005307   .0065586     0.08   0.937    -.0143058    .0153673
   1.year_2014 |          0  (omitted)
   1.year_2015 |  -.0250977     .00685    -3.66   0.005    -.0405934   -.0096019
   1.year_2016 |  -.0213992   .0056605    -3.78   0.004    -.0342042   -.0085942
   1.year_2017 |  -.0124507   .0047349    -2.63   0.027    -.0231617   -.0017397
   1.year_2018 |   .0008532   .0036816     0.23   0.822    -.0074753    .0091816
   1.year_2019 |          0  (omitted)
         _cons |   .7722618   .0030011   257.32   0.000     .7654728    .7790509
--------------------------------------------------------------------------------

. outreg2 using "339t7.xls", ctitle("`x'") se 2aster append keep(post2015 treat treated4
> 8_2015) addtext(FE, YES)
339t7.xls
dir : seeout

. * BC as the treatment group
. drop treat 

. gen treat = (prov == 59)

. drop treated59_2012 

. gen treated59_2012 = treat * post2012

. 
. reg employed_rate1519 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 478,553,506)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,857,954
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5347
                                                Root MSE          =     .02962

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~1519 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0126384   .0215246     0.59   0.572    -.0360536    .0613305
         treat |  -.0519659   .0084279    -6.17   0.000    -.0710311   -.0329008
treated59_2012 |   .0107604   .0197505     0.54   0.599    -.0339183    .0554391
     1.prov_10 |  -.1616219    .001773   -91.16   0.000    -.1656328   -.1576111
     1.prov_11 |   -.008627   .0008288   -10.41   0.000     -.010502   -.0067521
     1.prov_12 |  -.0750952    .001101   -68.21   0.000    -.0775859   -.0726046
     1.prov_13 |  -.0532286   .0011136   -47.80   0.000    -.0557478   -.0507094
     1.prov_24 |  -.0269394   .0005028   -53.58   0.000    -.0280769    -.025802
     1.prov_35 |  -.0492898   .0000899  -548.21   0.000    -.0494932   -.0490864
     1.prov_46 |  -.0093344   .0000807  -115.70   0.000    -.0095169   -.0091519
     1.prov_47 |   .0019511   .0007635     2.56   0.031     .0002239    .0036783
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0157279    .034905     0.45   0.663    -.0632327    .0946886
   1.year_2002 |   .0278472   .0256677     1.08   0.306    -.0302172    .0859115
   1.year_2003 |   .0306751   .0210546     1.46   0.179    -.0169538     .078304
   1.year_2004 |   .0267845   .0221339     1.21   0.257    -.0232859     .076855
   1.year_2005 |   .0302077   .0196924     1.53   0.159    -.0143397    .0747551
   1.year_2006 |   .0351141   .0186377     1.88   0.092    -.0070474    .0772756
   1.year_2007 |    .053843   .0180668     2.98   0.015      .012973     .094713
   1.year_2008 |   .0577832    .008571     6.74   0.000     .0383942    .0771721
   1.year_2009 |    .014234   .0064919     2.19   0.056    -.0004517    .0289198
   1.year_2010 |   -.003206   .0037608    -0.85   0.416    -.0117135    .0053016
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0221606     .01879    -1.18   0.268    -.0646666    .0203455
   1.year_2013 |  -.0275631    .018686    -1.48   0.174    -.0698337    .0147076
   1.year_2014 |  -.0166398   .0202631    -0.82   0.433    -.0624781    .0291985
   1.year_2015 |  -.0147154   .0168409    -0.87   0.405    -.0528123    .0233814
   1.year_2016 |  -.0183878   .0177137    -1.04   0.326    -.0584591    .0216834
   1.year_2017 |  -.0089281   .0160768    -0.56   0.592    -.0452965    .0274402
   1.year_2018 |   .0009381   .0088935     0.11   0.918    -.0191805    .0210566
   1.year_2019 |          0  (omitted)
         _cons |   .4616143   .0085061    54.27   0.000     .4423722    .4808565
--------------------------------------------------------------------------------

. outreg2 using "339t8.xls", ctitle("`x'") se 2aster replace keep(post2012 treat treated
> 59_2012) addtext(FE, YES)
339t8.xls
dir : seeout

. reg employed_rate2024 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 516,809,590)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,718,038
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7777
                                                Root MSE          =     .01772

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2024 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0187036   .0106348     1.76   0.112     -.005354    .0427612
         treat |  -.0578258    .004354   -13.28   0.000    -.0676753   -.0479763
treated59_2012 |    .019582   .0099075     1.98   0.080    -.0028302    .0419943
     1.prov_10 |  -.1818189   .0007494  -242.62   0.000    -.1835141   -.1801237
     1.prov_11 |   -.063256   .0002251  -280.96   0.000    -.0637653   -.0627467
     1.prov_12 |  -.0877661   .0003351  -261.93   0.000    -.0885241   -.0870081
     1.prov_13 |  -.0971544   .0006127  -158.56   0.000    -.0985405   -.0957684
     1.prov_24 |  -.0333129   .0003421   -97.37   0.000    -.0340869   -.0325389
     1.prov_35 |  -.0715249   .0001564  -457.36   0.000    -.0718787   -.0711712
     1.prov_46 |  -.0107349   .0001384   -77.59   0.000    -.0110479   -.0104219
     1.prov_47 |  -.0193453   .0002138   -90.47   0.000    -.0198291   -.0188616
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0091991   .0134538     0.68   0.511    -.0212354    .0396336
   1.year_2002 |    .014204   .0139343     1.02   0.335    -.0173177    .0457256
   1.year_2003 |   .0195222   .0134535     1.45   0.181    -.0109118    .0499561
   1.year_2004 |   .0180369   .0107191     1.68   0.127    -.0062113    .0422851
   1.year_2005 |   .0200136   .0067595     2.96   0.016     .0047225    .0353047
   1.year_2006 |   .0302982   .0081903     3.70   0.005     .0117704     .048826
   1.year_2007 |   .0387078   .0057407     6.74   0.000     .0257214    .0516943
   1.year_2008 |   .0312668    .006053     5.17   0.001      .017574    .0449597
   1.year_2009 |  -.0028664   .0024905    -1.15   0.279    -.0085003    .0027675
   1.year_2010 |  -.0043975   .0017639    -2.49   0.034    -.0083878   -.0004072
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0217077   .0096886    -2.24   0.052    -.0436248    .0002095
   1.year_2013 |  -.0183528   .0079721    -2.30   0.047    -.0363869   -.0003187
   1.year_2014 |  -.0129704   .0087549    -1.48   0.173    -.0327754    .0068346
   1.year_2015 |  -.0184156   .0076234    -2.42   0.039    -.0356608   -.0011703
   1.year_2016 |  -.0144774   .0065422    -2.21   0.054    -.0292769     .000322
   1.year_2017 |  -.0061621   .0120483    -0.51   0.621    -.0334173    .0210931
   1.year_2018 |    -.00961   .0027942    -3.44   0.007    -.0159308   -.0032891
   1.year_2019 |          0  (omitted)
         _cons |   .7302389   .0041257   177.00   0.000     .7209059     .739572
--------------------------------------------------------------------------------

. outreg2 using "339t8.xls", ctitle("`x'") se 2aster append keep(post2012 treat treated5
> 9_2012) addtext(FE, YES)
339t8.xls
dir : seeout

. reg employed_rate2529 post2012 treat treated59_2012 i.prov_* i.year_* [aweight=fweight
> ], cluster(prov)
(sum of wgt is 518,555,002)
note: 1.prov_48 omitted because of collinearity.
note: 1.prov_59 omitted because of collinearity.
note: 1.year_2011 omitted because of collinearity.
note: 1.year_2019 omitted because of collinearity.

Linear regression                               Number of obs     =  1,683,498
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6447
                                                Root MSE          =     .01463

                                    (Std. err. adjusted for 10 clusters in prov)
--------------------------------------------------------------------------------
               |               Robust
employed_~2529 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
      post2012 |   .0245037   .0075723     3.24   0.010     .0073739    .0416335
         treat |  -.0366486   .0039305    -9.32   0.000    -.0455399   -.0277572
treated59_2012 |   .0237981   .0081127     2.93   0.017     .0054458    .0421504
     1.prov_10 |   -.129337   .0008028  -161.10   0.000    -.1311531   -.1275208
     1.prov_11 |  -.0298164   .0005907   -50.47   0.000    -.0311527   -.0284801
     1.prov_12 |  -.0460097   .0006369   -72.24   0.000    -.0474504    -.044569
     1.prov_13 |  -.0449966   .0009738   -46.21   0.000    -.0471993   -.0427938
     1.prov_24 |  -.0101655   .0004963   -20.48   0.000    -.0112881   -.0090429
     1.prov_35 |  -.0206753   .0003075   -67.24   0.000    -.0213709   -.0199798
     1.prov_46 |  -.0127097   .0003084   -41.21   0.000    -.0134075    -.012012
     1.prov_47 |  -.0027373   .0000904   -30.30   0.000    -.0029417   -.0025329
     1.prov_48 |          0  (omitted)
     1.prov_59 |          0  (omitted)
   1.year_2001 |   .0044326   .0159479     0.28   0.787    -.0316441    .0405092
   1.year_2002 |  -.0001236   .0097518    -0.01   0.990    -.0221836    .0219365
   1.year_2003 |   .0071897   .0112497     0.64   0.539    -.0182589    .0326383
   1.year_2004 |   .0027285   .0076555     0.36   0.730    -.0145895    .0200465
   1.year_2005 |   .0139298   .0103809     1.34   0.213    -.0095534    .0374131
   1.year_2006 |   .0203944   .0049063     4.16   0.002     .0092955    .0314933
   1.year_2007 |   .0215552   .0036152     5.96   0.000      .013377    .0297334
   1.year_2008 |   .0203887   .0051551     3.96   0.003      .008727    .0320503
   1.year_2009 |  -.0049469   .0029596    -1.67   0.129     -.011642    .0017482
   1.year_2010 |   .0013938   .0032486     0.43   0.678     -.005955    .0087427
   1.year_2011 |          0  (omitted)
   1.year_2012 |  -.0180741   .0081707    -2.21   0.054    -.0365576    .0004094
   1.year_2013 |  -.0256341   .0088623    -2.89   0.018     -.045682   -.0055861
   1.year_2014 |  -.0261197   .0097021    -2.69   0.025    -.0480673    -.004172
   1.year_2015 |  -.0255003   .0067176    -3.80   0.004    -.0406965   -.0103041
   1.year_2016 |  -.0217161   .0057877    -3.75   0.005    -.0348088   -.0086233
   1.year_2017 |  -.0126584    .004703    -2.69   0.025    -.0232974   -.0020194
   1.year_2018 |   .0007648   .0036682     0.21   0.839    -.0075332    .0090628
   1.year_2019 |          0  (omitted)
         _cons |   .7997049   .0026443   302.42   0.000      .793723    .8056868
--------------------------------------------------------------------------------

. outreg2 using "339t8.xls", ctitle("`x'") se 2aster append keep(post2012 treat treated5
> 9_2012) addtext(FE, YES)
339t8.xls
dir : seeout

. 
end of do-file

. collapse (mean) employed, by(prov survyear age_12)

. keep if survyear >=2007 & survyear <= 2017
(720 observations deleted)

. keep if age_12 >= 1 & age_12 <= 3
(660 observations deleted)

. drop if age_12 == 3
(110 observations deleted)

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia"))
>  ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, valuelabel) ylabel
> (, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g2, replace)

. * Install package grc1leg to create combined graphs with one shared legend 

. net install grc1leg,from( http://www.stata.com/users/vwiggins/)
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. grc1leg g1 g2 , legendfrom(g1) title("DiD Plot for Selected Provinces in Canada 2007-2
> 017")

. gr_edit legend.xoffset = -15

. gr_edit legend.yoffset = 15

. 
. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg g1 g2 , legendfrom(g1) title("DiD Plot for Selected Provinces in Canada 2007-2
> 017")

. gr_edit legend.xoffset = -10

. gr_edit legend.yoffset = 5

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg g1 g2 , legendfrom(g1) title("DiD Plot for Selected Provinces in Canada 2007-2
> 017")

. gr_edit legend.xoffset = 0

. gr_edit legend.yoffset = 5

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. grc1leg g1 g2 , legendfrom(g1) title("DiD Plot for Selected Provinces in Canada 2007-2
> 017")

. 
end of do-file

. do "/var/folders/94/2v09812s7_bb1q5dd2g4v8_h0000gn/T//SD83271.000000"

. twoway (line employed survyear if prov == 24&age_12 == 1, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 1, lc(red)) (line employed survyear if prov == 48&age_12
>  == 1, lc(green)) (line employed survyear if prov == 59&age_12 == 1, lc(orange)),legen
> d(label(1 "Quebec") label(2 "Ontario") label(3 "Alberta") label(4 "British Columbia") 
> col(4)) ytitle("Empl/Pop for age group 15-19") xlabel(2009 2012 2011 2015, valuelabel)
>  ylabel(, grid) name(g1, replace)

. twoway (line employed survyear if prov == 24&age_12 == 2, lc(blue)) (line employed sur
> vyear if prov == 35&age_12 == 2, lc(red)) (line employed survyear if prov == 48&age_12
>  == 2, lc(green)) (line employed survyear if prov == 59&age_12 == 2, lc(orange)),legen
> d(off) ytitle("Empl/Pop for age group 20-24") xlabel(2009 2012 2011 2015, valuelabel) 
> ylabel(, grid) name(g2, replace)

. * Install package grc1leg to create combined graphs with one shared legend 
. net install grc1leg,from( http://www.stata.com/users/vwiggins/)
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. grc1leg g1 g2 , legendfrom(g1) title("DiD Plot for Selected Provinces in Canada 2007-2
> 017")

. 
. 
end of do-file

. graph export "/Users/cherylz/Desktop/ECO339/339THA/339Graph.pdf", as(pdf) name("Graph"
> )
file /Users/cherylz/Desktop/ECO339/339THA/339Graph.pdf saved as PDF format

